{
    "id": "2",
    "formats": [
        {
            "format": "application/epub+zip",
            "fileName": "2.epub.images",
            "filePath": "http://www.gutenberg.org/ebooks/2.epub.images",
            "extension": "images"
        },
        {
            "format": "text/html",
            "fileName": "2/2-h/2-h.htm",
            "filePath": "http://www.gutenberg.org/files/2/2-h/2-h.htm",
            "extension": "htm"
        },
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "2.kindle.images",
            "filePath": "http://www.gutenberg.org/ebooks/2.kindle.images",
            "extension": "images"
        },
        {
            "format": "application/zip",
            "fileName": "2/2-h.zip",
            "filePath": "http://www.gutenberg.org/files/2/2-h.zip",
            "extension": "zip"
        },
        {
            "format": "text/plain",
            "fileName": "2.txt.utf-8",
            "filePath": "http://www.gutenberg.org/ebooks/2.txt.utf-8",
            "extension": "utf-8"
        },
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "2.kindle.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/2.kindle.noimages",
            "extension": "noimages"
        },
        {
            "format": "text/plain; charset=us-ascii",
            "fileName": "2/2.txt",
            "filePath": "http://www.gutenberg.org/files/2/2.txt",
            "extension": "txt"
        },
        {
            "format": "application/epub+zip",
            "fileName": "2.epub.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/2.epub.noimages",
            "extension": "noimages"
        },
        {
            "format": "application/rdf+xml",
            "fileName": "2.rdf",
            "filePath": "http://www.gutenberg.org/ebooks/2.rdf",
            "extension": "rdf"
        },
        {
            "format": "text/plain; charset=us-ascii",
            "fileName": "2/2.zip",
            "filePath": "http://www.gutenberg.org/files/2/2.zip",
            "extension": "zip"
        }
    ],
    "languages": [
        "en"
    ],
    "title": [
        "The United States Bill of Rights\r\nThe Ten Original Amendments to the Constitution of the United States"
    ],
    "author": "United States",
    "isTextAvailable": false,
    "issued": "1972-12-01",
    "wordcount": 1750,
    "book": "*******This file should be named 2.txt or 2.zip******\r\n\r\nWe apologize for the fact that the legal small print is longer,\r\nand more complicated, than the Etext itself, our legal beagles,\r\nof whom there are now a half dozen or so, insist this must be a\r\npart of any Project Gutenberg Etext we post, for our protection\r\nfrom the rest of the legal beagles out there.  The US has twice\r\nas many lawyers as the rest of the world combined!\r\n\r\nYou are free to delete the headers and just keep the Etexts, we\r\nare not free not to post it this way.  Again my apologies.  The\r\nnormal Project Gutenberg blurb has been deleted, you can get it\r\nin this location in most Project Gutenberg Etexts.  Thanks,  mh\r\n\r\n\r\n***START**THE SMALL PRINT!**FOR PUBLIC DOMAIN ETEXTS**START***\r\nWhy is this \"Small Print!\" statement here?  You know: lawyers.\r\nThey tell us you might sue us if there is something wrong with\r\nyour copy of this etext, even if you got it for free from\r\nsomeone other than us, and even if what's wrong is not our\r\nfault.  So, among other things, this \"Small Print!\" statement\r\ndisclaims most of our liability to you.  It also tells you how\r\nyou can distribute copies of this etext if you want to.\r\n\r\n*BEFORE!* YOU USE OR READ THIS ETEXT\r\nBy using or reading any part of this PROJECT GUTENBERG-tm\r\netext, you indicate that you understand, agree to and accept\r\nthis \"Small Print!\" statement.  If you do not, you can receive\r\na refund of the money (if any) you paid for this etext by\r\nsending a request within 30 days of receiving it to the person\r\nyou got it from.  If you received this etext on a physical\r\nmedium (such as a disk), you must return it with your request.\r\n\r\nABOUT PROJECT GUTENBERG-TM ETEXTS\r\nThis PROJECT GUTENBERG-tm etext, like most PROJECT GUTENBERG-\r\ntm etexts, is a \"public domain\" work distributed by Professor\r\nMichael S. Hart through the Project Gutenberg Association at\r\nIllinois Benedictine College (the \"Project\").  Among other\r\nthings, this means that no one owns a United States copyright\r\non or for this work, so the Project (and you!) can copy and\r\ndistribute it in the United States without permission and\r\nwithout paying copyright royalties.  Special rules, set forth\r\nbelow, apply if you wish to copy and distribute this etext\r\nunder the Project's \"PROJECT GUTENBERG\" trademark.\r\n\r\nTo create these etexts, the Project expends considerable\r\nefforts to identify, transcribe and proofread public domain\r\nworks.  Despite these efforts, the Project's etexts and any\r\nmedium they may be on may contain \"Defects\".  Among other\r\nthings, Defects may take the form of incomplete, inaccurate or\r\ncorrupt data, transcription errors, a copyright or other\r\nintellectual property infringement, a defective or damaged\r\ndisk or other etext medium, a computer virus, or computer\r\ncodes that damage or cannot be read by your equipment.\r\n\r\nLIMITED WARRANTY; DISCLAIMER OF DAMAGES\r\nBut for the \"Right of Replacement or Refund\" described below,\r\n[1] the Project (and any other party you may receive this\r\netext from as a PROJECT GUTENBERG-tm etext) disclaims all\r\nliability to you for damages, costs and expenses, including\r\nlegal fees, and [2] YOU HAVE NO REMEDIES FOR NEGLIGENCE OR\r\nUNDER STRICT LIABILITY, OR FOR BREACH OF WARRANTY OR CONTRACT,\r\nINCLUDING BUT NOT LIMITED TO INDIRECT, CONSEQUENTIAL, PUNITIVE\r\nOR INCIDENTAL DAMAGES, EVEN IF YOU GIVE NOTICE OF THE\r\nPOSSIBILITY OF SUCH DAMAGES.\r\n\r\nIf you discover a Defect in this etext within 90 days of\r\nreceiving it, you can receive a refund of the money (if any)\r\nyou paid for it by sending an explanatory note within that\r\ntime to the person you received it from.  If you received it\r\non a physical medium, you must return it with your note, and\r\nsuch person may choose to alternatively give you a replacement\r\ncopy.  If you received it electronically, such person may\r\nchoose to alternatively give you a second opportunity to\r\nreceive it electronically.\r\n\r\nTHIS ETEXT IS OTHERWISE PROVIDED TO YOU \"AS-IS\".  NO OTHER\r\nWARRANTIES OF ANY KIND, EXPRESS OR IMPLIED, ARE MADE TO YOU AS\r\nTO THE ETEXT OR ANY MEDIUM IT MAY BE ON, INCLUDING BUT NOT\r\nLIMITED TO WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A\r\nPARTICULAR PURPOSE.\r\n\r\nSome states do not allow disclaimers of implied warranties or\r\nthe exclusion or limitation of consequential damages, so the\r\nabove disclaimers and exclusions may not apply to you, and you\r\nmay have other legal rights.\r\n\r\nINDEMNITY\r\nYou will indemnify and hold the Project, its directors,\r\nofficers, members and agents harmless from all liability, cost\r\nand expense, including legal fees, that arise directly or\r\nindirectly from any of the following that you do or cause:\r\n[1] distribution of this etext, [2] alteration, modification,\r\nor addition to the etext, or [3] any Defect.\r\n\r\nDISTRIBUTION UNDER \"PROJECT GUTENBERG-tm\"\r\nYou may distribute copies of this etext electronically, or by\r\ndisk, book or any other medium if you either delete this\r\n\"Small Print!\" and all other references to Project Gutenberg,\r\nor:\r\n\r\n[1]  Only give exact copies of it.  Among other things, this\r\n     requires that you do not remove, alter or modify the\r\n     etext or this \"small print!\" statement.  You may however,\r\n     if you wish, distribute this etext in machine readable\r\n     binary, compressed, mark-up, or proprietary form,\r\n     including any form resulting from conversion by word pro-\r\n     cessing or hypertext software, but only so long as\r\n     *EITHER*:\r\n\r\n     [*]  The etext, when displayed, is clearly readable, and\r\n          does *not* contain characters other than those\r\n          intended by the author of the work, although tilde\r\n          (~), asterisk (*) and underline (_) characters may\r\n          be used to convey punctuation intended by the\r\n          author, and additional characters may be used to\r\n          indicate hypertext links; OR\r\n\r\n     [*]  The etext may be readily converted by the reader at\r\n          no expense into plain ASCII, EBCDIC or equivalent\r\n          form by the program that displays the etext (as is\r\n          the case, for instance, with most word processors);\r\n          OR\r\n\r\n     [*]  You provide, or agree to also provide on request at\r\n          no additional cost, fee or expense, a copy of the\r\n          etext in its original plain ASCII form (or in EBCDIC\r\n          or other equivalent proprietary form).\r\n\r\n[2]  Honor the etext refund and replacement provisions of this\r\n     \"Small Print!\" statement.\r\n\r\n[3]  Pay a trademark license fee to the Project of 20% of the\r\n     net profits you derive calculated using the method you\r\n     already use to calculate your applicable taxes.  If you\r\n     don't derive profits, no royalty is due.  Royalties are\r\n     payable to \"Project Gutenberg Association / Illinois\r\n     Benedictine College\" within the 60 days following each\r\n     date you prepare (or were legally required to prepare)\r\n     your annual (or equivalent periodic) tax return.\r\n\r\nWHAT IF YOU *WANT* TO SEND MONEY EVEN IF YOU DON'T HAVE TO?\r\nThe Project gratefully accepts contributions in money, time,\r\nscanning machines, OCR software, public domain etexts, royalty\r\nfree copyright licenses, and every other sort of contribution\r\nyou can think of.  Money should be paid to \"Project Gutenberg\r\nAssociation / Illinois Benedictine College\".\r\n\r\nThis \"Small Print!\" by Charles B. Kramer, Attorney\r\nInternet (72600.2026@compuserve.com); TEL: (212-254-5093)\r\n*END*THE SMALL PRINT! FOR PUBLIC DOMAIN ETEXTS*Ver.04.29.93*END*\r\n\r\n\r\nAll of the original Project Gutenberg Etexts from the\r\n1970's were produced in ALL CAPS, no lower case.  The\r\ncomputers we used then didn't have lower case at all.\r\n\r\n***\r\n\r\nThese original Project Gutenberg Etexts will be compiled into a file\r\ncontaining them all, in order to improve the content ratios of Etext\r\nto header material.\r\n\r\n***\r\n\r\n\r\n\r\nThe United States Bill of Rights.\r\n\r\nThe Ten Original Amendments to the Constitution of the United States\r\nPassed by Congress September 25, 1789\r\nRatified December 15, 1791\r\n\r\n\r\n\r\nI\r\n\r\nCongress shall make no law respecting an establishment of religion,\r\nor prohibiting the free exercise thereof; or abridging the freedom of speech,\r\nor of the press, or the right of the people peaceably to assemble,\r\nand to petition the Government for a redress of grievances.\r\n\r\n\r\nII\r\n\r\nA well-regulated militia, being necessary to the security of a free State,\r\nthe right of the people to keep and bear arms, shall not be infringed.\r\n\r\n\r\nIII\r\nNo soldier shall, in time of peace be quartered in any house,\r\nwithout the consent of the owner, nor in time of war,\r\nbut in a manner to be prescribed by law.\r\n\r\n\r\nIV\r\n\r\nThe right of the people to be secure in their persons, houses, papers,\r\nand effects, against unreasonable searches and seizures, shall not be violated,\r\nand no Warrants shall issue, but upon probable cause, supported by oath\r\nor affirmation, and particularly describing the place to be searched,\r\nand the persons or things to be seized.\r\n\r\n\r\nV\r\n\r\nNo person shall be held to answer for a capital, or otherwise infamous crime,\r\nunless on a presentment or indictment of a Grand Jury, except in cases arising\r\nin the land or naval forces, or in the Militia, when in actual service\r\nin time of War or public danger; nor shall any person be subject for\r\nthe same offense to be twice put in jeopardy of life or limb;\r\nnor shall be compelled in any criminal case to be a witness against himself,\r\nnor be deprived of life, liberty, or property, without due process of law;\r\nnor shall private property be taken for public use without just compensation.\r\n\r\n\r\nVI\r\n\r\nIn all criminal prosecutions, the accused shall enjoy the right to a\r\nspeedy and public trial, by an impartial jury of the State and district\r\nwherein the crime shall have been committed, which district shall have\r\nbeen previously ascertained by law, and to be informed of the nature\r\nand cause of the accusation; to be confronted with the witnesses against him;\r\nto have compulsory process for obtaining witnesses in his favor,\r\nand to have the assistance of counsel for his defense.\r\n\r\n\r\nVII\r\n\r\nIn suits at common law, where the value in controversy shall exceed\r\ntwenty dollars, the right of trial by jury shall be preserved,\r\nand no fact tried by a jury shall be otherwise re-examined in any court\r\nof the United States, than according to the rules of the common law.\r\n\r\n\r\nVIII\r\n\r\nExcessive bail shall not be required nor excessive fines imposed,\r\nnor cruel and unusual punishments inflicted.\r\n\r\n\r\nIX\r\n\r\nThe enumeration in the Constitution, of certain rights,\r\nshall not be construed to deny or disparage others retained by the people.\r\n\r\nX\r\n\r\nThe powers not delegated to the United States by the Constitution,\r\nnor prohibited by it to the States, are reserved to the States respectively,\r\nor to the people.\r\n\r\n"
}