{
    "id": "3",
    "formats": [
        {
            "format": "text/plain; charset=us-ascii",
            "fileName": "3/3.zip",
            "filePath": "http://www.gutenberg.org/files/3/3.zip",
            "extension": "zip"
        },
        {
            "format": "text/plain; charset=us-ascii",
            "fileName": "3/3.txt",
            "filePath": "http://www.gutenberg.org/files/3/3.txt",
            "extension": "txt"
        },
        {
            "format": "application/zip",
            "fileName": "3/3-h.zip",
            "filePath": "http://www.gutenberg.org/files/3/3-h.zip",
            "extension": "zip"
        },
        {
            "format": "application/rdf+xml",
            "fileName": "3.rdf",
            "filePath": "http://www.gutenberg.org/ebooks/3.rdf",
            "extension": "rdf"
        },
        {
            "format": "application/epub+zip",
            "fileName": "3.epub.images",
            "filePath": "http://www.gutenberg.org/ebooks/3.epub.images",
            "extension": "images"
        },
        {
            "format": "application/epub+zip",
            "fileName": "3.epub.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/3.epub.noimages",
            "extension": "noimages"
        },
        {
            "format": "text/plain",
            "fileName": "3.txt.utf-8",
            "filePath": "http://www.gutenberg.org/ebooks/3.txt.utf-8",
            "extension": "utf-8"
        },
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "3.kindle.images",
            "filePath": "http://www.gutenberg.org/ebooks/3.kindle.images",
            "extension": "images"
        },
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "3.kindle.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/3.kindle.noimages",
            "extension": "noimages"
        },
        {
            "format": "text/html",
            "fileName": "3/3-h/3-h.htm",
            "filePath": "http://www.gutenberg.org/files/3/3-h/3-h.htm",
            "extension": "htm"
        }
    ],
    "languages": [
        "en"
    ],
    "title": [
        "John F. Kennedy's Inaugural Address"
    ],
    "author": "Kennedy, John F. (John Fitzgerald)",
    "isTextAvailable": false,
    "issued": "1973-11-01",
    "wordcount": 2673,
    "book": "*******This file should be named 3.txt or 3.zip*******\r\n\r\n\r\n[Etext #3] November 22, 1973, 10th Anniversary of Assassination\r\n[Officially rereleased for November 22, 1993, 30th Anniversary]\r\n\r\nWe apologize for the fact that the legal small print is longer,\r\nand more complicated, than the Etext itself, our legal beagles,\r\nof whom there are now a half dozen or so, insist this must be a\r\npart of any Project Gutenberg Etext we post, for our protection\r\nfrom the rest of the legal beagles out there.  The US has twice\r\nas many lawyers as the rest of the world combined!\r\n\r\nYou are free to delete the headers and just keep the Etexts, we\r\nare not free not to post it this way.  Again my apologies.  The\r\nnormal Project Gutenberg blurb has been deleted, you can get it\r\nin this location in most Project Gutenberg Etexts.  Thanks,  mh\r\n\r\nWe will rerelease all of the early short Project Gutenberg text\r\nfiles combined as one file, with only one header, as requested,\r\nby several of the organizations reposting our books, who should\r\nlike to save space and time for themselves and their readers.\r\n\r\n\r\n***START**THE SMALL PRINT!**FOR PUBLIC DOMAIN ETEXTS**START***\r\nWhy is this \"Small Print!\" statement here?  You know: lawyers.\r\nThey tell us you might sue us if there is something wrong with\r\nyour copy of this etext, even if you got it for free from\r\nsomeone other than us, and even if what's wrong is not our\r\nfault.  So, among other things, this \"Small Print!\" statement\r\ndisclaims most of our liability to you.  It also tells you how\r\nyou can distribute copies of this etext if you want to.\r\n\r\n*BEFORE!* YOU USE OR READ THIS ETEXT\r\nBy using or reading any part of this PROJECT GUTENBERG-tm\r\netext, you indicate that you understand, agree to and accept\r\nthis \"Small Print!\" statement.  If you do not, you can receive\r\na refund of the money (if any) you paid for this etext by\r\nsending a request within 30 days of receiving it to the person\r\nyou got it from.  If you received this etext on a physical\r\nmedium (such as a disk), you must return it with your request.\r\n\r\nABOUT PROJECT GUTENBERG-TM ETEXTS\r\nThis PROJECT GUTENBERG-tm etext, like most PROJECT GUTENBERG-\r\ntm etexts, is a \"public domain\" work distributed by Professor\r\nMichael S. Hart through the Project Gutenberg Association at\r\nIllinois Benedictine College (the \"Project\").  Among other\r\nthings, this means that no one owns a United States copyright\r\non or for this work, so the Project (and you!) can copy and\r\ndistribute it in the United States without permission and\r\nwithout paying copyright royalties.  Special rules, set forth\r\nbelow, apply if you wish to copy and distribute this etext\r\nunder the Project's \"PROJECT GUTENBERG\" trademark.\r\n\r\nTo create these etexts, the Project expends considerable\r\nefforts to identify, transcribe and proofread public domain\r\nworks.  Despite these efforts, the Project's etexts and any\r\nmedium they may be on may contain \"Defects\".  Among other\r\nthings, Defects may take the form of incomplete, inaccurate or\r\ncorrupt data, transcription errors, a copyright or other\r\nintellectual property infringement, a defective or damaged\r\ndisk or other etext medium, a computer virus, or computer\r\ncodes that damage or cannot be read by your equipment.\r\n\r\nLIMTED WARRANTY; DISCLAIMER OF DAMAGES\r\nBut for the \"Right of Replacement or Refund\" described below,\r\n[1] the Project (and any other party you may receive this\r\netext from as a PROJECT GUTENBERG-tm etext) disclaims all\r\nliability to you for damages, costs and expenses, including\r\nlegal fees, and [2] YOU HAVE NO REMEDIES FOR NEGLIGENCE OR\r\nUNDER STRICT LIABILITY, OR FOR BREACH OF WARRANTY OR CONTRACT,\r\nINCLUDING BUT NOT LIMITED TO INDIRECT, CONSEQUENTIAL, PUNITIVE\r\nOR INCIDENTAL DAMAGES, EVEN IF YOU GIVE NOTICE OF THE\r\nPOSSIBILITY OF SUCH DAMAGES.\r\n\r\nIf you discover a Defect in this etext within 90 days of\r\nreceiving it, you can receive a refund of the money (if any)\r\nyou paid for it by sending an explanatory note within that\r\ntime to the person you received it from.  If you received it\r\non a physical medium, you must return it with your note, and\r\nsuch person may choose to alternatively give you a replacement\r\ncopy.  If you received it electronically, such person may\r\nchoose to alternatively give you a second opportunity to\r\nreceive it electronically.\r\n\r\nTHIS ETEXT IS OTHERWISE PROVIDED TO YOU \"AS-IS\".  NO OTHER\r\nWARRANTIES OF ANY KIND, EXPRESS OR IMPLIED, ARE MADE TO YOU AS\r\nTO THE ETEXT OR ANY MEDIUM IT MAY BE ON, INCLUDING BUT NOT\r\nLIMITED TO WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A\r\nPARTICULAR PURPOSE.\r\n\r\nSome states do not allow disclaimers of implied warranties or\r\nthe exclusion or limitation of consequential damages, so the\r\nabove disclaimers and exclusions may not apply to you, and you\r\nmay have other legal rights.\r\n\r\nINDEMNITY\r\nYou will indemnify and hold the Project, its directors,\r\nofficers, members and agents harmless from all liability, cost\r\nand expense, including legal fees, that arise directly or\r\nindirectly from any of the following that you do or cause:\r\n[1] distribution of this etext, [2] alteration, modification,\r\nor addition to the etext, or [3] any Defect.\r\n\r\nDISTRIBUTION UNDER \"PROJECT GUTENBERG-tm\"\r\nYou may distribute copies of this etext electronically, or by\r\ndisk, book or any other medium if you either delete this\r\n\"Small Print!\" and all other references to Project Gutenberg,\r\nor:\r\n\r\n[1]  Only give exact copies of it.  Among other things, this\r\n     requires that you do not remove, alter or modify the\r\n     etext or this \"small print!\" statement.  You may however,\r\n     if you wish, distribute this etext in machine readable\r\n     binary, compressed, mark-up, or proprietary form,\r\n     including any form resulting from conversion by word pro-\r\n     cessing or hypertext software, but only so long as\r\n     *EITHER*:\r\n\r\n     [*]  The etext, when displayed, is clearly readable, and\r\n          does *not* contain characters other than those\r\n          intended by the author of the work, although tilde\r\n          (~), asterisk (*) and underline (_) characters may\r\n          be used to convey punctuation intended by the\r\n          author, and additional characters may be used to\r\n          indicate hypertext links; OR\r\n\r\n     [*]  The etext may be readily converted by the reader at\r\n          no expense into plain ASCII, EBCDIC or equivalent\r\n          form by the program that displays the etext (as is\r\n          the case, for instance, with most word processors);\r\n          OR\r\n\r\n     [*]  You provide, or agree to also provide on request at\r\n          no additional cost, fee or expense, a copy of the\r\n          etext in its original plain ASCII form (or in EBCDIC\r\n          or other equivalent proprietary form).\r\n\r\n[2]  Honor the etext refund and replacement provisions of this\r\n     \"Small Print!\" statement.\r\n\r\n[3]  Pay a trademark license fee to the Project of 20% of the\r\n     net profits you derive calculated using the method you\r\n     already use to calculate your applicable taxes.  If you\r\n     don't derive profits, no royalty is due.  Royalties are\r\n     payable to \"Project Gutenberg Association / Illinois\r\n     Benedictine College\" within the 60 days following each\r\n     date you prepare (or were legally required to prepare)\r\n     your annual (or equivalent periodic) tax return.\r\n\r\nWHAT IF YOU *WANT* TO SEND MONEY EVEN IF YOU DON'T HAVE TO?\r\nThe Project gratefully accepts contributions in money, time,\r\nscanning machines, OCR software, public domain etexts, royalty\r\nfree copyright licenses, and every other sort of contribution\r\nyou can think of.  Money should be paid to \"Project Gutenberg\r\nAssociation / Illinois Benedictine College\".\r\n\r\nThis \"Small Print!\" by Charles B. Kramer, Attorney\r\nInternet (72600.2026@compuserve.com); TEL: (212-254-5093)\r\n*END*THE SMALL PRINT! FOR PUBLIC DOMAIN ETEXTS*Ver.04.29.93*END*\r\n\r\n\r\nAll of the original Project Gutenberg Etexts from the\r\n1970's were produced in ALL CAPS, no lower case.  The\r\ncomputers we used then didn't have lower case at all.\r\n\r\n\r\nThis is a retranscription of one of the first Project\r\nGutenberg Etexts, offically dated November 22, 1973--\r\nand now officially re-released on November 22, 1993--\r\non the 30th anniversary of his assassination.\r\n\r\n\r\n\r\n\r\nJFK's Inaugural Address, January 20, 1961, 12:11 EST\r\n\r\n\r\nWe observe today not a victory of party but a celebration of freedom. . .\r\nsymbolizing an end as well as a beginning. . .signifying renewal\r\nas well as change for I have sworn before you and Almighty God\r\nthe same solemn oath our forbears prescribed nearly a century\r\nand three-quarters ago.\r\n\r\nThe world is very different now, for man holds in his mortal hands\r\nthe power to abolish all forms of human poverty and all forms of human life.\r\nAnd yet the same revolutionary beliefs for which our forbears fought\r\nare still at issue around the globe. . .the belief that the rights of man\r\ncome not from the generosity of the state but from the hand of God.\r\nWe dare not forget today that we are the heirs of that first revolution.\r\n\r\nLet the word go forth from this time and place. . .to friend and foe alike. . .\r\nthat the torch has been passed to a new generation of Americans. . .\r\nborn in this century, tempered by war, disciplined by a hard and bitter peace,\r\nproud of our ancient heritage. . .and unwilling to witness or permit the slow\r\nundoing of those human rights to which this nation has always been committed,\r\nand to which we are committed today. . .at home and around the world.\r\n\r\nLet every nation know. . .whether it wishes us well or ill. . .\r\nthat we shall pay any price, bear any burden, meet any hardship,\r\nsupport any friend, oppose any foe, to assure the survival and\r\nthe success of liberty.  This much we pledge. . .and more.\r\n\r\nTo those old allies whose cultural and spiritual origins we share:\r\nwe pledge the loyalty of faithful friends.  United. . .there is\r\nlittle we cannot do in a host of co-operative ventures.\r\nDivided. . .there is little we can do. . .for we dare not meet\r\na powerful challenge, at odds, and split asunder.\r\nTo those new states whom we welcome to the ranks of the free:\r\nwe pledge our word that one form of colonial control shall not\r\nhave passed away merely to be replaced by a far more iron tyranny.\r\nWe shall not always expect to find them supporting our view.\r\nBut we shall always hope to find them strongly supporting their\r\nown freedom. . .and to remember that. . .in the past. . .those who\r\nfoolishly sought power by riding the back of the tiger ended up inside.\r\nTo those people in the huts and villages of half the globe\r\nstruggling to break the bonds of mass misery:  we pledge our best\r\nefforts to help them help themselves, for whatever period\r\nis required. . .not because the Communists may be doing it,\r\nnot because we seek their votes, but because it is right.\r\nIf a free society cannot help the many who are poor,\r\nit cannot save the few who are rich.\r\n\r\nTo our sister republics south of our border:  we offer a special pledge. . .\r\nto convert our good words into good deeds. . .in a new alliance for progress\r\n. . .to assist free men and free governments in casting off the chains of\r\npoverty.  But this peaceful revolution of hope cannot become the prey of\r\nhostile powers.  Let all our neighbors know that we shall join with them\r\nto oppose aggression or subversion anywhere in the Americas. . .and let\r\nevery other power know that this hemisphere intends to remain the master\r\nof its own house.\r\n\r\nTo that world assembly of sovereign states:  the United Nations. . .\r\nour last best hope in an age where the instruments of war\r\nhave far outpaced the instruments of peace, we renew our pledge\r\nof support. . .to prevent it from becoming merely a forum for\r\ninvective. . .to strengthen its shield of the new and the weak. . .\r\nand to enlarge the area in which its writ may run.\r\n\r\nFinally, to those nations who would make themselves our adversaries,\r\nwe offer not a pledge but a request:  that both sides begin anew\r\nthe quest for peace; before the dark powers of destruction unleashed\r\nby science engulf all humanity in planned or accidental self-destruction.\r\nWe dare not tempt them with weakness.  For only when our arms are sufficient\r\nbeyond doubt can we be certain beyond doubt that they will never be employed.\r\nBut neither can two great and powerful groups of nations take comfort from\r\nour present course. . .both sides overburdened by the cost of modern weapons,\r\nboth rightly alarmed by the steady spread of the deadly atom, yet both racing\r\nto alter that uncertain balance of terror that stays the hand of Mankind's\r\nfinal war.\r\n\r\nSo let us begin anew. . .remembering on both sides that civility\r\nis not a sign of weakness, and sincerity is always subject to proof.\r\nLet us never negotiate out of fear, but let us never fear to negotiate.\r\nLet both sides explore what problems unite us instead of belaboring\r\nthose problems which divide us.  Let both sides, for the first time,\r\nformulate serious and precise proposals for the inspection and\r\ncontrol of arms. . .and bring the absolute power to destroy\r\nother nations under the absolute control of all nations.\r\nLet both sides seek to invoke the wonders of science instead\r\nof its terrors.  Together let us explore the stars, conquer the\r\ndeserts, eradicate disease, tap the ocean depths, and encourage\r\nthe arts and commerce.  Let both sides unite to heed in all corners\r\nof the earth the command of Isaiah. . .to \"undo the heavy burdens. . .\r\nlet the oppressed go free.\"\r\n\r\nAnd if a beachhead of co-operation may push back the jungle of suspicion. . .\r\nlet both sides join in creating not a new balance of power. . .\r\nbut a new world of law. . .where the strong are just. . .\r\nand the weak secure. . .and the peace preserved. . . .\r\n\r\nAll this will not be finished in the first one hundred days.\r\nNor will it be finished in the first one thousand days. . .\r\nnor in the life of this administration, nor even perhaps\r\nin our lifetime on this planet.  But let us begin.\r\n\r\nIn your hands, my fellow citizens. . .more than mine. . .will rest the\r\nfinal success or failure of our course.  Since this country was founded,\r\neach generation of Americans has been summoned to give testimony\r\nto its national loyalty.  The graves of young Americans who answered\r\nthe call to service surround the globe.  Now the trumpet summons us again. . .\r\nnot as a call to bear arms, though arms we need. . .not as a call to battle. . .\r\nthough embattled we are. . .but a call to bear the burden of a long\r\ntwilight struggle. . .year in and year out, rejoicing in hope,\r\npatient in tribulation. . .a struggle against the common enemies of man:\r\ntyranny. . .poverty. . .disease. . .and war itself.  Can we forge against\r\nthese enemies a grand and global alliance. . .North and South. . .\r\nEast and West. . .that can assure a more fruitful life for all mankind?\r\nWill you join in that historic effort?\r\n\r\nIn the long history of the world, only a few generations have been granted\r\nthe role of defending freedom in its hour of maximum danger; I do not shrink\r\nfrom this responsibility. . .I welcome it.  I do not believe that any of us\r\nwould exchange places with any other people or any other generation.\r\nThe energy, the faith, the devotion which we bring to this endeavor\r\nwill light our country and all who serve it. . .and the glow from\r\nthat fire can truly light the world.\r\n\r\nAnd so, my fellow Americans. . .ask not what your country can\r\ndo for you. . .ask what you can do for your country.  My fellow\r\ncitizens of the world. . .ask not what America will do for you,\r\nbut what together we can do for the Freedom of Man.\r\n\r\nFinally, whether you are citizens of America or citizens of the world,\r\nask of us here the same high standards of strength and sacrifice\r\nwhich we ask of you.  With a good conscience our only sure reward,\r\nwith history the final judge of our deeds; let us go forth to lead\r\nthe land we love, asking His blessing and His help, but knowing that\r\nhere on earth God's work must truly be our own.\r\n\r\n"
}