{
    "id": "42",
    "formats": [
        {
            "format": "text/plain; charset=us-ascii",
            "fileName": "42/42.zip",
            "filePath": "http://www.gutenberg.org/files/42/42.zip",
            "extension": "zip"
        },
        {
            "format": "text/html",
            "fileName": "42.html.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/42.html.noimages",
            "extension": "noimages"
        },
        {
            "format": "text/plain; charset=us-ascii",
            "fileName": "42/42.txt",
            "filePath": "http://www.gutenberg.org/files/42/42.txt",
            "extension": "txt"
        },
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "42.kindle.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/42.kindle.noimages",
            "extension": "noimages"
        },
        {
            "format": "text/html",
            "fileName": "42.html.images",
            "filePath": "http://www.gutenberg.org/ebooks/42.html.images",
            "extension": "images"
        },
        {
            "format": "application/epub+zip",
            "fileName": "42.epub.images",
            "filePath": "http://www.gutenberg.org/ebooks/42.epub.images",
            "extension": "images"
        },
        {
            "format": "application/rdf+xml",
            "fileName": "42.rdf",
            "filePath": "http://www.gutenberg.org/ebooks/42.rdf",
            "extension": "rdf"
        },
        {
            "format": "application/epub+zip",
            "fileName": "42.epub.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/42.epub.noimages",
            "extension": "noimages"
        },
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "42.kindle.images",
            "filePath": "http://www.gutenberg.org/ebooks/42.kindle.images",
            "extension": "images"
        },
        {
            "format": "text/plain",
            "fileName": "42.txt.utf-8",
            "filePath": "http://www.gutenberg.org/ebooks/42.txt.utf-8",
            "extension": "utf-8"
        }
    ],
    "languages": [
        "en"
    ],
    "title": [
        "The Strange Case of Dr. Jekyll and Mr. Hyde"
    ],
    "author": "Stevenson, Robert Louis",
    "isTextAvailable": false,
    "issued": "1992-10-01",
    "wordcount": 26119,
    "book": "\r\n\r\n\r\n[Editor's Note: It has been called to our attention that Project Gutenberg ebook #43 which is the same title as this, is much easier to read than file #42 which you have presently opened.]\r\n\r\n\r\n\r\n\r\n                               STRANGE CASE OF\r\n                               DR. JEKYLL AND\r\n                                  MR. HYDE\r\n\r\n                                     BY\r\n                            ROBERT LOUIS STEVENSON\r\n\r\n\r\n\r\n\r\n1)\r\n\r\n\r\n\r\n                             STORY OF THE DOOR\r\n\r\nMR. UTTERSON the lawyer was a man of a rugged countenance, that was\r\nnever lighted by a smile; cold, scanty and embarrassed in\r\ndiscourse; backward in sentiment; lean, long, dusty, dreary, and\r\nyet somehow lovable. At friendly meetings, and when the wine was to\r\nhis taste, something eminently human beaconed from his eye;\r\nsomething indeed which never found its way into his talk, but which\r\nspoke not only in these silent symbols of the after-dinner face, but\r\nmore often and loudly in the acts of his life. He was austere with\r\nhimself; drank gin when he was alone, to mortify a taste for\r\nvintages; and though he enjoyed the theatre, had not crossed the\r\ndoors of one for twenty years. But he had an approved tolerance for\r\nothers; sometimes wondering, almost with envy, at the high pressure\r\nof spirits involved in their misdeeds; and in any extremity inclined\r\nto help rather than to reprove.\r\n\r\n2)\r\n\r\n\"I incline to Cain's heresy,\" he used to say quaintly: \"I let my\r\nbrother go to the devil in his own way.\" In this character, it was\r\nfrequently his fortune to be the last reputable acquaintance and the\r\nlast good influence in the lives of down-going men. And to such as\r\nthese, so long as they came about his chambers, he never marked a\r\nshade of change in his demeanour.\r\n\r\nNo doubt the feat was easy to Mr. Utterson; for he was\r\nundemonstrative at the best, and even his friendship seemed to be\r\nfounded in a similar catholicity of good-nature. It is the mark of a\r\nmodest man to accept his friendly circle ready-made from the hands\r\nof opportunity; and that was the lawyer's way. His friends were\r\nthose of his own blood or those whom he had known the longest; his\r\naffections, like ivy, were the growth of time, they implied no\r\naptness in the object. Hence, no doubt, the bond that united him to\r\nMr. Richard Enfield, his distant kinsman, the well-known man about\r\ntown. It was a nut to crack for many, what these two could see in\r\neach other, or what subject they could find in common. It was\r\nreported by those who encountered them in their Sunday walks, that\r\nthey said nothing, looked singularly dull, and would hail with\r\nobvious relief the appearance of a friend. For all that, the two men\r\nput the greatest store by these excursions, counted them the chief\r\njewel of each week, and not only set aside occasions of pleasure,\r\nbut even resisted the calls\r\n\r\n3)\r\n\r\nof business, that they might enjoy them uninterrupted.\r\n\r\nIt chanced on one of these rambles that their way led them down a\r\nby-street in a busy quarter of London. The street was small and\r\nwhat is called quiet, but it drove a thriving trade on the\r\nweek-days. The inhabitants were all doing well, it seemed, and all\r\nemulously hoping to do better still, and laying out the surplus of\r\ntheir gains in coquetry; so that the shop fronts stood along that\r\nthoroughfare with an air of invitation, like rows of smiling\r\nsaleswomen. Even on Sunday, when it veiled its more florid charms\r\nand lay comparatively empty of passage, the street shone out in\r\ncontrast to its dingy neighbourhood, like a fire in a forest; and\r\nwith its freshly painted shutters, well-polished brasses, and\r\ngeneral cleanliness and gaiety of note, instantly caught and pleased\r\nthe eye of the passenger.\r\n\r\nTwo doors from one corner, on the left hand going east, the line\r\nwas broken by the entry of a court; and just at that point, a\r\ncertain sinister block of building thrust forward its gable on the\r\nstreet. It was two stories high; showed no window, nothing but a\r\ndoor on the lower story and a blind forehead of discoloured wall on\r\nthe upper; and bore in every feature, the marks of prolonged and\r\nsordid negligence. The door, which was equipped with neither bell\r\nnor knocker, was blistered and distained. Tramps slouched into the\r\nrecess and struck matches on\r\n\r\n4)\r\n\r\nthe panels; children kept shop upon the steps; the schoolboy had\r\ntried his knife on the mouldings; and for close on a generation, no\r\none had appeared to drive away these random visitors or to repair\r\ntheir ravages.\r\n\r\nMr. Enfield and the lawyer were on the other side of the by-street;\r\nbut when they came abreast of the entry, the former lifted up his\r\ncane and pointed.\r\n\r\n\"Did you ever remark that door?\" he asked; and when his companion\r\nhad replied in the affirmative, \"It is connected in my mind,\" added\r\nhe, \"with a very odd story.\"\r\n\r\n\"Indeed?\" said Mr. Utterson, with a slight change of voice, \"and\r\nwhat was that?\"\r\n\r\n\"Well, it was this way,\" returned Mr. Enfield: \"I was coming home\r\nfrom some place at the end of the world, about three o'clock of a\r\nblack winter morning, and my way lay through a part of town where\r\nthere was literally nothing to be seen but lamps. Street after\r\nstreet, and all the folks asleep--street after street, all lighted\r\nup as if for a procession and all as empty as a church--till at\r\nlast I got into that state of mind when a man listens and listens\r\nand begins to long for the sight of a policeman. All at once, I saw\r\ntwo figures: one a little man who was stumping along eastward at a\r\ngood walk, and the other a girl of maybe eight or ten who was\r\nrunning as hard as she was able down a cross street. Well, sir, the\r\ntwo ran into one another naturally enough at the\r\n\r\n5)\r\n\r\ncorner; and then came the horrible part of the thing; for the man\r\ntrampled calmly over the child's body and left her screaming on\r\nthe ground. It sounds nothing to hear, but it was hellish to see.\r\nIt wasn't like a man; it was like some damned Juggernaut. I gave a\r\nview-halloa, took to my heels, collared my gentleman, and brought\r\nhim back to where there was already quite a group about the\r\nscreaming child. He was perfectly cool and made no resistance, but\r\ngave me one look, so ugly that it brought out the sweat on me like\r\nrunning. The people who had turned out were the girl's own family;\r\nand pretty soon, the doctor, for whom she had been sent, put in his\r\nappearance. Well, the child was not much the worse, more frightened,\r\naccording to the Sawbones; and there you might have supposed would\r\nbe an end to it. But there was one curious circumstance. I had taken\r\na loathing to my gentleman at first sight. So had the child's\r\nfamily, which was only natural. But the doctor's case was what\r\nstruck me. He was the usual cut-and-dry apothecary, of no particular\r\nage and colour, with a strong Edinburgh accent, and about as\r\nemotional as a bagpipe. Well, sir, he was like the rest of us; every\r\ntime he looked at my prisoner, I saw that Sawbones turn sick and\r\nwhite with the desire to kill him. I knew what was in his mind, just\r\nas he knew what was in mine; and killing being out of the question,\r\nwe did the next best. We told the man we could\r\n\r\n6)\r\n\r\nand would make such a scandal out of this, as should make his name\r\nstink from one end of London to the other. If he had any friends or\r\nany credit, we undertook that he should lose them. And all the time,\r\nas we were pitching it in red hot, we were keeping the women off him\r\nas best we could, for they were as wild as harpies. I never saw a\r\ncircle of such hateful faces; and there was the man in the middle,\r\nwith a kind of black, sneering coolness--frightened too, I could\r\nsee that--but carrying it off, sir, really like Satan. 'If you\r\nchoose to make capital out of this accident,' said he, 'I am\r\nnaturally helpless. No gentleman but wishes to avoid a scene,' says\r\nhe. 'Name your figure.' Well, we screwed him up to a hundred pounds\r\nfor the child's family; he would have clearly liked to stick out;\r\nbut there was something about the lot of us that meant mischief, and\r\nat last he struck. The next thing was to get the money; and where\r\ndo you think he carried us but to that place with the door?--\r\nwhipped out a key, went in, and presently came back with the matter\r\nof ten pounds in gold and a cheque for the balance on Coutts's,\r\ndrawn payable to bearer and signed with a name that I can't mention,\r\nthough it's one of the points of my story, but it was a name at\r\nleast very well known and often printed. The figure was stiff; but\r\nthe signature was good for more than that, if it was only genuine. I\r\ntook the liberty of pointing out to my gentleman that the whole\r\n\r\n7)\r\n\r\nbusiness looked apocryphal, and that a man does not, in real life,\r\nwalk into a cellar door at four in the morning and come out of it\r\nwith another man's cheque for close upon a hundred pounds. But he\r\nwas quite easy and sneering. 'Set your mind at rest,' says he, 'I\r\nwill stay with you till the banks open and cash the cheque myself.'\r\nSo we all set off, the doctor, and the child's father, and our\r\nfriend and myself, and passed the rest of the night in my chambers;\r\nand next day, when we had breakfasted, went in a body to the bank. I\r\ngave in the check myself, and said I had every reason to believe it\r\nwas a forgery. Not a bit of it. The cheque was genuine.\"\r\n\r\n\"Tut-tut,\" said Mr. Utterson.\r\n\r\n\"I see you feel as I do,\" said Mr. Enfield. \"Yes, it's a bad story.\r\nFor my man was a fellow that nobody could have to do with, a really\r\ndamnable man; and the person that drew the cheque is the very pink\r\nof the proprieties, celebrated too, and (what makes it worse) one of\r\nyour fellows who do what they call good. Black-mail, I suppose; an\r\nhonest man paying through the nose for some of the capers of his\r\nyouth. Black-Mail House is what I call that place with the door, in\r\nconsequence. Though even that, you know, is far from explaining\r\nall,\" he added, and with the words fell into a vein of musing.\r\n\r\nFrom this he was recalled by Mr. Utterson asking rather suddenly:\r\n\"And you don't know if the drawer of the cheque lives there?\"\r\n\r\n8)\r\n\r\n\"A likely place, isn't it?\" returned Mr. Enfield. \"But I happen to\r\nhave noticed his address; he lives in some square or other.\"\r\n\r\n\"And you never asked about the--place with the door?\" said Mr.\r\nUtterson.\r\n\r\n\"No, sir: I had a delicacy,\" was the reply. \"I feel very strongly\r\nabout putting questions; it partakes too much of the style of the\r\nday of judgment. You start a question, and it's like starting a\r\nstone. You sit quietly on the top of a hill; and away the stone\r\ngoes, starting others; and presently some bland old bird (the last\r\nyou would have thought of) is knocked on the head in his own\r\nback-garden and the family have to change their name. No, sir, I\r\nmake it a rule of mine: the more it looks like Queer Street, the\r\nless I ask.\"\r\n\r\n\"A very good rule, too,\" said the lawyer.\r\n\r\n\"But I have studied the place for myself,\" continued Mr. Enfield.\r\n\"It seems scarcely a house. There is no other door, and nobody goes\r\nin or out of that one but, once in a great while, the gentleman of\r\nmy adventure. There are three windows looking on the court on the\r\nfirst floor; none below; the windows are always shut but they're\r\nclean. And then there is a chimney which is generally smoking; so\r\nsomebody must live there. And yet it's not so sure; for the\r\nbuildings are so packed together about that court, that it's hard to\r\nsay where one ends and another begins.\"\r\n\r\n9)\r\n\r\nThe pair walked on again for a while in silence; and then,\r\n\"Enfield,\" said Mr. Utterson, \"that's a good rule of yours.\"\r\n\r\n\"Yes, I think it is,\" returned Enfield.\r\n\r\n\"But for all that,\" continued the lawyer, \"there's one point I want\r\nto ask: I want to ask the name of that man who walked over the\r\nchild.\"\r\n\r\n\"Well,\" said Mr. Enfield, \"I can't see what harm it would do. It\r\nwas a man of the name of Hyde.\"\r\n\r\n\"H'm,\" said Mr. Utterson. \"What sort of a man is he to see?\"\r\n\r\n\"He is not easy to describe. There is something wrong with his\r\nappearance; something displeasing, something downright detestable. I\r\nnever saw a man I so disliked, and yet I scarce know why. He must be\r\ndeformed somewhere; he gives a strong feeling of deformity, although\r\nI couldn't specify the point. He's an extraordinary-looking man, and\r\nyet I really can name nothing out of the way. No, sir; I can make no\r\nhand of it; I can't describe him. And it's not want of memory; for I\r\ndeclare I can see him this moment.\"\r\n\r\nMr. Utterson again walked some way in silence and obviously under a\r\nweight of consideration.\r\n\r\n\"You are sure he used a key?\" he inquired at last.\r\n\r\n\"My dear sir...\" began Enfield, surprised out of himself.\r\n\r\n10)\r\n\r\n\"Yes, I know,\" said Utterson; \"I know it must seem strange. The\r\nfact is, if I do not ask you the name of the other party, it is\r\nbecause I know it already. You see, Richard, your tale has gone\r\nhome. If you have been inexact in any point, you had better correct\r\nit.\"\r\n\r\n\"I think you might have warned me,\" returned the other, with a\r\ntouch of sullenness. \"But I have been pedantically exact, as you\r\ncall it. The fellow had a key; and what's more, he has it still. I\r\nsaw him use it, not a week ago.\"\r\n\r\nMr. Utterson sighed deeply but said never a word; and the young man\r\npresently resumed. \"Here is another lesson to say nothing,\" said he.\r\n\"I am ashamed of my long tongue. Let us make a bargain never to\r\nrefer to this again.\"\r\n\r\n\"With all my heart,\" said the lawyer. \"I shake hands on that,\r\nRichard.\"\r\n\r\n11)\r\n\r\n\r\n                        SEARCH FOR MR. HYDE\r\n\r\nTHAT evening Mr. Utterson came home to his bachelor house in sombre\r\nspirits and sat down to dinner without relish. It was his custom of\r\na Sunday, when this meal was over, to sit close by the fire, a\r\nvolume of some dry divinity on his reading-desk, until the clock of\r\nthe neighbouring church rang out the hour of twelve, when he would\r\ngo soberly and gratefully to bed. On this night, however, as soon as\r\nthe cloth was taken away, he took up a candle and went into his\r\nbusiness-room. There he opened his safe, took from the most private\r\npart of it a document endorsed on the envelope as Dr. Jekyll's Will,\r\nand sat down with a clouded brow to study its contents. The will was\r\nholograph, for Mr. Utterson, though he took charge of it now that it\r\nwas made, had refused to lend the least assistance in the making of\r\nit; it provided not only that, in case of the decease of Henry\r\nJekyll, M.D., D.C.L., L.L.D., F.R.S., etc., all his possessions were\r\nto pass into the hands of his \"friend and benefactor Edward Hyde,\"\r\nbut that in case of\r\n\r\n12)\r\n\r\nDr. Jekyll's \"disappearance or unexplained absence for any period\r\nexceeding three calendar months,\" the said Edward Hyde should step\r\ninto the said Henry Jekyll's shoes without further delay and free\r\nfrom any burthen or obligation, beyond the payment of a few small\r\nsums to the members of the doctor's household. This document had\r\nlong been the lawyer's eyesore. It offended him both as a lawyer and\r\nas a lover of the sane and customary sides of life, to whom the\r\nfanciful was the immodest. And hitherto it was his ignorance of Mr.\r\nHyde that had swelled his indignation; now, by a sudden turn, it was\r\nhis knowledge. It was already bad enough when the name was but a\r\nname of which he could learn no more. It was worse when it began to\r\nbe clothed upon with detestable attributes; and out of the shifting,\r\ninsubstantial mists that had so long baffled his eye, there leaped\r\nup the sudden, definite presentment of a fiend.\r\n\r\n\"I thought it was madness,\" he said, as he replaced the obnoxious\r\npaper in the safe, \"and now I begin to fear it is disgrace.\"\r\n\r\nWith that he blew out his candle, put on a great-coat, and set\r\nforth in the direction of Cavendish Square, that citadel of\r\nmedicine, where his friend, the great Dr. Lanyon, had his house and\r\nreceived his crowding patients. \"If any one knows, it will be\r\nLanyon,\" he had thought.\r\n\r\nThe solemn butler knew and welcomed him;\r\n\r\n13)\r\n\r\nhe was subjected to no stage of delay, but ushered direct from the\r\ndoor to the dining-room where Dr. Lanyon sat alone over his wine.\r\nThis was a hearty, healthy, dapper, red-faced gentleman, with a\r\nshock of hair prematurely white, and a boisterous and decided\r\nmanner. At sight of Mr. Utterson, he sprang up from his chair and\r\nwelcomed him with both hands. The geniality, as was the way of the\r\nman, was somewhat theatrical to the eye; but it reposed on genuine\r\nfeeling. For these two were old friends, old mates both at school\r\nand college, both thorough respecters of themselves and of each\r\nother, and, what does not always follow, men who thoroughly enjoyed\r\neach other's company.\r\n\r\nAfter a little rambling talk, the lawyer led up to the subject\r\nwhich so disagreeably pre-occupied his mind.\r\n\r\n\"I suppose, Lanyon,\" said he \"you and I must be the two oldest\r\nfriends that Henry Jekyll has?\"\r\n\r\n\"I wish the friends were younger,\" chuckled Dr. Lanyon. \"But I\r\nsuppose we are. And what of that? I see little of him now.\"\r\n\r\n\r\n\"Indeed?\" said Utterson. \"I thought you had a bond of common\r\ninterest.\"\r\n\r\n\"We had,\" was the reply. \"But it is more than ten years since Henry\r\nJekyll became too fanciful for me. He began to go wrong, wrong in\r\nmind; and though of course I continue to take an interest in him for\r\nold sake's sake, as they say,\r\n\r\n14)\r\n\r\nI see and I have seen devilish little of the man. Such unscientific\r\nbalderdash,\" added the doctor, flushing suddenly purple, \"would have\r\nestranged Damon and Pythias.\"\r\n\r\nThis little spirit of temper was somewhat of a relief to Mr.\r\nUtterson. \"They have only differed on some point of science,\" he\r\nthought; and being a man of no scientific passions (except in the\r\nmatter of conveyancing), he even added: \"It is nothing worse than\r\nthat!\" He gave his friend a few seconds to recover his composure,\r\nand then approached the question he had come to put. \"Did you ever\r\ncome across a protege of his--one Hyde?\" he asked.\r\n\r\n\"Hyde?\" repeated Lanyon. \"No. Never heard of him. Since my time.\"\r\n\r\nThat was the amount of information that the lawyer carried back\r\nwith him to the great, dark bed on which he tossed to and fro,\r\nuntil the small hours of the morning began to grow large. It was a\r\nnight of little ease to his toiling mind, toiling in mere darkness\r\nand besieged by questions.\r\n\r\nSix o'clock struck on the bells of the church that was so\r\nconveniently near to Mr. Utterson's dwelling, and still he was\r\ndigging at the problem. Hitherto it had touched him on the\r\nintellectual side alone; but now his imagination also was engaged,\r\nor rather enslaved; and as he lay and tossed in the gross darkness\r\nof the night and the curtained room, Mr. Enfield's tale went by\r\n\r\n15)\r\n\r\nbefore his mind in a scroll of lighted pictures. He would be aware\r\nof the great field of lamps of a nocturnal city; then of the figure\r\nof a man walking swiftly; then of a child running from the doctor's;\r\nand then these met, and that human Juggernaut trod the child down\r\nand passed on regardless of her screams. Or else he would see a room\r\nin a rich house, where his friend lay asleep, dreaming and smiling\r\nat his dreams; and then the door of that room would be opened, the\r\ncurtains of the bed plucked apart, the sleeper recalled, and lo!\r\nthere would stand by his side a figure to whom power was given, and\r\neven at that dead hour, he must rise and do its bidding. The figure\r\nin these two phases haunted the lawyer all night; and if at any time\r\nhe dozed over, it was but to see it glide more stealthily through\r\nsleeping houses, or move the more swiftly and still the more\r\nswiftly, even to dizziness, through wider labyrinths of lamplighted\r\ncity, and at every street-corner crush a child and leave her\r\nscreaming. And still the figure had no face by which he might know\r\nit; even in his dreams, it had no face, or one that baffled him and\r\nmelted before his eyes; and thus it was that there sprang up and\r\ngrew apace in the lawyer's mind a singularly strong, almost an\r\ninordinate, curiosity to behold the features of the real Mr. Hyde.\r\nIf he could but once set eyes on him, he thought the mystery would\r\nlighten and perhaps roll altogether away, as was the habit of\r\nmysterious\r\n\r\n16)\r\n\r\nthings when well examined. He might see a reason for his friend's\r\nstrange preference or bondage (call it which you please) and even\r\nfor the startling clause of the will. At least it would be a face\r\nworth seeing: the face of a man who was without bowels of mercy: a\r\nface which had but to show itself to raise up, in the mind of the\r\nunimpressionable Enfield, a spirit of enduring hatred.\r\n\r\nFrom that time forward, Mr. Utterson began to haunt the door in the\r\nby-street of shops. In the morning before office hours, at noon when\r\nbusiness was plenty, and time scarce, at night under the face of the\r\nfogged city moon, by all lights and at all hours of solitude or\r\nconcourse, the lawyer was to be found on his chosen post.\r\n\r\n\"If he be Mr. Hyde,\" he had thought, \"I shall be Mr. Seek.\"\r\n\r\nAnd at last his patience was rewarded. It was a fine dry night;\r\nfrost in the air; the streets as clean as a ballroom floor; the\r\nlamps, unshaken, by any wind, drawing a regular pattern of light\r\nand shadow. By ten o'clock, when the shops were closed, the\r\nby-street was very solitary and, in spite of the low growl of\r\nLondon from all round, very silent. Small sounds carried far;\r\ndomestic sounds out of the houses were clearly audible on either\r\nside of the roadway; and the rumour of the approach of any\r\npassenger preceded him by a long time. Mr. Utterson had been some\r\nminutes at his post, when he was\r\n\r\n17)\r\n\r\naware of an odd, light footstep drawing near. In the course of his\r\nnightly patrols, he had long grown accustomed to the quaint effect\r\nwith which the footfalls of a single person, while he is still a\r\ngreat way off, suddenly spring out distinct from the vast hum and\r\nclatter of the city. Yet his attention had never before been so\r\nsharply and decisively arrested; and it was with a strong,\r\nsuperstitious prevision of success that he withdrew into the entry\r\nof the court.\r\n\r\nThe steps drew swiftly nearer, and swelled out suddenly louder as\r\nthey turned the end of the street. The lawyer, looking forth from\r\nthe entry, could soon see what manner of man he had to deal with.\r\nHe was small and very plainly dressed, and the look of him, even at\r\nthat distance, went somehow strongly against the watcher's\r\ninclination. But he made straight for the door, crossing the\r\nroadway to save time; and as he came, he drew a key from his pocket\r\nlike one approaching home.\r\n\r\nMr. Utterson stepped out and touched him on the shoulder as he\r\npassed. \"Mr. Hyde, I think?\"\r\n\r\nMr. Hyde shrank back with a hissing intake of the breath. But his\r\nfear was only momentary; and though he did not look the lawyer in\r\nthe face, he answered coolly enough: \"That is my name. What do you\r\nwant?\"\r\n\r\n\"I see you are going in,\" returned the lawyer. \"I am an old friend\r\nof Dr. Jekyll's--Mr. Utter-\r\n\r\n18)\r\n\r\nson of Gaunt Street--you must have heard my name; and meeting you\r\nso conveniently, I thought you might admit me.\"\r\n\r\n\"You will not find Dr. Jekyll; he is from home,\" replied Mr. Hyde,\r\nblowing in the key. And then suddenly, but still without looking up,\r\n\"How did you know me?\" he asked.\r\n\r\n\"On your side,\" said Mr. Utterson, \"will you do me a favour?\"\r\n\r\n\"With pleasure,\" replied the other. \"What shall it be?\"\r\n\r\n\"Will you let me see your face?\" asked the lawyer.\r\n\r\nMr. Hyde appeared to hesitate, and then, as if upon some sudden\r\nreflection, fronted about with an air of defiance; and the pair\r\nstared at each other pretty fixedly for a few seconds. \"Now I shall\r\nknow you again,\" said Mr. Utterson. \"It may be useful.\"\r\n\r\n\"Yes,\" returned Mr. Hyde, \"it is as well we have, met; and a\r\npropos, you should have my address.\" And he gave a number of a\r\nstreet in Soho.\r\n\r\n\"Good God!\" thought Mr. Utterson, \"can he, too, have been thinking\r\nof the will?\" But he kept his feelings to himself and only grunted\r\nin acknowledgment of the address.\r\n\r\n\"And now,\" said the other, \"how did you know me?\"\r\n\r\n\"By description,\" was the reply.\r\n\r\n\"Whose description?\"\r\n\r\n19)\r\n\r\n\"We have common friends,\" said Mr. Utterson.\r\n\r\n\"Common friends?\" echoed Mr. Hyde, a little hoarsely. \"Who are\r\nthey?\"\r\n\r\n\"Jekyll, for instance,\" said the lawyer.\r\n\r\n\"He never told you,\" cried Mr. Hyde, with a flush of anger. \"I did\r\nnot think you would have lied.\"\r\n\r\n\"Come,\" said Mr. Utterson, \"that is not fitting language.\"\r\n\r\n\r\nThe other snarled aloud into a savage laugh; and the next moment,\r\nwith extraordinary quickness, he had unlocked the door and\r\ndisappeared into the house.\r\n\r\nThe lawyer stood awhile when Mr. Hyde had left him, the picture of\r\ndisquietude. Then he began slowly to mount the street, pausing\r\nevery step or two and putting his hand to his brow like a man in\r\nmental perplexity. The problem he was thus debating as he walked,\r\nwas one of a class that is rarely solved. Mr. Hyde was pale and\r\ndwarfish, he gave an impression of deformity without any nameable\r\nmalformation, he had a displeasing smile, he had borne himself to\r\nthe lawyer with a sort of murderous mixture of timidity and\r\nboldness, and he spoke with a husky, whispering and somewhat broken\r\nvoice; all these were points against him, but not all of these\r\ntogether could explain the hitherto unknown disgust, loathing, and\r\nfear with which Mr. Utterson regarded him. \"There must be some-\r\n\r\n20)\r\n\r\nthing else,\" said the perplexed gentleman. \"There is something\r\nmore, if I could find a name for it. God bless me, the man seems\r\nhardly human! Something troglodytic, shall we say? or can it be the\r\nold story of Dr. Fell? or is it the mere radiance of a foul soul\r\nthat thus transpires through, and transfigures, its clay continent?\r\nThe last, I think; for, O my poor old Harry Jekyll, if ever I read\r\nSatan's signature upon a face, it is on that of your new friend.\"\r\n\r\nRound the corner from the by-street, there was a square of ancient,\r\nhandsome houses, now for the most part decayed from their high\r\nestate and let in flats and chambers to all sorts and conditions of\r\nmen: map-engravers, architects, shady lawyers, and the agents of\r\nobscure enterprises. One house, however, second from the corner, was\r\nstill occupied entire; and at the door of this, which wore a great\r\nair of wealth and comfort, though it was now plunged in darkness\r\nexcept for the fan-light, Mr. Utterson stopped and knocked. A\r\nwell-dressed, elderly servant opened the door.\r\n\r\n\"Is Dr. Jekyll at home, Poole?\" asked the lawyer.\r\n\r\n\"I will see, Mr. Utterson,\" said Poole, admitting the visitor, as\r\nhe spoke, into a large, low-roofed, comfortable hall, paved with\r\nflags, warmed (after the fashion of a country house) by a bright,\r\nopen fire, and furnished with costly cabinets of oak. \"Will you\r\nwait here by the\r\n\r\n21)\r\n\r\nfire, sir? or shall I give you a light in the dining room?\"\r\n\r\n\"Here, thank you,\" said the lawyer, and he drew near and leaned on\r\nthe tall fender. This hall, in which he was now left alone, was a\r\npet fancy of his friend the doctor's; and Utterson himself was wont\r\nto speak of it as the pleasantest room in London. But to-night there\r\nwas a shudder in his blood; the face of Hyde sat heavy on his\r\nmemory; he felt (what was rare with him) a nausea and distaste of\r\nlife; and in the gloom of his spirits, he seemed to read a menace in\r\nthe flickering of the firelight on the polished cabinets and the\r\nuneasy starting of the shadow on the roof. He was ashamed of his\r\nrelief, when Poole presently returned to announce that Dr. Jekyll\r\nwas gone out.\r\n\r\n\"I saw Mr. Hyde go in by the old dissecting-room door, Poole,\" he\r\nsaid. \"Is that right, when Dr. Jekyll is from home?\"\r\n\r\n\"Quite right, Mr. Utterson, sir,\" replied the servant. \"Mr. Hyde\r\nhas a key.\"\r\n\r\n\"Your master seems to repose a great deal of trust in that young\r\nman, Poole,\" resumed the other musingly.\r\n\r\n\"Yes, sir, he do indeed,\" said Poole. \"We have all orders to obey\r\nhim.\"\r\n\r\n\"I do not think I ever met Mr. Hyde?\" asked Utterson.\r\n\r\n\r\n\"O, dear no, sir. He never dines here,\" replied the butler. \"Indeed\r\nwe see very little of\r\n\r\n22)\r\n\r\nhim on this side of the house; he mostly comes and goes by the\r\nlaboratory.\"\r\n\r\n\"Well, good-night, Poole.\"\r\n\r\n\"Good-night, Mr. Utterson.\" And the lawyer set out homeward with a\r\nvery heavy heart. \"Poor Harry Jekyll,\" he thought, \"my mind\r\nmisgives me he is in deep waters! He was wild when he was young; a\r\nlong while ago to be sure; but in the law of God, there is no\r\nstatute of limitations. Ay, it must be that; the ghost of some old\r\nsin, the cancer of some concealed disgrace: punishment coming, PEDE\r\nCLAUDO, years after memory has forgotten and self-love condoned the\r\nfault.\" And the lawyer, scared by the thought, brooded a while on\r\nhis own past, groping in all the corners of memory, lest by chance\r\nsome Jack-in-the-Box of an old iniquity should leap to light there.\r\nHis past was fairly blameless; few men could read the rolls of their\r\nlife with less apprehension; yet he was humbled to the dust by the\r\nmany ill things he had done, and raised up again into a sober and\r\nfearful gratitude by the many that he had come so near to doing, yet\r\navoided. And then by a return on his former subject, he conceived a\r\nspark of hope. \"This Master Hyde, if he were studied,\" thought he,\r\n\"must have secrets of his own; black secrets, by the look of him;\r\nsecrets compared to which poor Jekyll's worst would be like\r\nsunshine. Things cannot continue as they are. It turns me cold to\r\nthink of this creature stealing like a\r\n\r\n23)\r\n\r\nthief to Harry's bedside; poor Harry, what a wakening! And the\r\ndanger of it; for if this Hyde suspects the existence of the will,\r\nhe may grow impatient to inherit. Ay, I must put my shoulder to the\r\nwheel if Jekyll will but let me,\" he added, \"if Jekyll will only let\r\nme.\" For once more he saw before his mind's eye, as clear as a\r\ntransparency, the strange clauses of the will.\r\n\r\n24)\r\n\r\n\r\n\r\n                      DR. JEKYLL WAS QUITE AT EASE\r\n\r\nA FORTNIGHT later, by excellent good fortune, the doctor gave one\r\nof his pleasant dinners to some five or six old cronies, all\r\nintelligent, reputable men and all judges of good wine; and Mr.\r\nUtterson so contrived that he remained behind after the others had\r\ndeparted. This was no new arrangement, but a thing that had\r\nbefallen many scores of times. Where Utterson was liked, he was\r\nliked well. Hosts loved to detain the dry lawyer, when the\r\nlight-hearted and the loose-tongued had already their foot on the\r\nthreshold; they liked to sit a while in his unobtrusive company,\r\npractising for solitude, sobering their minds in the man's rich\r\nsilence after the expense and strain of gaiety. To this rule, Dr.\r\nJekyll was no exception; and as he now sat on the opposite side of\r\nthe fire--a large, well-made, smooth-faced man of fifty, with\r\nsomething of a slyish cast perhaps, but every mark of capacity and\r\nkindness--you could see by his looks that he cherished for Mr.\r\nUtterson a sincere and warm affection.\r\n\r\n25)\r\n\r\n\r\n\"I have been wanting to speak to you, Jekyll,\" began the latter.\r\n\"You know that will of yours?\"\r\n\r\nA close observer might have gathered that the topic was\r\ndistasteful; but the doctor carried it off gaily. \"My poor\r\nUtterson,\" said he, \"you are unfortunate in such a client. I never\r\nsaw a man so distressed as you were by my will; unless it were that\r\nhide-bound pedant, Lanyon, at what he called my scientific heresies.\r\nOh, I know he's a good fellow--you needn't frown--an excellent\r\nfellow, and I always mean to see more of him; but a hide-bound\r\npedant for all that; an ignorant, blatant pedant. I was never more\r\ndisappointed in any man than Lanyon.\"\r\n\r\n\"You know I never approved of it,\" pursued Utterson, ruthlessly\r\ndisregarding the fresh topic.\r\n\r\n\"My will? Yes, certainly, I know that,\" said the doctor, a trifle\r\nsharply. \"You have told me so.\"\r\n\r\n\"Well, I tell you so again,\" continued the lawyer. \"I have been\r\nlearning something of young Hyde.\"\r\n\r\nThe large handsome face of Dr. Jekyll grew pale to the very lips,\r\nand there came a blackness about his eyes. \"I do not care to hear\r\nmore,\" said he. \"This is a matter I thought we had agreed to drop.\"\r\n\r\n\"What I heard was abominable,\" said Utterson.\r\n\r\n\"It can make no change. You do not under-\r\n\r\n26)\r\n\r\nstand my position,\" returned the doctor, with a certain incoherency\r\nof manner. \"I am painfully situated, Utterson; my position is a very\r\nstrange--a very strange one. It is one of those affairs that\r\ncannot be mended by talking.\"\r\n\r\n\"Jekyll,\" said Utterson, \"you know me: I am a man to be trusted.\r\nMake a clean breast of this in confidence; and I make no doubt I\r\ncan get you out of it.\"\r\n\r\n\"My good Utterson,\" said the doctor, \"this is very good of you,\r\nthis is downright good of you, and I cannot find words to thank you\r\nin. I believe you fully; I would trust you before any man alive, ay,\r\nbefore myself, if I could make the choice; but indeed it isn't what\r\nyou fancy; it is not so bad as that; and just to put your good heart\r\nat rest, I will tell you one thing: the moment I choose, I can be\r\nrid of Mr. Hyde. I give you my hand upon that; and I thank you again\r\nand again; and I will just add one little word, Utterson, that I'm\r\nsure you'll take in good part: this is a private matter, and I beg\r\nof you to let it sleep.\"\r\n\r\n\r\nUtterson reflected a little, looking in the fire.\r\n\r\n\"I have no doubt you are perfectly right,\" he said at last, getting\r\nto his feet.\r\n\r\n\"Well, but since we have touched upon this business, and for the\r\nlast time I hope,\" continued the doctor, \"there is one point I\r\nshould like you to understand. I have really a very great interest\r\nin poor Hyde. I know you have seen\r\n\r\n27)\r\n\r\nhim; he told me so; and I fear he was rude. But, I do sincerely\r\ntake a great, a very great interest in that young man; and if I am\r\ntaken away, Utterson, I wish you to promise me that you will bear\r\nwith him and get his rights for him. I think you would, if you knew\r\nall; and it would be a weight off my mind if you would promise.\"\r\n\r\n\"I can't pretend that I shall ever like him,\" said the lawyer.\r\n\r\n\"I don't ask that,\" pleaded Jekyll, laying his hand upon the\r\nother's arm; \"I only ask for justice; I only ask you to help him\r\nfor my sake, when I am no longer here.\"\r\n\r\nUtterson heaved an irrepressible sigh. \"Well,\" said he, \"I\r\npromise.\"\r\n\r\n28)\r\n\r\n\r\n\r\n                      THE CAREW MURDER CASE\r\n\r\nNEARLY a year later, in the month of October, 18---, London was\r\nstartled by a crime of singular ferocity and rendered all the more\r\nnotable by the high position of the victim. The details were few and\r\nstartling. A maid servant living alone in a house not far from the\r\nriver, had gone up-stairs to bed about eleven. Although a fog rolled\r\nover the city in the small hours, the early part of the night was\r\ncloudless, and the lane, which the maid's window overlooked, was\r\nbrilliantly lit by the full moon. It seems she was romantically\r\ngiven, for she sat down upon her box, which stood immediately under\r\nthe window, and fell into a dream of musing. Never (she used to say,\r\nwith streaming tears, when she narrated that experience), never had\r\nshe felt more at peace with all men or thought more kindly of the\r\nworld. And as she so sat she became aware of an aged and beautiful\r\ngentleman with white hair, drawing near along the lane; and\r\nadvancing to meet him, another and very small gentleman, to whom at\r\nfirst she\r\n\r\n29)\r\n\r\npaid less attention. When they had come within speech (which was\r\njust under the maid's eyes) the older man bowed and accosted the\r\nother with a very pretty manner of politeness. It did not seem as\r\nif the subject of his address were of great importance; indeed,\r\nfrom his pointing, it sometimes appeared as if he were only\r\ninquiring his way; but the moon shone on his face as he spoke, and\r\nthe girl was pleased to watch it, it seemed to breathe such an\r\ninnocent and old-world kindness of disposition, yet with something\r\nhigh too, as of a well-founded self-content. Presently her eye\r\nwandered to the other, and she was surprised to recognise in him a\r\ncertain Mr. Hyde, who had once visited her master and for whom she\r\nhad conceived a dislike. He had in his hand a heavy cane, with which\r\nhe was trifling; but he answered never a word, and seemed to listen\r\nwith an ill-contained impatience. And then all of a sudden he broke\r\nout in a great flame of anger, stamping with his foot, brandishing\r\nthe cane, and carrying on (as the maid described it) like a madman.\r\nThe old gentleman took a step back, with the air of one very much\r\nsurprised and a trifle hurt; and at that Mr. Hyde broke out of all\r\nbounds and clubbed him to the earth. And next moment, with ape-like\r\nfury, he was trampling his victim under foot and hailing down a\r\nstorm of blows, under which the bones were audibly shattered and the\r\nbody jumped upon the roadway. At the horror of these sights and\r\nsounds, the maid fainted.\r\n\r\n30)\r\n\r\nIt was two o'clock when she came to herself and called for the\r\npolice. The murderer was gone long ago; but there lay his victim in\r\nthe middle of the lane, incredibly mangled. The stick with which the\r\ndeed had been done, although it was of some rare and very tough and\r\nheavy wood, had broken in the middle under the stress of this\r\ninsensate cruelty; and one splintered half had rolled in the\r\nneighbouring gutter--the other, without doubt, had been carried\r\naway by the murderer. A purse and a gold watch were found upon the\r\nvictim: but no cards or papers, except a sealed and stamped\r\nenvelope, which he had been probably carrying to the post, and which\r\nbore the name and address of Mr. Utterson.\r\n\r\nThis was brought to the lawyer the next morning, before he was out\r\nof bed; and he had no sooner seen it, and been told the\r\ncircumstances, than he shot out a solemn lip. \"I shall say nothing\r\ntill I have seen the body,\" said he; \"this may be very serious. Have\r\nthe kindness to wait while I dress.\" And with the same grave\r\ncountenance he hurried through his breakfast and drove to the police\r\nstation, whither the body had been carried. As soon as he came into\r\nthe cell, he nodded.\r\n\r\n\"Yes,\" said he, \"I recognise him. I am sorry to say that this is\r\nSir Danvers Carew.\"\r\n\r\n\"Good God, sir,\" exclaimed the officer, \"is it possible?\" And the\r\nnext moment his eye\r\n\r\n31)\r\n\r\nlighted up with professional ambition. \"This will make a deal of\r\nnoise,\" he said. \"And perhaps you can help us to the man.\" And he\r\nbriefly narrated what the maid had seen, and showed the broken\r\nstick.\r\n\r\nMr. Utterson had already quailed at the name of Hyde; but when the\r\nstick was laid before him, he could doubt no longer; broken and\r\nbattered as it was, he recognised it for one that he had himself\r\npresented many years before to Henry Jekyll.\r\n\r\n\"Is this Mr. Hyde a person of small stature?\" he inquired.\r\n\r\n\"Particularly small and particularly wicked-looking, is what the\r\nmaid calls him,\" said the officer.\r\n\r\nMr. Utterson reflected; and then, raising his head, \"If you will\r\ncome with me in my cab,\" he said, \"I think I can take you to his\r\nhouse.\"\r\n\r\nIt was by this time about nine in the morning, and the first fog of\r\nthe season. A great chocolate-coloured pall lowered over heaven, but\r\nthe wind was continually charging and routing these embattled\r\nvapours; so that as the cab crawled from street to street, Mr.\r\nUtterson beheld a marvellous number of degrees and hues of twilight;\r\nfor here it would be dark like the back-end of evening; and there\r\nwould be a glow of a rich, lurid brown, like the light of some\r\nstrange conflagration; and here, for a moment, the fog would be\r\nquite broken up, and a haggard shaft\r\n\r\n32)\r\n\r\nof daylight would glance in between the swirling wreaths. The\r\ndismal quarter of Soho seen under these changing glimpses, with its\r\nmuddy ways, and slatternly passengers, and its lamps, which had\r\nnever been extinguished or had been kindled afresh to combat this\r\nmournful re-invasion of darkness, seemed, in the lawyer's eyes, like\r\na district of some city in a nightmare. The thoughts of his mind,\r\nbesides, were of the gloomiest dye; and when he glanced at the\r\ncompanion of his drive, he was conscious of some touch of that\r\nterror of the law and the law's officers, which may at times assail\r\nthe most honest.\r\n\r\nAs the cab drew up before the address indicated, the fog lifted a\r\nlittle and showed him a dingy street, a gin palace, a low French\r\neating-house, a shop for the retail of penny numbers and twopenny\r\nsalads, many ragged children huddled in the doorways, and many\r\nwomen of different nationalities passing out, key in hand, to have a\r\nmorning glass; and the next moment the fog settled down again upon\r\nthat part, as brown as umber, and cut him off from his blackguardly\r\nsurroundings. This was the home of Henry Jekyll's favourite; of a\r\nman who was heir to a quarter of a million sterling.\r\n\r\nAn ivory-faced and silvery-haired old woman opened the door. She\r\nhad an evil face, smoothed by hypocrisy; but her manners were\r\nexcellent. Yes, she said, this was Mr. Hyde's, but he was not at\r\nhome; he had been in that night very late,\r\n\r\n33)\r\n\r\nbut had gone away again in less than an hour; there was nothing\r\nstrange in that; his habits were very irregular, and he was often\r\nabsent; for instance, it was nearly two months since she had seen\r\nhim till yesterday.\r\n\r\n\"Very well, then, we wish to see his rooms,\" said the lawyer; and\r\nwhen the woman began to declare it was impossible, \"I had better\r\ntell you who this person is,\" he added. \"This is Inspector Newcomen\r\nof Scotland Yard.\"\r\n\r\nA flash of odious joy appeared upon the woman's face. \"Ah!\" said\r\nshe, \"he is in trouble! What has he done?\"\r\n\r\nMr. Utterson and the inspector exchanged glances. \"He don't seem a\r\nvery popular character,\" observed the latter. \"And now, my good\r\nwoman, just let me and this gentleman have a look about us.\"\r\n\r\nIn the whole extent of the house, which but for the old woman\r\nremained otherwise empty, Mr. Hyde had only used a couple of rooms;\r\nbut these were furnished with luxury and good taste. A closet was\r\nfilled with wine; the plate was of silver, the napery elegant; a\r\ngood picture hung upon the walls, a gift (as Utterson supposed) from\r\nHenry Jekyll, who was much of a connoisseur; and the carpets were of\r\nmany plies and agreeable in colour. At this moment, however, the\r\nrooms bore every mark of having been recently and hurriedly\r\nransacked; clothes lay about the floor, with their pockets inside\r\nout;\r\n\r\n34)\r\n\r\nlock-fast drawers stood open; and on the hearth there lay a pile of\r\ngrey ashes, as though many papers had been burned. From these\r\nembers the inspector disinterred the butt-end of a green\r\ncheque-book, which had resisted the action of the fire; the other\r\nhalf of the stick was found behind the door; and as this clinched\r\nhis suspicions, the officer declared himself delighted. A visit to\r\nthe bank, where several thousand pounds were found to be lying to\r\nthe murderer's credit, completed his gratification.\r\n\r\n\"You may depend upon it, sir,\" he told Mr. Utterson: \"I have him in\r\nmy hand. He must have lost his head, or he never would have left the\r\nstick or, above all, burned the cheque-book. Why, money's life to\r\nthe man. We have nothing to do but wait for him at the bank, and get\r\nout the handbills.\"\r\n\r\nThis last, however, was not so easy of accomplishment; for Mr. Hyde\r\nhad numbered few familiars--even the master of the servant-maid\r\nhad only seen him twice; his family could nowhere be traced; he had\r\nnever been photographed; and the few who could describe him differed\r\nwidely, as common observers will. Only on one point, were they\r\nagreed; and that was the haunting sense of unexpressed deformity\r\nwith which the fugitive impressed his beholders.\r\n\r\n35)\r\n\r\n\r\n\r\n                     INCIDENT OF THE LETTER\r\n\r\nIT was late in the afternoon, when Mr. Utterson found his way to\r\nDr. Jekyll's door, where he was at once admitted by Poole, and\r\ncarried down by the kitchen offices and across a yard which had\r\nonce been a garden, to the building which was indifferently known\r\nas the laboratory or the dissecting-rooms. The doctor had bought\r\nthe house from the heirs of a celebrated surgeon; and his own\r\ntastes being rather chemical than anatomical, had changed the\r\ndestination of the block at the bottom of the garden. It was the\r\nfirst time that the lawyer had been received in that part of his\r\nfriend's quarters; and he eyed the dingy, windowless structure with\r\ncuriosity, and gazed round with a distasteful sense of strangeness\r\nas he crossed the theatre, once crowded with eager students and now\r\nlying gaunt and silent, the tables laden with chemical apparatus,\r\nthe floor strewn with crates and littered with packing straw, and\r\nthe light falling dimly through the foggy cupola. At the further\r\nend, a flight of stairs mounted to a door covered with red baize;\r\n\r\n36)\r\n\r\nand through this, Mr. Utterson was at last received into the\r\ndoctor's cabinet. It was a large room, fitted round with glass\r\npresses, furnished, among other things, with a cheval-glass and a\r\nbusiness table, and looking out upon the court by three dusty\r\nwindows barred with iron. A fire burned in the grate; a lamp was\r\nset lighted on the chimney shelf, for even in the houses the fog\r\nbegan to lie thickly; and there, close up to the warmth, sat Dr.\r\nJekyll, looking deadly sick. He did not rise to meet his visitor,\r\nbut held out a cold hand and bade him welcome in a changed voice.\r\n\r\n\"And now,\" said Mr. Utterson, as soon as Poole had left them, \"you\r\nhave heard the news?\"\r\n\r\nThe doctor shuddered. \"They were crying it in the square,\" he said.\r\n\"I heard them in my dining-room.\"\r\n\r\n\"One word,\" said the lawyer. \"Carew was my client, but so are you,\r\nand I want to know what I am doing. You have not been mad enough to\r\nhide this fellow?\"\r\n\r\n\"Utterson, I swear to God,\" cried the doctor, \"I swear to God I\r\nwill never set eyes on him again. I bind my honour to you that I am\r\ndone with him in this world. It is all at an end. And indeed he does\r\nnot want my help; you do not know him as I do; he is safe, he is\r\nquite safe; mark my words, he will never more be heard of.\"\r\n\r\n\r\nThe lawyer listened gloomily; he did not like his friend's feverish\r\nmanner. \"You seem pretty\r\n\r\n37)\r\n\r\nsure of him,\" said he; \"and for your sake, I hope you may be right.\r\nIf it came to a trial, your name might appear.\"\r\n\r\n\"I am quite sure of him,\" replied Jekyll; \"I have grounds for\r\ncertainty that I cannot share with any one. But there is one thing\r\non which you may advise me. I have--I have received a letter; and\r\nI am at a loss whether I should show it to the police. I should like\r\nto leave it in your hands, Utterson; you would judge wisely, I am\r\nsure; I have so great a trust in you.\"\r\n\r\n\"You fear, I suppose, that it might lead to his detection?\" asked\r\nthe lawyer.\r\n\r\n\"No,\" said the other. \"I cannot say that I care what becomes of\r\nHyde; I am quite done with him. I was thinking of my own character,\r\nwhich this hateful business has rather exposed.\"\r\n\r\nUtterson ruminated a while; he was surprised at his friend's\r\nselfishness, and yet relieved by it. \"Well,\" said he, at last, \"let\r\nme see the letter.\"\r\n\r\nThe letter was written in an odd, upright hand and signed \"Edward\r\nHyde\": and it signified, briefly enough, that the writer's\r\nbenefactor, Dr. Jekyll, whom he had long so unworthily repaid for a\r\nthousand generosities, need labour under no alarm for his safety, as\r\nhe had means of escape on which he placed a sure dependence. The\r\nlawyer liked this letter well enough; it put a better colour on the\r\nintimacy than he had looked for; and he blamed himself for some of\r\nhis past suspicions.\r\n\r\n38)\r\n\r\n\r\n\"Have you the envelope?\" he asked.\r\n\r\n\"I burned it,\" replied Jekyll, \"before I thought what I was about.\r\nBut it bore no postmark. The note was handed in.\"\r\n\r\n\"Shall I keep this and sleep upon it?\" asked Utterson.\r\n\r\n\"I wish you to judge for me entirely,\" was the reply. \"I have lost\r\nconfidence in myself.\"\r\n\r\n\"Well, I shall consider,\" returned the lawyer. \"And now one word\r\nmore: it was Hyde who dictated the terms in your will about that\r\ndisappearance?\"\r\n\r\nThe doctor seemed seized with a qualm of faintness: he shut his\r\nmouth tight and nodded.\r\n\r\n\"I knew it,\" said Utterson. \"He meant to murder you. You have had a\r\nfine escape.\"\r\n\r\n\"I have had what is far more to the purpose,\" returned the doctor\r\nsolemnly: \"I have had a lesson--O God, Utterson, what a lesson I\r\nhave had!\" And he covered his face for a moment with his hands.\r\n\r\nOn his way out, the lawyer stopped and had a word or two with\r\nPoole. \"By the by,\" said he, \"there was a letter handed in to-day:\r\nwhat was the messenger like?\" But Poole was positive nothing had\r\ncome except by post; \"and only circulars by that,\" he added.\r\n\r\nThis news sent off the visitor with his fears renewed. Plainly the\r\nletter had come by the laboratory door; possibly, indeed, it had\r\nbeen\r\n\r\n39)\r\n\r\nwritten in the cabinet; and if that were so, it must be differently\r\njudged, and handled with the more caution. The newsboys, as he went,\r\nwere crying themselves hoarse along the footways: \"Special edition.\r\nShocking murder of an M. P.\" That was the funeral oration of one\r\nfriend and client; and he could not help a certain apprehension lest\r\nthe good name of another should be sucked down in the eddy of the\r\nscandal. It was, at least, a ticklish decision that he had to make;\r\nand self-reliant as he was by habit, he began to cherish a longing\r\nfor advice. It was not to be had directly; but perhaps, he thought,\r\nit might be fished for.\r\n\r\nPresently after, he sat on one side of his own hearth, with Mr.\r\nGuest, his head clerk, upon the other, and midway between, at a\r\nnicely calculated distance from the fire, a bottle of a particular\r\nold wine that had long dwelt unsunned in the foundations of his\r\nhouse. The fog still slept on the wing above the drowned city, where\r\nthe lamps glimmered like carbuncles; and through the muffle and\r\nsmother of these fallen clouds, the procession of the town's life\r\nwas still rolling in through the great arteries with a sound as of a\r\nmighty wind. But the room was gay with firelight. In the bottle the\r\nacids were long ago resolved; the imperial dye had softened with\r\ntime, As the colour grows richer in stained windows; and the glow of\r\nhot autumn afternoons on hillside vineyards was ready to be set free\r\n\r\n40)\r\n\r\nand to disperse the fogs of London. Insensibly the lawyer melted.\r\nThere was no man from whom he kept fewer secrets than Mr. Guest;\r\nand he was not always sure that he kept as many as he meant. Guest\r\nhad often been on business to the doctor's; he knew Poole; he could\r\nscarce have failed to hear of Mr. Hyde's familiarity about the\r\nhouse; he might draw conclusions: was it not as well, then, that he\r\nshould see a letter which put that mystery to rights? and above all\r\nsince Guest, being a great student and critic of handwriting, would\r\nconsider the step natural and obliging? The clerk, besides, was a\r\nman of counsel; he would scarce read so strange a document without\r\ndropping a remark; and by that remark Mr. Utterson might shape his\r\nfuture course.\r\n\r\n\"This is a sad business about Sir Danvers,\" he said.\r\n\r\n\"Yes, sir, indeed. It has elicited a great deal of public feeling,\"\r\nreturned Guest. \"The man, of course, was mad.\"\r\n\r\n\"I should like to hear your views on that,\" replied Utterson. \"I\r\nhave a document here in his handwriting; it is between ourselves,\r\nfor I scarce know what to do about it; it is an ugly business at\r\nthe best. But there it is; quite in your way a murderer's\r\nautograph.\"\r\n\r\nGuest's eyes brightened, and he sat down at once and studied it\r\nwith passion. \"No, sir,\" he said: \"not mad; but it is an odd hand.\"\r\n\r\n41)\r\n\r\n\"And by all accounts a very odd writer,\" added the lawyer.\r\n\r\nJust then the servant entered with a note.\r\n\r\n\"Is that from Dr. Jekyll, sir?\" inquired the clerk. \"I thought I\r\nknew the writing. Anything private, Mr. Utterson?\"\r\n\r\n\"Only an invitation to dinner. Why? Do you want to see it?\"\r\n\r\n\"One moment. I thank you, sir\"; and the clerk laid the two sheets\r\nof paper alongside and sedulously compared their contents. \"Thank\r\nyou, sir,\" he said at last, returning both; \"it's a very\r\ninteresting autograph.\"\r\n\r\nThere was a pause, during which Mr. Utterson struggled with\r\nhimself. \"Why did you compare them, Guest?\" he inquired suddenly.\r\n\r\n\"Well, sir,\" returned the clerk, \"there's a rather singular\r\nresemblance; the two hands are in many points identical: only\r\ndifferently sloped.\"\r\n\r\n\"Rather quaint,\" said Utterson.\r\n\r\n\"It is, as you say, rather quaint,\" returned Guest.\r\n\r\n\"I wouldn't speak of this note, you know,\" said the master.\r\n\r\n\"No, sir,\" said the clerk. \"I understand.\"\r\n\r\nBut no sooner was Mr. Utterson alone that night than he locked the\r\nnote into his safe, where it reposed from that time forward.\r\n\"What!\" he thought. \"Henry Jekyll forge for a murderer!\" And his\r\nblood ran cold in his veins.\r\n\r\n\r\n\r\n42)\r\n\r\n\r\n\r\n                     REMARKABLE INCIDENT OF DR. LANYON\r\n\r\nTIME ran on; thousands of pounds were offered in reward, for the\r\ndeath of Sir Danvers was resented as a public injury; but Mr. Hyde\r\nhad disappeared out of the ken of the police as though he had never\r\nexisted. Much of his past was unearthed, indeed, and all\r\ndisreputable: tales came out of the man's cruelty, at once so\r\ncallous and violent; of his vile life, of his strange associates,\r\nof the hatred that seemed to have surrounded his career; but of his\r\npresent whereabouts, not a whisper. From the time he had left the\r\nhouse in Soho on the morning of the murder, he was simply blotted\r\nout; and gradually, as time drew on, Mr. Utterson began to recover\r\nfrom the hotness of his alarm, and to grow more at quiet with\r\nhimself. The death of Sir Danvers was, to his way of thinking, more\r\nthan paid for by the disappearance of Mr. Hyde. Now that that evil\r\ninfluence had been withdrawn, a new life began for Dr. Jekyll. He\r\ncame out of his seclusion, renewed relations with his friends,\r\nbecame once more their familiar guest\r\n\r\n43)\r\n\r\nand entertainer; and whilst he had always been known for\r\ncharities, he was now no less distinguished for religion. He was\r\nbusy, he was much in the open air, he did good; his face seemed to\r\nopen and brighten, as if with an inward consciousness of service;\r\nand for more than two months, the doctor was at peace.\r\n\r\nOn the 8th of January Utterson had dined at the doctor's with a\r\nsmall party; Lanyon had been there; and the face of the host had\r\nlooked from one to the other as in the old days when the trio were\r\ninseparable friends. On the 12th, and again on the 14th, the door\r\nwas shut against the lawyer. \"The doctor was confined to the\r\nhouse,\" Poole said, \"and saw no one.\" On the 15th, he tried again,\r\nand was again refused; and having now been used for the last two\r\nmonths to see his friend almost daily, he found this return of\r\nsolitude to weigh upon his spirits. The fifth night he had in Guest\r\nto dine with him; and the sixth he betook himself to Dr. Lanyon's.\r\n\r\nThere at least he was not denied admittance; but when he came in,\r\nhe was shocked at the change which had taken place in the doctor's\r\nappearance. He had his death-warrant written legibly upon his face.\r\nThe rosy man had grown pale; his flesh had fallen away; he was\r\nvisibly balder and older; and yet it was not so much, these tokens\r\nof a swift physical decay that arrested the lawyer's notice, as a\r\nlook in the eye and quality of manner that seemed to testify to\r\n\r\n44)\r\n\r\nsome deep-seated terror of the mind. It was unlikely that the\r\ndoctor should fear death; and yet that was what Utterson was\r\ntempted to suspect. \"Yes,\" he thought; \"he is a doctor, he must\r\nknow his own state and that his days are counted; and the knowledge\r\nis more than he can bear.\" And yet when Utterson remarked on his\r\nill-looks, it was with an air of greatness that Lanyon declared\r\nhimself a doomed man.\r\n\r\n\"I have had a shock,\" he said, \"and I shall never recover. It is a\r\nquestion of weeks. Well, life has been pleasant; I liked it; yes,\r\nsir, I used to like it. I sometimes think if we knew all, we should\r\nbe more glad to get away.\"\r\n\r\n\"Jekyll is ill, too,\" observed Utterson. \"Have you seen him?\"\r\n\r\nBut Lanyon's face changed, and he held up a trembling hand. \"I wish\r\nto see or hear no more of Dr. Jekyll,\" he said in a loud, unsteady\r\nvoice. \"I am quite done with that person; and I beg that you will\r\nspare me any allusion to one whom I regard as dead.\"\r\n\r\n\"Tut-tut,\" said Mr. Utterson; and then after a considerable pause,\r\n\"Can't I do anything?\" he inquired. \"We are three very old friends,\r\nLanyon; we shall not live to make others.\"\r\n\r\n\"Nothing can be done,\" returned Lanyon; \"ask himself.\"\r\n\r\n\"He will not see me,\" said the lawyer.\r\n\r\n\"I am not surprised at that,\" was the reply. \"Some day, Utterson,\r\nafter I am dead, you may\r\n\r\n45)\r\n\r\nperhaps come to learn the right and wrong of this. I cannot tell\r\nyou. And in the meantime, if you can sit and talk with me of other\r\nthings, for God's sake, stay and do so; but if you cannot keep clear\r\nof this accursed topic, then, in God's name, go, for I cannot bear\r\nit.\"\r\n\r\nAs soon as he got home, Utterson sat down and wrote to Jekyll,\r\ncomplaining of his exclusion from the house, and asking the cause\r\nof this unhappy break with Lanyon; and the next day brought him a\r\nlong answer, often very pathetically worded, and sometimes darkly\r\nmysterious in drift. The quarrel with Lanyon was incurable. \"I do\r\nnot blame our old friend,\" Jekyll wrote, \"but I share his view\r\nthat we must never meet. I mean from henceforth to lead a life of\r\nextreme seclusion; you must not be surprised, nor must you doubt\r\nmy friendship, if my door is often shut even to you. You must\r\nsuffer me to go my own dark way. I have brought on myself a\r\npunishment and a danger that I cannot name. If I am the chief of\r\nsinners, I am the chief of sufferers also. I could not think that\r\nthis earth contained a place for sufferings and terrors so\r\nunmanning; and you can do but one thing, Utterson, to lighten\r\nthis destiny, and that is to respect my silence.\" Utterson was\r\namazed; the dark influence of Hyde had been withdrawn, the doctor\r\nhad returned to his old tasks and amities; a week ago, the\r\nprospect had smiled with every promise of a cheerful and an\r\nhonoured age;\r\n\r\n46)\r\n\r\nand now in a moment, friendship, and peace of mind, and the whole\r\ntenor of his life were wrecked. So great and unprepared a change\r\npointed to madness; but in view of Lanyon's manner and words,\r\nthere must lie for it some deeper ground.\r\n\r\nA week afterwards Dr. Lanyon took to his bed, and in something\r\nless than a fortnight he was dead. The night after the funeral,\r\nat which he had been sadly affected, Utterson locked the door of\r\nhis business room, and sitting there by the light of a melancholy\r\ncandle, drew out and set before him an envelope addressed by the\r\nhand and sealed with the seal of his dead friend. \"PRIVATE: for\r\nthe hands of G. J. Utterson ALONE and in case of his predecease\r\nto be destroyed unread,\" so it was emphatically superscribed; and\r\nthe lawyer dreaded to behold the contents. \"I have buried one\r\nfriend to-day,\" he thought: \"what if this should cost me\r\nanother?\" And then he condemned the fear as a disloyalty, and\r\nbroke the seal. Within there was another enclosure, likewise\r\nsealed, and marked upon the cover as \"not to be opened till the\r\ndeath or disappearance of Dr. Henry Jekyll.\" Utterson could not\r\ntrust his eyes. Yes, it was disappearance; here again, as in the\r\nmad will which he had long ago restored to its author, here again\r\nwere the idea of a disappearance and the name of Henry Jekyll\r\nbracketed. But in the will, that idea had sprung from the\r\nsinister suggestion of\r\n\r\n47)\r\n\r\nthe man Hyde; it was set there with a purpose all too plain and\r\nhorrible. Written by the hand of Lanyon, what should it mean? A\r\ngreat curiosity came on the trustee, to disregard the prohibition\r\nand dive at once to the bottom of these mysteries; but\r\nprofessional honour and faith to his dead friend were stringent\r\nobligations; and the packet slept in the inmost corner of his\r\nprivate safe.\r\n\r\nIt is one thing to mortify curiosity, another to conquer it; and\r\nit may be doubted if, from that day forth, Utterson desired the\r\nsociety of his surviving friend with the same eagerness. He\r\nthought of him kindly; but his thoughts were disquieted and\r\nfearful. He went to call indeed; but he was perhaps relieved to\r\nbe denied admittance; perhaps, in his heart, he preferred to\r\nspeak with Poole upon the doorstep and surrounded by the air and\r\nsounds of the open city, rather than to be admitted into that\r\nhouse of voluntary bondage, and to sit and speak with its\r\ninscrutable recluse. Poole had, indeed, no very pleasant news to\r\ncommunicate. The doctor, it appeared, now more than ever confined\r\nhimself to the cabinet over the laboratory, where he would\r\nsometimes even sleep; he was out of spirits, he had grown very\r\nsilent, he did not read; it seemed as if he had something on his\r\nmind. Utterson became so used to the unvarying character of these\r\nreports, that he fell off little by little in the frequency of\r\nhis visits.\r\n\r\n48)\r\n\r\n\r\n\r\n                      INCIDENT AT THE WINDOW\r\n\r\nIT chanced on Sunday, when Mr. Utterson was on his usual walk\r\nwith Mr. Enfield, that their way lay once again through the\r\nby-street; and that when they came in front of the door, both\r\nstopped to gaze on it.\r\n\r\n\"Well,\" said Enfield, \"that story's at an end at least. We shall\r\nnever see more of Mr. Hyde.\"\r\n\r\n\"I hope not,\" said Utterson. \"Did I ever tell you that I once saw\r\nhim, and shared your feeling of repulsion?\"\r\n\r\n\"It was impossible to do the one without the other,\" returned\r\nEnfield. \"And by the way, what an ass you must have thought me,\r\nnot to know that this was a back way to Dr. Jekyll's! It was\r\npartly your own fault that I found it out, even when I did.\"\r\n\r\n\"So you found it out, did you?\" said Utterson. \"But if that be\r\nso, we may step into the court and take a look at the windows. To\r\ntell you the truth, I am uneasy about poor Jekyll; and even\r\noutside, I feel as if the presence of a friend might do him\r\ngood.\"\r\n\r\n49)\r\n\r\nThe court was very cool and a little damp, and full of premature\r\ntwilight, although the sky, high up overhead, was still bright\r\nwith sunset. The middle one of the three windows was half-way\r\nopen; and sitting close beside it, taking the air with an\r\ninfinite sadness of mien, like some disconsolate prisoner,\r\nUtterson saw Dr. Jekyll.\r\n\r\n\"What! Jekyll!\" he cried. \"I trust you are better.\"\r\n\r\n\"I am very low, Utterson,\" replied the doctor, drearily, \"very\r\nlow. It will not last long, thank God.\"\r\n\r\n\"You stay too much indoors,\" said the lawyer. \"You should be out,\r\nwhipping up the circulation like Mr. Enfield and me. (This is my\r\ncousin--Mr. Enfield--Dr. Jekyll.) Come, now; get your hat and\r\ntake a quick turn with us.\"\r\n\r\n\"You are very good,\" sighed the other. \"I should like to very\r\nmuch; but no, no, no, it is quite impossible; I dare not. But\r\nindeed, Utterson, I am very glad to see you; this is really a\r\ngreat pleasure; I would ask you and Mr. Enfield up, but the place\r\nis really not fit.\"\r\n\r\n\"Why then,\" said the lawyer, good-naturedly, \"the best thing we\r\ncan do is to stay down here and speak with you from where we\r\nare.\"\r\n\r\n\"That is just what I was about to venture to propose,\" returned\r\nthe doctor with a smile. But the words were hardly uttered,\r\nbefore the smile was struck out of his face and succeeded\r\n\r\n50)\r\n\r\nby an expression of such abject terror and despair, as froze the\r\nvery blood of the two gentlemen below. They saw it but for a\r\nglimpse, for the window was instantly thrust down; but that\r\nglimpse had been sufficient, and they turned and left the court\r\nwithout a word. In silence, too, they traversed the by-street;\r\nand it was not until they had come into a neighbouring\r\nthoroughfare, where even upon a Sunday there were still some\r\nstirrings of life, that Mr. Utterson at last turned and looked at\r\nhis companion. They were both pale; and there was an answering\r\nhorror in their eyes.\r\n\r\n\"God forgive us, God forgive us,\" said Mr. Utterson.\r\n\r\nBut Mr. Enfield only nodded his head very seriously and walked on\r\nonce more in silence.\r\n\r\n51)\r\n\r\n\r\n\r\n                             THE LAST NIGHT\r\n\r\nMR. UTTERSON was sitting by his fireside one evening after\r\ndinner, when he was surprised to receive a visit from Poole.\r\n\r\n\"Bless me, Poole, what brings you here?\" he cried; and then\r\ntaking a second look at him, \"What ails you?\" he added; \"is the\r\ndoctor ill?\"\r\n\r\n\"Mr. Utterson,\" said the man, \"there is something wrong.\"\r\n\r\n\r\n\"Take a seat, and here is a glass of wine for you,\" said the\r\nlawyer. \"Now, take your time, and tell me plainly what you want.\"\r\n\r\n\"You know the doctor's ways, sir,\" replied Poole, \"and how he\r\nshuts himself up. Well, he's shut up again in the cabinet; and I\r\ndon't like it, sir--I wish I may die if I like it. Mr. Utterson,\r\nsir, I'm afraid.\"\r\n\r\n\"Now, my good man,\" said the lawyer, \"be explicit. What are you\r\nafraid of?\"\r\n\r\n\"I've been afraid for about a week,\" returned Poole, doggedly\r\ndisregarding the question, \"and I can bear it no more.\"\r\n\r\nThe man's appearance amply bore out his\r\n\r\n52)\r\n\r\nwords; his manner was altered for the worse; and except for the\r\nmoment when he had first announced his terror, he had not once\r\nlooked the lawyer in the face. Even now, he sat with the glass of\r\nwine untasted on his knee, and his eyes directed to a corner of\r\nthe floor. \"I can bear it no more,\" he repeated.\r\n\r\n\"Come,\" said the lawyer, \"I see you have some good reason, Poole;\r\nI see there is something seriously amiss. Try to tell me what it\r\nis.\"\r\n\r\n\"I think there's been foul play,\" said Poole, hoarsely.\r\n\r\n\r\n\"Foul play!\" cried the lawyer, a good deal frightened and rather\r\ninclined to be irritated in consequence. \"What foul play? What\r\ndoes the man mean?\"\r\n\r\n\"I daren't say, sir,\" was the answer; \"but will you come along\r\nwith me and see for yourself?\"\r\n\r\nMr. Utterson's only answer was to rise and get his hat and\r\ngreat-coat; but he observed with wonder the greatness of the\r\nrelief that appeared upon the butler's face, and perhaps with no\r\nless, that the wine was still untasted when he set it down to\r\nfollow.\r\n\r\nIt was a wild, cold, seasonable night of March, with a pale moon,\r\nlying on her back as though the wind had tilted her, and a flying\r\nwrack of the most diaphanous and lawny texture. The wind made\r\ntalking difficult, and flecked the blood into the face. It seemed\r\nto have swept the\r\n\r\n53)\r\n\r\nstreets unusually bare of passengers, besides; for Mr. Utterson\r\nthought he had never seen that part of London so deserted. He\r\ncould have wished it otherwise; never in his life had he been\r\nconscious of so sharp a wish to see and touch his\r\nfellow-creatures; for struggle as he might, there was borne in\r\nupon his mind a crushing anticipation of calamity. The square,\r\nwhen they got there, was all full of wind and dust, and the thin\r\ntrees in the garden were lashing themselves along the railing.\r\nPoole, who had kept all the way a pace or two ahead, now pulled\r\nup in the middle of the pavement, and in spite of the biting\r\nweather, took off his hat and mopped his brow with a red\r\npocket-handkerchief. But for all the hurry of his coming, these\r\nwere not the dews of exertion that he wiped away, but the\r\nmoisture of some strangling anguish; for his face was white and\r\nhis voice, when he spoke, harsh and broken.\r\n\r\n\"Well, sir,\" he said, \"here we are, and God grant there be\r\nnothing wrong.\"\r\n\r\n\"Amen, Poole,\" said the lawyer.\r\n\r\nThereupon the servant knocked in a very guarded manner; the door\r\nwas opened on the chain; and a voice asked from within, \"Is that\r\nyou, Poole?\"\r\n\r\n\"It's all right,\" said Poole. \"Open the door.\" The hall, when\r\nthey entered it, was brightly lighted up; the fire was built\r\nhigh; and about the hearth the whole of the servants, men and\r\n\r\n54)\r\n\r\nwomen, stood huddled together like a flock of sheep. At the sight\r\nof Mr. Utterson, the housemaid broke into hysterical whimpering;\r\nand the cook, crying out, \"Bless God! it's Mr. Utterson,\" ran\r\nforward as if to take him in her arms.\r\n\r\n\"What, what? Are you all here?\" said the lawyer peevishly. \"Very\r\nirregular, very unseemly; your master would be far from pleased.\"\r\n\r\n\"They're all afraid,\" said Poole.\r\n\r\nBlank silence followed, no one protesting; only the maid lifted\r\nup her voice and now wept loudly.\r\n\r\n\"Hold your tongue!\" Poole said to her, with a ferocity of accent\r\nthat testified to his own jangled nerves; and indeed, when the\r\ngirl had so suddenly raised the note of her lamentation, they had\r\nall started and turned toward the inner door with faces of\r\ndreadful expectation. \"And now,\" continued the butler, addressing\r\nthe knife-boy, \"reach me a candle, and we'll get this through\r\nhands at once.\" And then he begged Mr. Utterson to follow him,\r\nand led the way to the back-garden.\r\n\r\n\"Now, sir,\" said he, \"you come as gently as you can. I want you\r\nto hear, and I don't want you to be heard. And see here, sir, if\r\nby any chance he was to ask you in, don't go.\"\r\n\r\nMr. Utterson's nerves, at this unlooked-for termination, gave a\r\njerk that nearly threw him from his balance; but he re-collected\r\nhis courage\r\n\r\n55)\r\n\r\nand followed the butler into the laboratory building and through\r\nthe surgical theatre, with its lumber of crates and bottles, to\r\nthe foot of the stair. Here Poole motioned him to stand on one\r\nside and listen; while he himself, setting down the candle and\r\nmaking a great and obvious call on his resolution, mounted the\r\nsteps and knocked with a somewhat uncertain hand on the red baize\r\nof the cabinet door.\r\n\r\n\"Mr. Utterson, sir, asking to see you,\" he called; and even as he\r\ndid so, once more violently signed to the lawyer to give ear.\r\n\r\nA voice answered from within: \"Tell him I cannot see any one,\" it\r\nsaid complainingly.\r\n\r\n\"Thank you, sir,\" said Poole, with a note of something like\r\ntriumph in his voice; and taking up his candle, he led Mr.\r\nUtterson back across the yard and into the great kitchen, where\r\nthe fire was out and the beetles were leaping on the floor.\r\n\r\n\"Sir,\" he said, looking Mr. Utterson in the eyes, \"was that my\r\nmaster's voice?\"\r\n\r\n\"It seems much changed,\" replied the lawyer, very pale, but\r\ngiving look for look.\r\n\r\n\"Changed? Well, yes, I think so,\" said the butler. \"Have I been\r\ntwenty years in this man's house, to be deceived about his voice?\r\nNo, sir; master's made away with; he was made, away with eight\r\ndays ago, when we heard him cry out upon the name of God; and\r\nwho's in there instead of him, and why it stays there, is a thing\r\nthat cries to Heaven, Mr. Utterson!\"\r\n\r\n56)\r\n\r\n\"This is a very strange tale, Poole; this is rather a wild tale,\r\nmy man,\" said Mr. Utterson, biting his finger. \"Suppose it were\r\nas you suppose, supposing Dr. Jekyll to have been--well,\r\nmurdered, what could induce the murderer to stay? That won't hold\r\nwater; it doesn't commend itself to reason.\"\r\n\r\n\"Well, Mr. Utterson, you are a hard man to satisfy, but I'll do\r\nit yet,\" said Poole. \"All this last week (you must know) him, or\r\nit, or whatever it is that lives in that cabinet, has been crying\r\nnight and day for some sort of medicine and cannot get it to his\r\nmind. It was sometimes his way--the master's, that is--to\r\nwrite his orders on a sheet of paper and throw it on the stair.\r\nWe've had nothing else this week back; nothing but papers, and a\r\nclosed door, and the very meals left there to be smuggled in when\r\nnobody was looking. Well, sir, every day, ay, and twice and\r\nthrice in the same day, there have been orders and complaints,\r\nand I have been sent flying to all the wholesale chemists in\r\ntown. Every time I brought the stuff back, there would be another\r\npaper telling me to return it, because it was not pure, and\r\nanother order to a different firm. This drug is wanted bitter\r\nbad, sir, whatever for.\"\r\n\r\n\"Have you any of these papers?\" asked Mr. Utterson.\r\n\r\nPoole felt in his pocket and handed out a crumpled note, which\r\nthe lawyer, bending nearer\r\n\r\n57)\r\n\r\nto the candle, carefully examined. Its contents ran thus: \"Dr.\r\nJekyll presents his compliments to Messrs. Maw. He assures them\r\nthat their last sample is impure and quite useless for his\r\npresent purpose. In the year 18---, Dr. J. purchased a somewhat\r\nlarge quantity from Messrs. M. He now begs them to search with\r\nthe most sedulous care, and should any of the same quality be\r\nleft, to forward it to him at once. Expense is no consideration.\r\nThe importance of this to Dr. J. can hardly be exaggerated.\" So\r\nfar the letter had run composedly enough, but here with a sudden\r\nsplutter of the pen, the writer's emotion had broken loose. \"For\r\nGod's sake,\" he had added, \"find me some of the old.\"\r\n\r\n\"This is a strange note,\" said Mr. Utterson; and then sharply,\r\n\"How do you come to have it open?\"\r\n\r\n\"The man at Maw's was main angry, sir, and he threw it back to me\r\nlike so much dirt,\" returned Poole.\r\n\r\n\"This is unquestionably the doctor's hand, do you know?\" resumed\r\nthe lawyer.\r\n\r\n\"I thought it looked like it,\" said the servant rather sulkily;\r\nand then, with another voice, \"But what matters hand-of-write?\"\r\nhe said. \"I've seen him!\"\r\n\r\n\"Seen him?\" repeated Mr. Utterson. \"Well?\"\r\n\r\n\"That's it!\" said Poole. \"It was this way. I came suddenly into\r\nthe theatre from the\r\n\r\n58)\r\n\r\ngarden. It seems he had slipped out to look for this drug or\r\nwhatever it is; for the cabinet door was open, and there he was\r\nat the far end of the room digging among the crates. He looked up\r\nwhen I came in, gave a kind of cry, and whipped up-stairs into\r\nthe cabinet. It was but for one minute that I saw him, but the\r\nhair stood upon my head like quills. Sir, if that was my master,\r\nwhy had he a mask upon his face? If it was my master, why did he\r\ncry out like a rat, and run from me? I have served him long\r\nenough. And then...\" The man paused and passed his hand over his\r\nface.\r\n\r\n\"These are all very strange circumstances,\" said Mr. Utterson,\r\n\"but I think I begin to see daylight. Your master, Poole, is\r\nplainly seized with one of those maladies that both torture and\r\ndeform the sufferer; hence, for aught I know, the alteration of\r\nhis voice; hence the mask and the avoidance of his friends; hence\r\nhis eagerness to find this drug, by means of which the poor soul\r\nretains some hope of ultimate recovery--God grant that he be\r\nnot deceived! There is my explanation; it is sad enough, Poole,\r\nay, and appalling to consider; but it is plain and natural, hangs\r\nwell together, and delivers us from all exorbitant alarms.\"\r\n\r\n\"Sir,\" said the butler, turning to a sort of mottled pallor,\r\n\"that thing was not my master, and there's the truth. My master\"\r\nhere he looked round him and began to whisper--\"is\r\n\r\n59)\r\n\r\na tall, fine build of a man, and this was more of a dwarf.\"\r\nUtterson attempted to protest. \"O, sir,\" cried Poole, \"do you\r\nthink I do not know my master after twenty years? Do you think I\r\ndo not know where his head comes to in the cabinet door, where I\r\nsaw him every morning of my life? No, Sir, that thing in the mask\r\nwas never Dr. Jekyll--God knows what it was, but it was never\r\nDr. Jekyll; and it is the belief of my heart that there was\r\nmurder done.\"\r\n\r\n\"Poole,\" replied the lawyer, \"if you say that, it will become my\r\nduty to make certain. Much as I desire to spare your master's\r\nfeelings, much as I am puzzled by this note which seems to prove\r\nhim to be still alive, I shall consider it my duty to break in\r\nthat door.\"\r\n\r\n\"Ah Mr. Utterson, that's talking!\" cried the butler.\r\n\r\n\"And now comes the second question,\" resumed Utterson: \"Who is\r\ngoing to do it?\"\r\n\r\n\"Why, you and me,\" was the undaunted reply.\r\n\r\n\"That's very well said,\" returned the lawyer; \"and whatever comes\r\nof it, I shall make it my business to see you are no loser.\"\r\n\r\n\"There is an axe in the theatre,\" continued Poole; \"and you might\r\ntake the kitchen poker for yourself.\"\r\n\r\nThe lawyer took that rude but weighty instrument into his hand,\r\nand balanced it. \"Do you know, Poole,\" he said, looking up, \"that\r\n\r\n60)\r\n\r\nyou and I are about to place ourselves in a position of some\r\nperil?\"\r\n\r\n\"You may say so, sir, indeed,\" returned the butler.\r\n\r\n\"It is well, then, that we should be frank,\" said the other. \"We\r\nboth think more than we have said; let us make a clean breast.\r\nThis masked figure that you saw, did you recognise it?\"\r\n\r\n\"Well, sir, it went so quick, and the creature was so doubled up,\r\nthat I could hardly swear to that,\" was the answer. \"But if you\r\nmean, was it Mr. Hyde?--why, yes, I think it was! You see, it\r\nwas much of the same bigness; and it had the same quick, light\r\nway with it; and then who else could have got in by the\r\nlaboratory door? You have not forgot, sir that at the time of the\r\nmurder he had still the key with him? But that's not all. I don't\r\nknow, Mr. Utterson, if ever you met this Mr. Hyde?\"\r\n\r\n\"Yes,\" said the lawyer, \"I once spoke with him.\"\r\n\r\n\"Then you must know as well as the rest of us that there was\r\nsomething queer about that gentleman--something that gave a man\r\na turn--I don't know rightly how to say it, sir, beyond this:\r\nthat you felt it in your marrow kind of cold and thin.\"\r\n\r\n\"I own I felt something of what you describe,\" said Mr. Utterson.\r\n\r\n\"Quite so, sir,\" returned Poole. \"Well, when\r\n\r\n61)\r\n\r\nthat masked thing like a monkey jumped from among the chemicals\r\nand whipped into the cabinet, it went down my spine like ice. Oh,\r\nI know it's not evidence, Mr. Utterson. I'm book-learned enough\r\nfor that; but a man has his feelings, and I give you my\r\nBible-word it was Mr. Hyde!\"\r\n\r\n\"Ay, ay,\" said the lawyer. \"My fears incline to the same point.\r\nEvil, I fear, founded--evil was sure to come--of that\r\nconnection. Ay, truly, I believe you; I believe poor Harry is\r\nkilled; and I believe his murderer (for what purpose, God alone\r\ncan tell) is still lurking in his victim's room. Well, let our\r\nname be vengeance. Call Bradshaw.\"\r\n\r\nThe footman came at the summons, very white and nervous.\r\n\r\n\r\n\"Pull yourself together, Bradshaw,\" said the lawyer. \"This\r\nsuspense, I know, is telling upon all of you; but it is now our\r\nintention to make an end of it. Poole, here, and I are going to\r\nforce our way into the cabinet. If all is well, my shoulders are\r\nbroad enough to bear the blame. Meanwhile, lest anything should\r\nreally be amiss, or any malefactor seek to escape by the back,\r\nyou and the boy must go round the corner with a pair of good\r\nsticks and take your post at the laboratory door. We give you ten\r\nminutes to get to your stations.\"\r\n\r\nAs Bradshaw left, the lawyer looked at his watch. \"And now,\r\nPoole, let us get to ours,\"\r\n\r\n62)\r\n\r\nhe said; and taking the poker under his arm, led the way into the\r\nyard. The scud had banked over the moon, and it was now quite\r\ndark. The wind, which only broke in puffs and draughts into that\r\ndeep well of building, tossed the light of the candle to and fro\r\nabout their steps, until they came into the shelter of the\r\ntheatre, where they sat down silently to wait. London hummed\r\nsolemnly all around; but nearer at hand, the stillness was only\r\nbroken by the sounds of a footfall moving to and fro along the\r\ncabinet floor.\r\n\r\n\"So it will walk all day, sir,\" whispered Poole; \"ay, and the\r\nbetter part of the night. Only when a new sample comes from the\r\nchemist, there's a bit of a break. Ah, it's an ill conscience\r\nthat's such an enemy to rest! Ah, sir, there's blood foully shed\r\nin every step of it! But hark again, a little closer--put your\r\nheart in your ears, Mr. Utterson, and tell me, is that the\r\ndoctor's foot?\"\r\n\r\nThe steps fell lightly and oddly, with a certain swing, for all\r\nthey went so slowly; it was different indeed from the heavy\r\ncreaking tread of Henry Jekyll. Utterson sighed. \"Is there never\r\nanything else?\" he asked.\r\n\r\nPoole nodded. \"Once,\" he said. \"Once I heard it weeping!\"\r\n\r\n\"Weeping? how that?\" said the lawyer, conscious of a sudden chill\r\nof horror.\r\n\r\n\"Weeping like a woman or a lost soul,\" said\r\n\r\n63)\r\n\r\nthe butler. \"I came away with that upon my heart, that I could\r\nhave wept too.\"\r\n\r\nBut now the ten minutes drew to an end. Poole disinterred the axe\r\nfrom under a stack of packing straw; the candle was set upon the\r\nnearest table to light them to the attack; and they drew near\r\nwith bated breath to where that patient foot was still going up\r\nand down, up and down, in the quiet of the night.\r\n\r\n\"Jekyll,\" cried Utterson, with a loud voice, \"I demand to see\r\nyou.\" He paused a moment, but there came no reply. \"I give you\r\nfair warning, our suspicions are aroused, and I must and shall\r\nsee you,\" he resumed; \"if not by fair means, then by foul! if not\r\nof your consent, then by brute force!\"\r\n\r\n\"Utterson,\" said the voice, \"for God's sake, have mercy!\"\r\n\r\n\r\n\"Ah, that's not Jekyll's voice--it's Hyde's!\" cried Utterson.\r\n\"Down with the door, Poole!\"\r\n\r\nPoole swung the axe over his shoulder; the blow shook the\r\nbuilding, and the red baize door leaped against the lock and\r\nhinges. A dismal screech, as of mere animal terror, rang from the\r\ncabinet. Up went the axe again, and again the panels crashed and\r\nthe frame bounded; four times the blow fell; but the wood was\r\ntough and the fittings were of excellent workmanship; and it was\r\nnot until the fifth, that the lock burst in sunder and the wreck\r\nof the door fell inwards on the carpet.\r\n\r\n64)\r\n\r\n\r\nThe besiegers, appalled by their own riot and the stillness that\r\nhad succeeded, stood back a little and peered in. There lay the\r\ncabinet before their eyes in the quiet lamplight, a good fire\r\nglowing and chattering on the hearth, the kettle singing its thin\r\nstrain, a drawer or two open, papers neatly set forth on the\r\nbusiness-table, and nearer the fire, the things laid out for tea:\r\nthe quietest room, you would have said, and, but for the glazed\r\npresses full of chemicals, the most commonplace that night in\r\nLondon.\r\n\r\nRight in the midst there lay the body of a man sorely contorted\r\nand still twitching. They drew near on tiptoe, turned it on its\r\nback and beheld the face of Edward Hyde. He was dressed in\r\nclothes far too large for him, clothes of the doctor's bigness;\r\nthe cords of his face still moved with a semblance of life, but\r\nlife was quite gone; and by the crushed phial in the hand and the\r\nstrong smell of kernels that hung upon the air, Utterson knew\r\nthat he was looking on the body of a self-destroyer.\r\n\r\n\"We have come too late,\" he said sternly, \"whether to save or\r\npunish. Hyde is gone to his account; and it only remains for us\r\nto find the body of your master.\"\r\n\r\nThe far greater proportion of the building was occupied by the\r\ntheatre, which filled almost the whole ground story and was\r\nlighted from above, and by the cabinet, which formed an upper\r\nstory at one end and looked upon the\r\n\r\n65)\r\n\r\ncourt. A corridor joined the theatre to the door on the\r\nby-street; and with this the cabinet communicated separately by a\r\nsecond flight of stairs. There were besides a few dark closets\r\nand a spacious cellar. All these they now thoroughly examined.\r\nEach closet needed but a glance, for all were empty, and all, by\r\nthe dust that fell from their doors, had stood long unopened. The\r\ncellar, indeed, was filled with crazy lumber, mostly dating from\r\nthe times of the surgeon who was Jekyll's predecessor; but even\r\nas they opened the door they were advertised of the uselessness\r\nof further search, by the fall of a perfect mat of cobweb which\r\nhad for years sealed up the entrance. Nowhere was there any trace\r\nof Henry Jekyll, dead or alive.\r\n\r\nPoole stamped on the flags of the corridor. \"He must be buried\r\nhere,\" he said, hearkening to the sound.\r\n\r\n\"Or he may have fled,\" said Utterson, and he turned to examine\r\nthe door in the by-street. It was locked; and lying near by on\r\nthe flags, they found the key, already stained with rust.\r\n\r\n\"This does not look like use,\" observed the lawyer.\r\n\r\n\"Use!\" echoed Poole. \"Do you not see, sir, it is broken? much as\r\nif a man had stamped on it.\"\r\n\r\n\"Ay,\" continued Utterson, \"and the fractures, too, are rusty.\"\r\nThe two men looked at each other with a scare. \"This is beyond\r\nme,\r\n\r\n66)\r\n\r\nPoole,\" said the lawyer. \"Let us go back to the cabinet.\"\r\n\r\nThey mounted the stair in silence, and still with an occasional\r\nawe-struck glance at the dead body, proceeded more thoroughly to\r\nexamine the contents of the cabinet. At one table, there were\r\ntraces of chemical work, various measured heaps of some white\r\nsalt being laid on glass saucers, as though for an experiment in\r\nwhich the unhappy man had been prevented.\r\n\r\n\"That is the same drug that I was always bringing him,\" said\r\nPoole; and even as he spoke, the kettle with a startling noise\r\nboiled over.\r\n\r\nThis brought them to the fireside, where the easy-chair was drawn\r\ncosily up, and the tea-things stood ready to the sitter's elbow,\r\nthe very sugar in the cup. There were several books on a shelf;\r\none lay beside the tea-things open, and Utterson was amazed to\r\nfind it a copy of a pious work, for which Jekyll had several\r\ntimes expressed a great esteem, annotated, in his own hand, with\r\nstartling blasphemies.\r\n\r\nNext, in the course of their review of the chamber, the searchers\r\ncame to the cheval glass, into whose depths they looked with an\r\ninvoluntary horror. But it was so turned as to show them nothing\r\nbut the rosy glow playing on the roof, the fire sparkling in a\r\nhundred repetitions along the glazed front of the presses, and\r\ntheir own pale and fearful countenances stooping to look in.\r\n\r\n67)\r\n\r\n\"This glass have seen some strange things, sir,\" whispered Poole.\r\n\r\n\"And surely none stranger than itself,\" echoed the lawyer in the\r\nsame tones. \"For what did Jekyll\"--he caught himself up at the\r\nword with a start, and then conquering the weakness--\"what\r\ncould Jekyll want with it?\" he said.\r\n\r\n\"You may say that!\" said Poole. Next they turned to the\r\nbusiness-table. On the desk among the neat array of papers, a\r\nlarge envelope was uppermost, and bore, in the doctor's hand, the\r\nname of Mr. Utterson. The lawyer unsealed it, and several\r\nenclosures fell to the floor. The first was a will, drawn in the\r\nsame eccentric terms as the one which he had returned six months\r\nbefore, to serve as a testament in case of death and as a deed of\r\ngift in case of disappearance; but, in place of the name of\r\nEdward Hyde, the lawyer, with indescribable amazement, read the\r\nname of Gabriel John Utterson. He looked at Poole, and then back\r\nat the paper, and last of all at the dead malefactor stretched\r\nupon the carpet.\r\n\r\n\"My head goes round,\" he said. \"He has been all these days in\r\npossession; he had no cause to like me; he must have raged to see\r\nhimself displaced; and he has not destroyed this document.\"\r\n\r\nHe caught up the next paper; it was a brief note in the doctor's\r\nhand and dated at the top.\r\n\r\n68)\r\n\r\n\"O Poole!\" the lawyer cried, \"he was alive and here this day. He\r\ncannot have been disposed of in so short a space, he must be\r\nstill alive, he must have fled! And then, why fled? and how? and\r\nin that case, can we venture to declare this suicide? Oh, we must\r\nbe careful. I foresee that we may yet involve your master in some\r\ndire catastrophe.\"\r\n\r\n\"Why don't you read it, sir?\" asked Poole.\r\n\r\n\"Because I fear,\" replied the lawyer solemnly. \"God grant I have\r\nno cause for it!\" And with that he brought the paper to his eyes\r\nand read as follows:\r\n\r\n\r\n\"MY DEAR UTTERSON,--When this shall fall into your hands, I\r\nshall have disappeared, under what circumstances I have not the\r\npenetration to foresee, but my instinct and all the circumstances\r\nof my nameless situation tell me that the end is sure and must be\r\nearly. Go then, and first read the narrative which Lanyon warned\r\nme he was to place in your hands; and if you care to hear more,\r\nturn to the confession of\r\n\r\n                  \"Your unworthy and unhappy friend,\r\n                                        \"HENRY JEKYLL.\"\r\n\r\n\r\n\"There was a third enclosure?\" asked Utterson.\r\n\r\n\"Here, sir,\" said Poole, and gave into his hands a considerable\r\npacket sealed in several places.\r\n\r\n69)\r\n\r\nThe lawyer put it in his pocket. \"I would say nothing of this\r\npaper. If your master has fled or is dead, we may at least save\r\nhis credit. It is now ten; I must go home and read these\r\ndocuments in quiet; but I shall be back before midnight, when we\r\nshall send for the police.\"\r\n\r\nThey went out, locking the door of the theatre behind them; and\r\nUtterson, once more leaving the servants gathered about the fire\r\nin the hall, trudged back to his office to read the two\r\nnarratives in which this mystery was now to be explained.\r\n\r\n70)\r\n\r\n\r\n\r\n                          DR. LANYON'S NARRATIVE\r\n\r\nON the ninth of January, now four days ago, I received by the\r\nevening delivery a registered envelope, addressed in the hand of\r\nmy colleague and old school-companion, Henry Jekyll. I was a good\r\ndeal surprised by this; for we were by no means in the habit of\r\ncorrespondence; I had seen the man, dined with him, indeed, the\r\nnight before; and I could imagine nothing in our intercourse that\r\nshould justify formality of registration. The contents increased\r\nmy wonder; for this is how the letter ran:\r\n\r\n                                 \"10th December, 18---\r\n\r\n\"DEAR LANYON, You are one of my oldest friends; and although we\r\nmay have differed at times on scientific questions, I cannot\r\nremember, at least on my side, any break in our affection. There\r\nwas never a day when, if you had said to me, 'Jekyll, my life, my\r\nhonour, my reason, depend upon you,' I would not have sacrificed\r\nmy left hand to help you. Lanyon, my life, my honour my reason,\r\nare all at your mercy;\r\n\r\n71)\r\n\r\nif you fail me to-night I am lost. You might suppose, after this\r\npreface, that I am going to ask you for something dishonourable\r\nto grant. Judge for yourself.\r\n\r\n\"I want you to postpone all other engagements for to-night--ay,\r\neven if you were summoned to the bedside of an emperor; to take a\r\ncab, unless your carriage should be actually at the door; and\r\nwith this letter in your hand for consultation, to drive straight\r\nto my house. Poole, my butler, has his orders; you will find, him\r\nwaiting your arrival with a locksmith. The door of my cabinet is\r\nthen to be forced: and you are to go in alone; to open the glazed\r\npress (letter E) on the left hand, breaking the lock if it be\r\nshut; and to draw out, with all its contents as they stand, the\r\nfourth drawer from the top or (which is the same thing) the third\r\nfrom the bottom. In my extreme distress of wind, I have a morbid\r\nfear of misdirecting you; but even if I am in error, you may know\r\nthe right drawer by its contents: some powders, a phial and a\r\npaper book. This drawer I beg of you to carry back with you to\r\nCavendish Square exactly as it stands.\r\n\r\n\"That is the first part of the service: now for the second. You\r\nshould be back, if you set out at once on the receipt of this,\r\nlong before midnight; but I will leave you that amount of margin,\r\nnot only in the fear of one of those obstacles that can neither\r\nbe prevented nor fore-\r\n\r\n72)\r\n\r\nseen, but because an hour when your servants are in bed is to be\r\npreferred for what will then remain to do. At midnight, then, I\r\nhave to ask you to be alone in your consulting-room, to admit\r\nwith your own hand into the house a man who will present himself\r\nin my name, and to place in his hands the drawer that you will\r\nhave brought with you from my cabinet. Then you will have played\r\nyour part and earned my gratitude completely. Five minutes\r\nafterwards, if you insist upon an explanation, you will have\r\nunderstood that these arrangements are of capital importance; and\r\nthat by the neglect of one of them, fantastic as they must\r\nappear, you might have charged your conscience with my death or\r\nthe shipwreck of my reason.\r\n\r\n\"Confident as I am that you will not trifle with this appeal, my\r\nheart sinks and my hand trembles at the bare thought of such a\r\npossibility. Think of me at this hour, in a strange place,\r\nlabouring under a blackness of distress that no fancy can\r\nexaggerate, and yet well aware that, if you will but punctually\r\nserve me, my troubles will roll away like a story that is told.\r\nServe me, my dear Lanyon, and save\r\n                                       \"Your friend,\r\n\r\n                                            \"H. J.\r\n\r\n\"P. S. I had already sealed this up when a fresh terror struck\r\nupon my soul. It is possible that the postoffice may fail me, and\r\nthis letter\r\n\r\n73)\r\n\r\nnot come into your hands until to-morrow morning. In that case,\r\ndear Lanyon, do my errand when it shall be most convenient for\r\nyou in the course of the day; and once more expect my messenger\r\nat midnight. It may then already be too late; and if that night\r\npasses without event, you will know that you have seen the last\r\nof Henry Jekyll.\"\r\n\r\n\r\nUpon the reading of this letter, I made sure my colleague was\r\ninsane; but till that was proved beyond the possibility of doubt,\r\nI felt bound to do as he requested. The less I understood of this\r\nfarrago, the less I was in a position to judge of its importance;\r\nand an appeal so worded could not be set aside without a grave\r\nresponsibility. I rose accordingly from table, got into a hansom,\r\nand drove straight to Jekyll's house. The butler was awaiting my\r\narrival; he had received by the same post as mine a registered\r\nletter of instruction, and had sent at once for a locksmith and a\r\ncarpenter. The tradesmen came while we were yet speaking; and we\r\nmoved in a body to old Dr. Denman's surgical theatre, from which\r\n(as you are doubtless aware) Jekyll's private cabinet is most\r\nconveniently entered. The door was very strong, the lock\r\nexcellent; the carpenter avowed he would have great trouble and\r\nhave to do much damage, if force were to be used; and the\r\nlocksmith was near despair. But this last was a handy fellow,\r\n\r\n74)\r\n\r\nand after two hours' work, the door stood open. The press marked\r\nE was unlocked; and I took out the drawer, had it filled up with\r\nstraw and tied in a sheet, and returned with it to Cavendish\r\nSquare.\r\n\r\nHere I proceeded to examine its contents. The powders were neatly\r\nenough made up, but not with the nicety of the dispensing\r\nchemist; so that it was plain they were of Jekyll's private\r\nmanufacture; and when I opened one of the wrappers I found what\r\nseemed to me a simple crystalline salt of a white colour. The\r\nphial, to which I next turned my attention, might have been about\r\nhalf-full of a blood-red liquor, which was highly pungent to the\r\nsense of smell and seemed to me to contain phosphorus and some\r\nvolatile ether. At the other ingredients I could make no guess.\r\nThe book was an ordinary version-book and contained little but a\r\nseries of dates. These covered a period of many years, but I\r\nobserved that the entries ceased nearly a year ago and quite\r\nabruptly. Here and there a brief remark was appended to a date,\r\nusually no more than a single word: \"double\" occurring perhaps\r\nsix times in a total of several hundred entries; and once very\r\nearly in the list and followed by several marks of exclamation,\r\n\"total failure!!!\" All this, though it whetted my curiosity, told\r\nme little that was definite. Here were a phial of some tincture,\r\na paper of some salt, and the record of a series of experi-\r\n\r\n75)\r\n\r\nments that had led (like too many of Jekyll's investigations) to\r\nno end of practical usefulness. How could the presence of these\r\narticles in my house affect either the honour, the sanity, or the\r\nlife of my flighty colleague? If his messenger could go to one\r\nplace, why could he not go to another? And even granting some\r\nimpediment, why was this gentleman to be received by me in\r\nsecret? The more I reflected the more convinced I grew that I was\r\ndealing with a case of cerebral disease: and though I dismissed\r\nmy servants to bed, I loaded an old revolver, that I might be\r\nfound in some posture of self-defence.\r\n\r\nTwelve o'clock had scarce rung out over London, ere the knocker\r\nsounded very gently on the door. I went myself at the summons,\r\nand found a small man crouching against the pillars of the\r\nportico.\r\n\r\n\"Are you come from Dr. Jekyll?\" I asked.\r\n\r\nHe told me \"yes\" by a constrained gesture; and when I had bidden\r\nhim enter, he did not obey me without a searching backward glance\r\ninto the darkness of the square. There was a policeman not far\r\noff, advancing with his bull's eye open; and at the sight, I\r\nthought my visitor started and made greater haste.\r\n\r\nThese particulars struck me, I confess, disagreeably; and as I\r\nfollowed him into the bright light of the consulting-room, I kept\r\nmy hand ready on my weapon. Here, at last, I had a\r\n\r\n76)\r\n\r\nchance of clearly seeing him. I had never set eyes on him before,\r\nso much was certain. He was small, as I have said; I was struck\r\nbesides with the shocking expression of his face, with his\r\nremarkable combination of great muscular activity and great\r\napparent debility of constitution, and--last but not least--\r\nwith the odd, subjective disturbance caused by his neighbourhood.\r\nThis bore some resemblance to incipient rigour, and was\r\naccompanied by a marked sinking of the pulse. At the time, I set\r\nit down to some idiosyncratic, personal distaste, and merely\r\nwondered at the acuteness of the symptoms; but I have since had\r\nreason to believe the cause to lie much deeper in the nature of\r\nman, and to turn on some nobler hinge than the principle of\r\nhatred.\r\n\r\nThis person (who had thus, from the first moment of his entrance,\r\nstruck in me what I can only describe as a disgustful curiosity)\r\nwas dressed in a fashion that would have made an ordinary person\r\nlaughable; his clothes, that is to say, although they were of\r\nrich and sober fabric, were enormously too large for him in every\r\nmeasurement--the trousers hanging on his legs and rolled up to\r\nkeep them from the ground, the waist of the coat below his\r\nhaunches, and the collar sprawling wide upon his shoulders.\r\nStrange to relate, this ludicrous accoutrement was far from\r\nmoving me to laughter. Rather, as there was something abnormal\r\nand misbe-\r\n\r\n77)\r\n\r\ngotten in the very essence of the creature that now faced me--\r\nsomething seizing, surprising, and revolting--this fresh\r\ndisparity seemed but to fit in with and to reinforce it; so that\r\nto my interest in the man's nature and character, there was added\r\na curiosity as to his origin, his life, his fortune and status in\r\nthe world.\r\n\r\nThese observations, though they have taken so great a space to be\r\nset down in, were yet the work of a few seconds. My visitor was,\r\nindeed, on fire with sombre excitement.\r\n\r\n\"Have you got it?\" he cried. \"Have you got it?\" And so lively was\r\nhis impatience that he even laid his hand upon my arm and sought\r\nto shake me.\r\n\r\nI put him back, conscious at his touch of a certain icy pang\r\nalong my blood. \"Come, sir,\" said I. \"You forget that I have not\r\nyet the pleasure of your acquaintance. Be seated, if you please.\"\r\nAnd I showed him an example, and sat down myself in my customary\r\nseat and with as fair an imitation of my ordinary manner to a\r\npatient, as the lateness of the hour, the nature of my\r\npre-occupations, and the horror I had of my visitor, would suffer\r\nme to muster.\r\n\r\n\"I beg your pardon, Dr. Lanyon,\" he replied civilly enough. \"What\r\nyou say is very well founded; and my impatience has shown its\r\nheels to my politeness. I come here at the instance of your\r\ncolleague, Dr. Henry Jekyll, on a piece of business of some\r\nmoment; and I under-\r\n\r\n78)\r\n\r\nstood...\" He paused and put his hand to his throat, and I could\r\nsee, in spite of his collected manner, that he was wrestling\r\nagainst the approaches of the hysteria--\"I understood, a\r\ndrawer...\"\r\n\r\nBut here I took pity on my visitor's suspense, and some perhaps\r\non my own growing curiosity.\r\n\r\n\"There it is, sir,\" said I, pointing to the drawer, where it lay\r\non the floor behind a table and still covered with the sheet.\r\n\r\nHe sprang to it, and then paused, and laid his hand upon his\r\nheart: I could hear his teeth grate with the convulsive action of\r\nhis jaws; and his face was so ghastly to see that I grew alarmed\r\nboth for his life and reason.\r\n\r\n\"Compose yourself,\" said I.\r\n\r\nHe turned a dreadful smile to me, and as if with the decision of\r\ndespair, plucked away the sheet. At sight of the contents, he\r\nuttered one loud sob of such immense relief that I sat petrified.\r\nAnd the next moment, in a voice that was already fairly well\r\nunder control, \"Have you a graduated glass?\" he asked.\r\n\r\nI rose from my place with something of an effort and gave him\r\nwhat he asked.\r\n\r\nHe thanked me with a smiling nod, measured out a few minims of\r\nthe red tincture and added one of the powders. The mixture, which\r\nwas at first of a reddish hue, began, in proportion as the\r\ncrystals melted, to brighten in colour, to effervesce audibly,\r\nand to throw off small\r\n\r\n79)\r\n\r\nfumes of vapour. Suddenly and at the same moment, the ebullition\r\nceased and the compound changed to a dark purple, which faded\r\nagain more slowly to a watery green. My visitor, who had watched\r\nthese metamorphoses with a keen eye, smiled, set down the glass\r\nupon the table, and then turned and looked upon me with an air of\r\nscrutiny.\r\n\r\n\"And now,\" said he, \"to settle what remains. Will you be wise?\r\nwill you be guided? will you suffer me to take this glass in my\r\nhand and to go forth from your house without further parley? or\r\nhas the greed of curiosity too much command of you? Think before\r\nyou answer, for it shall be done as you decide. As you decide,\r\nyou shall be left as you were before, and neither richer nor\r\nwiser, unless the sense of service rendered to a man in mortal\r\ndistress may be counted as a kind of riches of the soul. Or, if\r\nyou shall so prefer to choose, a new province of knowledge and\r\nnew avenues to fame and power shall be laid open to you, here, in\r\nthis room, upon the instant; and your sight shall be blasted by a\r\nprodigy to stagger the unbelief of Satan.\"\r\n\r\n\"Sir,\" said I, affecting a coolness that I was far from truly\r\npossessing, \"you speak enigmas, and you will perhaps not wonder\r\nthat I hear you with no very strong impression of belief. But I\r\nhave gone too far in the way of inexplicable services to pause\r\nbefore I see the end.\"\r\n\r\n\"It is well,\" replied my visitor. \"Lanyon,\r\n\r\n80)\r\n\r\nyou remember your vows: what follows is under the seal of our\r\nprofession. And now, you who have so long been bound to the most\r\nnarrow and material views, you who have denied the virtue of\r\ntranscendental medicine, you who have derided your superiors--\r\nbehold!\"\r\n\r\nHe put the glass to his lips and drank at one gulp. A cry\r\nfollowed; he reeled, staggered, clutched at the table and held\r\non, staring with injected eyes, gasping with open mouth; and as I\r\nlooked there came, I thought, a change--he seemed to swell--\r\nhis face became suddenly black and the features seemed to melt\r\nand alter--and the next moment, I had sprung to my feet and\r\nleaped back against the wall, my arm raised to shield me from\r\nthat prodigy, my mind submerged in terror.\r\n\r\n\"O God!\" I screamed, and \"O God!\" again and again; for there\r\nbefore my eyes--pale and shaken, and half-fainting, and groping\r\nbefore him with his hands, like a man restored from death--\r\nthere stood Henry Jekyll!\r\n\r\nWhat he told me in the next hour, I cannot bring my mind to set\r\non paper. I saw what I saw, I heard what I heard, and my soul\r\nsickened at it; and yet now when that sight has faded from my\r\neyes, I ask myself if I believe it, and I cannot answer. My life\r\nis shaken to its roots; sleep has left me; the deadliest terror\r\nsits by me at all hours of the day and night; I feel that my days\r\nare numbered, and that I\r\n\r\n81)\r\n\r\nmust die; and yet I shall die incredulous. As for the moral\r\nturpitude that man unveiled to me, even with tears of penitence,\r\nI cannot, even in memory, dwell on it without a start of horror.\r\nI will say but one thing, Utterson, and that (if you can bring\r\nyour mind to credit it) will be more than enough. The creature\r\nwho crept into my house that night was, on Jekyll's own\r\nconfession, known by the name of Hyde and hunted for in every\r\ncorner of the land as the murderer of Carew.\r\n                                               HASTIE LANYON\r\n\r\n82)\r\n\r\n\r\n\r\n                HENRY JEKYLL'S FULL STATEMENT OF THE CASE\r\n\r\nI WAS born in the year 18--- to a large fortune, endowed besides\r\nwith excellent parts, inclined by nature to industry, fond of the\r\nrespect of the wise and good among my fellow-men, and thus, as\r\nmight have been supposed, with every guarantee of an honourable\r\nand distinguished future. And indeed the worst of my faults was a\r\ncertain impatient gaiety of disposition, such as has made the\r\nhappiness of many, but such as I found it hard to reconcile with\r\nmy imperious desire to carry my head high, and wear a more than\r\ncommonly grave countenance before the public. Hence it came about\r\nthat I concealed my pleasures; and that when I reached years of\r\nreflection, and began to look round me and take stock of my\r\nprogress and position in the world, I stood already committed to\r\na profound duplicity of life. Many a man would have even blazoned\r\nsuch irregularities as I was guilty of; but from the high views\r\nthat I had set before me, I regarded and hid them with an almost\r\nmorbid sense of shame. It was thus rather the exacting\r\n\r\n83)\r\n\r\nnature of my aspirations than any particular degradation in my\r\nfaults, that made me what I was and, with even a deeper trench\r\nthan in the majority of men, severed in me those provinces of\r\ngood and ill which divide and compound man's dual nature. In this\r\ncase, I was driven to reflect deeply and inveterately on that\r\nhard law of life, which lies at the root of religion and is one\r\nof the most plentiful springs of distress. Though so profound a\r\ndouble-dealer, I was in no sense a hypocrite; both sides of me\r\nwere in dead earnest; I was no more myself when I laid aside\r\nrestraint and plunged in shame, than when I laboured, in the eye\r\nof day, at the furtherance of knowledge or the relief of sorrow\r\nand suffering. And it chanced that the direction of my scientific\r\nstudies, which led wholly toward the mystic and the\r\ntranscendental, re-acted and shed a strong light on this\r\nconsciousness of the perennial war among my members. With every\r\nday, and from both sides of my intelligence, the moral and the\r\nintellectual, I thus drew steadily nearer to that truth, by whose\r\npartial discovery I have been doomed to such a dreadful\r\nshipwreck: that man is not truly one, but truly two. I say two,\r\nbecause the state of my own knowledge does not pass beyond that\r\npoint. Others will follow, others will outstrip me on the same\r\nlines; and I hazard the guess that man will be ultimately known\r\nfor a mere polity of multifarious, incongruous, and independent\r\ndenizens. I, for my\r\n\r\n84)\r\n\r\npart, from the nature of my life, advanced infallibly in one\r\ndirection and in one direction only. It was on the moral side,\r\nand in my own person, that I learned to recognise the thorough\r\nand primitive duality of man; I saw that, of the two natures that\r\ncontended in the field of my consciousness, even if I could\r\nrightly be said to be either, it was only because I was radically\r\nboth; and from an early date, even before the course of my\r\nscientific discoveries had begun to suggest the most naked\r\npossibility of such a miracle, I had learned to dwell with\r\npleasure, as a beloved day-dream, on the thought of the\r\nseparation of these elements. If each, I told myself, could but\r\nbe housed in separate identities, life would be relieved of all\r\nthat was unbearable; the unjust delivered from the aspirations\r\nmight go his way, and remorse of his more upright twin; and the\r\njust could walk steadfastly and securely on his upward path,\r\ndoing the good things in which he found his pleasure, and no\r\nlonger exposed to disgrace and penitence by the hands of this\r\nextraneous evil. It was the curse of mankind that these\r\nincongruous fagots were thus bound together that in the agonised\r\nwomb of consciousness, these polar twins should be continuously\r\nstruggling. How, then, were they dissociated?\r\n\r\nI was so far in my reflections when, as I have said, a side-light\r\nbegan to shine upon the subject from the laboratory table. I\r\nbegan to perceive\r\n\r\n85)\r\n\r\nmore deeply than it has ever yet been stated, the trembling\r\nimmateriality, the mist-like transience of this seemingly so\r\nsolid body in which we walk attired. Certain agents I found to\r\nhave the power to shake and to pluck back that fleshly vestment,\r\neven as a wind might toss the curtains of a pavilion. For two\r\ngood reasons, I will not enter deeply into this scientific branch\r\nof my confession. First, because I have been made to learn that\r\nthe doom and burthen of our life is bound for ever on man's\r\nshoulders, and when the attempt is made to cast it off, it but\r\nreturns upon us with more unfamiliar and more awful pressure.\r\nSecond, because, as my narrative will make, alas! too evident, my\r\ndiscoveries were incomplete. Enough, then, that I not only\r\nrecognised my natural body for the mere aura and effulgence of\r\ncertain of the powers that made up my spirit, but managed to\r\ncompound a drug by which these powers should be dethroned from\r\ntheir supremacy, and a second form and countenance substituted,\r\nnone the less natural to me because they were the expression, and\r\nbore the stamp, of lower elements in my soul.\r\n\r\nI hesitated long before I put this theory to the test of\r\npractice. I knew well that I risked death; for any drug that so\r\npotently controlled and shook the very fortress of identity,\r\nmight by the least scruple of an overdose or at the least\r\ninopportunity in the moment of exhibition, utterly blot out that\r\nimmaterial tabernacle which I\r\n\r\n86)\r\n\r\nlooked to it to change. But the temptation of a discovery so\r\nsingular and profound, at last overcame the suggestions of alarm.\r\nI had long since prepared my tincture; I purchased at once, from\r\na firm of wholesale chemists, a large quantity of a particular\r\nsalt which I knew, from my experiments, to be the last ingredient\r\nrequired; and late one accursed night, I compounded the elements,\r\nwatched them boil and smoke together in the glass, and when the\r\nebullition had subsided, with a strong glow of courage, drank off\r\nthe potion.\r\n\r\nThe most racking pangs succeeded: a grinding in the bones, deadly\r\nnausea, and a horror of the spirit that cannot be exceeded at the\r\nhour of birth or death. Then these agonies began swiftly to\r\nsubside, and I came to myself as if out of a great sickness.\r\nThere was something strange in my sensations, something\r\nindescribably new and, from its very novelty, incredibly sweet. I\r\nfelt younger, lighter, happier in body; within I was conscious of\r\na heady recklessness, a current of disordered sensual images\r\nrunning like a mill-race in my fancy, a solution of the bonds of\r\nobligation, an unknown but not an innocent freedom of the soul. I\r\nknew myself, at the first breath of this new life, to be more\r\nwicked, tenfold more wicked, sold a slave to my original evil;\r\nand the thought, in that moment, braced and delighted me like\r\nwine. I stretched out my hands, exulting in the freshness of\r\nthese\r\n\r\n87)\r\n\r\nsensations; and in the act, I was suddenly aware that I had lost\r\nin stature.\r\n\r\nThere was no mirror, at that date, in my room; that which stands\r\nbeside me as I write, was brought there later on and for the very\r\npurpose of these transformations. The night, however, was far\r\ngone into the morning--the morning, black as it was, was nearly\r\nripe for the conception of the day--the inmates of my house\r\nwere locked in the most rigorous hours of slumber; and I\r\ndetermined, flushed as I was with hope and triumph, to venture in\r\nmy new shape as far as to my bedroom. I crossed the yard, wherein\r\nthe constellations looked down upon me, I could have thought,\r\nwith wonder, the first creature of that sort that their\r\nunsleeping vigilance had yet disclosed to them; I stole through\r\nthe corridors, a stranger in my own house; and coming to my room,\r\nI saw for the first time the appearance of Edward Hyde.\r\n\r\nI must here speak by theory alone, saying not that which I know,\r\nbut that which I suppose to be most probable. The evil side of my\r\nnature, to which I had now transferred the stamping efficacy, was\r\nless robust and less developed than the good which I had just\r\ndeposed. Again, in the course of my life, which had been, after\r\nall, nine-tenths a life of effort, virtue, and control, it had\r\nbeen much less exercised and much less exhausted. And hence, as I\r\nthink, it came about that Edward Hyde was so much smaller,\r\n\r\n88)\r\n\r\nslighter, and younger than Henry Jekyll. Even as good shone upon\r\nthe countenance of the one, evil was written broadly and plainly\r\non the face of the other. Evil besides (which I must still\r\nbelieve to be the lethal side of man) had left on that body an\r\nimprint of deformity and decay. And yet when I looked upon that\r\nugly idol in the glass, I was conscious of no repugnance, rather\r\nof a leap of welcome. This, too, was myself. It seemed natural\r\nand human. In my eyes it bore a livelier image of the spirit, it\r\nseemed more express and single, than the imperfect and divided\r\ncountenance I had been hitherto accustomed to call mine. And in\r\nso far I was doubtless right. I have observed that when I wore\r\nthe semblance of Edward Hyde, none could come near to me at first\r\nwithout a visible misgiving of the flesh. This, as I take it, was\r\nbecause all human beings, as we meet them, are commingled out of\r\ngood and evil: and Edward Hyde, alone in the ranks of mankind,\r\nwas pure evil.\r\n\r\nI lingered but a moment at the mirror: the second and conclusive\r\nexperiment had yet to be attempted; it yet remained to be seen if\r\nI had lost my identity beyond redemption and must flee before\r\ndaylight from a house that was no longer mine; and hurrying back\r\nto my cabinet, I once more prepared and drank the cup, once more\r\nsuffered the pangs of dissolution, and came to myself once more\r\nwith the character, the stature, and the face of Henry Jekyll.\r\n\r\n89)\r\n\r\nThat night I had come to the fatal cross-roads. Had I approached\r\nmy discovery in a more noble spirit, had I risked the experiment\r\nwhile under the empire of generous or pious aspirations, all must\r\nhave been otherwise, and from these agonies of death and birth, I\r\nhad come forth an angel instead of a fiend. The drug had no\r\ndiscriminating action; it was neither diabolical nor divine; it\r\nbut shook the doors of the prison-house of my disposition; and\r\nlike the captives of Philippi, that which stood within ran forth.\r\nAt that time my virtue slumbered; my evil, kept awake by\r\nambition, was alert and swift to seize the occasion; and the\r\nthing that was projected was Edward Hyde. Hence, although I had\r\nnow two characters as well as two appearances, one was wholly\r\nevil, and the other was still the old Henry Jekyll, that\r\nincongruous compound of whose reformation and improvement I had\r\nalready learned to despair. The movement was thus wholly toward\r\nthe worse.\r\n\r\nEven at that time, I had not yet conquered my aversion to the\r\ndryness of a life of study. I would still be merrily disposed at\r\ntimes; and as my pleasures were (to say the least) undignified,\r\nand I was not only well known and highly considered, but growing\r\ntoward the elderly man, this incoherency of my life was daily\r\ngrowing more unwelcome. It was on this side that my new power\r\ntempted me until I fell in slavery. I had but to drink the cup,\r\nto doff at once the body\r\n\r\n90)\r\n\r\nof the noted professor, and to assume, like a thick cloak, that\r\nof Edward Hyde. I smiled at the notion; it seemed to me at the\r\ntime to be humorous; and I made my preparations with the most\r\nstudious care. I took and furnished that house in Soho, to which\r\nHyde was tracked by the police; and engaged as housekeeper a\r\ncreature whom I well knew to be silent and unscrupulous. On the\r\nother side, I announced to my servants that a Mr. Hyde (whom I\r\ndescribed) was to have full liberty and power about my house in\r\nthe square; and to parry mishaps, I even called and made myself a\r\nfamiliar object, in my second character. I next drew up that will\r\nto which you so much objected; so that if anything befell me in\r\nthe person of Dr. Jekyll, I could enter on that of Edward Hyde\r\nwithout pecuniary loss. And thus fortified, as I supposed, on\r\nevery side, I began to profit by the strange immunities of my\r\nposition.\r\n\r\nMen have before hired bravos to transact their crimes, while\r\ntheir own person and reputation sat under shelter. I was the\r\nfirst that ever did so for his pleasures. I was the first that\r\ncould thus plod in the public eye with a load of genial\r\nrespectability, and in a moment, like a schoolboy, strip off\r\nthese lendings and spring headlong into the sea of liberty. But\r\nfor me, in my impenetrable mantle, the safety was complete. Think\r\nof it--I did not even exist! Let me but escape into my\r\nlaboratory door, give me but a second or\r\n\r\n91)\r\n\r\ntwo to mix and swallow the draught that I had always standing\r\nready; and whatever he had done, Edward Hyde would pass away like\r\nthe stain of breath upon a mirror; and there in his stead,\r\nquietly at home, trimming the midnight lamp in his study, a man\r\nwho could afford to laugh at suspicion, would be Henry Jekyll.\r\n\r\nThe pleasures which I made haste to seek in my disguise were, as\r\nI have said, undignified; I would scarce use a harder term. But\r\nin the hands of Edward Hyde, they soon began to turn toward the\r\nmonstrous. When I would come back from these excursions, I was\r\noften plunged into a kind of wonder at my vicarious depravity.\r\nThis familiar that I called out of my own soul, and sent forth\r\nalone to do his good pleasure, was a being inherently malign and\r\nvillainous; his every act and thought centred on self; drinking\r\npleasure with bestial avidity from any degree of torture to\r\nanother; relentless like a man of stone. Henry Jekyll stood at\r\ntimes aghast before the acts of Edward Hyde; but the situation\r\nwas apart from ordinary laws, and insidiously relaxed the grasp\r\nof conscience. It was Hyde, after all, and Hyde alone, that was\r\nguilty. Jekyll was no worse; he woke again to his good qualities\r\nseemingly unimpaired; he would even make haste, where it was\r\npossible, to undo the evil done by Hyde. And thus his conscience\r\nslumbered.\r\n\r\nInto the details of the infamy at which I thus\r\n\r\n92)\r\n\r\nconnived (for even now I can scarce grant that I committed it) I\r\nhave no design of entering; I mean but to point out the warnings\r\nand the successive steps with which my chastisement approached. I\r\nmet with one accident which, as it brought on no consequence, I\r\nshall no more than mention. An act of cruelty to a child aroused\r\nagainst me the anger of a passer-by, whom I recognised the other\r\nday in the person of your kinsman; the doctor and the child's\r\nfamily joined him; there were moments when I feared for my life;\r\nand at last, in order to pacify their too just resentment, Edward\r\nHyde had to bring them to the door, and pay them in a cheque\r\ndrawn in the name of Henry Jekyll. But this danger was easily\r\neliminated from the future, by opening an account at another bank\r\nin the name of Edward Hyde himself; and when, by sloping my own\r\nhand backward, I had supplied my double with a signature, I\r\nthought I sat beyond the reach of fate.\r\n\r\nSome two months before the murder of Sir Danvers, I had been out\r\nfor one of my adventures, had returned at a late hour, and woke\r\nthe next day in bed with somewhat odd sensations. It was in vain\r\nI looked about me; in vain I saw the decent furniture and tall\r\nproportions of my room in the square; in vain that I recognised\r\nthe pattern of the bed-curtains and the design of the mahogany\r\nframe; something still kept insisting that I was not where I was,\r\n\r\n93)\r\n\r\nthat I had not wakened where I seemed to be, but in the little\r\nroom in Soho where I was accustomed to sleep in the body of\r\nEdward Hyde. I smiled to myself, and, in my psychological way\r\nbegan lazily to inquire into the elements of this illusion,\r\noccasionally, even as I did so, dropping back into a comfortable\r\nmorning doze. I was still so engaged when, in one of my more\r\nwakeful moments, my eyes fell upon my hand. Now the hand of Henry\r\nJekyll (as you have often remarked) was professional in shape and\r\nsize: it was large, firm, white, and comely. But the hand which I\r\nnow saw, clearly enough, in the yellow light of a mid-London\r\nmorning, lying half shut on the bed-clothes, was lean, corded,\r\nknuckly, of a dusky pallor and thickly shaded with a swart growth\r\nof hair. It was the hand of Edward Hyde.\r\n\r\nI must have stared upon it for near half a minute, sunk as I was\r\nin the mere stupidity of wonder, before terror woke up in my\r\nbreast as sudden and startling as the crash of cymbals; and\r\nbounding from my bed, I rushed to the mirror. At the sight that\r\nmet my eyes, my blood was changed into something exquisitely thin\r\nand icy. Yes, I had gone to bed Henry Jekyll, I had awakened\r\nEdward Hyde. How was this to be explained? I asked myself, and\r\nthen, with another bound of terror--how was it to be remedied?\r\nIt was well on in the morning; the servants were up; all my drugs\r\nwere in the\r\n\r\n94)\r\n\r\ncabinet--a long journey down two pairs of stairs, through the\r\nback passage, across the open court and through the anatomical\r\ntheatre, from where I was then standing horror-struck. It might\r\nindeed be possible to cover my face; but of what use was that,\r\nwhen I was unable to conceal the alteration in my stature? And\r\nthen with an overpowering sweetness of relief, it came back upon\r\nmy mind that the servants were already used to the coming and\r\ngoing of my second self. I had soon dressed, as well as I was\r\nable, in clothes of my own size: had soon passed through the\r\nhouse, where Bradshaw stared and drew back at seeing Mr. Hyde at\r\nsuch an hour and in such a strange array; and ten minutes later,\r\nDr. Jekyll had returned to his own shape and was sitting down,\r\nwith a darkened brow, to make a feint of breakfasting.\r\n\r\nSmall indeed was my appetite. This inexplicable incident, this\r\nreversal of my previous experience, seemed, like the Babylonian\r\nfinger on the wall, to be spelling out the letters of my\r\njudgment; and I began to reflect more seriously than ever before\r\non the issues and possibilities of my double existence. That part\r\nof me which I had the power of projecting, had lately been much\r\nexercised and nourished; it had seemed to me of late as though\r\nthe body of Edward Hyde had grown in stature, as though (when I\r\nwore that form) I were conscious of a more generous tide of\r\nblood; and I began to spy a danger that,\r\n\r\n95)\r\n\r\nif this were much prolonged, the balance of my nature might be\r\npermanently overthrown, the power of voluntary change be\r\nforfeited, and the character of Edward Hyde become irrevocably\r\nmine. The power of the drug had not been always equally\r\ndisplayed. Once, very early in my career, it had totally failed\r\nme; since then I had been obliged on more than one occasion to\r\ndouble, and once, with infinite risk of death, to treble the\r\namount; and these rare uncertainties had cast hitherto the sole\r\nshadow on my contentment. Now, however, and in the light of that\r\nmorning's accident, I was led to remark that whereas, in the\r\nbeginning, the difficulty had been to throw off the body of\r\nJekyll, it had of late gradually but decidedly transferred itself\r\nto the other side. All things therefore seemed to point to this:\r\nthat I was slowly losing hold of my original and better self, and\r\nbecoming slowly incorporated with my second and worse.\r\n\r\nBetween these two, I now felt I had to choose. My two natures had\r\nmemory in common, but all other faculties were most unequally\r\nshared between them. Jekyll (who was composite) now with the most\r\nsensitive apprehensions, now with a greedy gusto, projected and\r\nshared in the pleasures and adventures of Hyde; but Hyde was\r\nindifferent to Jekyll, or but remembered him as the mountain\r\nbandit remembers the cavern in which he conceals himself from\r\npursuit. Jekyll had more than a father's interest; Hyde\r\n\r\n96)\r\n\r\nhad more than a son's indifference. To cast in my lot with\r\nJekyll, was to die to those appetites which I had long secretly\r\nindulged and had of late begun to pamper. To cast it in with\r\nHyde, was to die to a thousand interests and aspirations, and to\r\nbecome, at a blow and for ever, despised and friendless. The\r\nbargain might appear unequal; but there was still another\r\nconsideration in the scales; for while Jekyll would suffer\r\nsmartingly in the fires of abstinence, Hyde would be not even\r\nconscious of all that he had lost. Strange as my circumstances\r\nwere, the terms of this debate are as old and commonplace as man;\r\nmuch the same inducements and alarms cast the die for any tempted\r\nand trembling sinner; and it fell out with me, as it falls with\r\nso vast a majority of my fellows, that I chose the better part\r\nand was found wanting in the strength to keep to it.\r\n\r\nYes, I preferred the elderly and discontented doctor, surrounded\r\nby friends and cherishing honest hopes; and bade a resolute\r\nfarewell to the liberty, the comparative youth, the light step,\r\nleaping impulses and secret pleasures, that I had enjoyed in the\r\ndisguise of Hyde. I made this choice perhaps with some\r\nunconscious reservation, for I neither gave up the house in Soho,\r\nnor destroyed the clothes of Edward Hyde, which still lay ready\r\nin my cabinet. For two months, however, I was true to my\r\ndetermination; for two months I led a life of such\r\n\r\n97)\r\n\r\nseverity as I had never before attained to, and enjoyed the\r\ncompensations of an approving conscience. But time began at last\r\nto obliterate the freshness of my alarm; the praises of\r\nconscience began to grow into a thing of course; I began to be\r\ntortured with throes and longings, as of Hyde struggling after\r\nfreedom; and at last, in an hour of moral weakness, I once again\r\ncompounded and swallowed the transforming draught.\r\n\r\nI do not suppose that, when a drunkard reasons with himself upon\r\nhis vice, he is once out of five hundred times affected by the\r\ndangers that he runs through his brutish, physical insensibility;\r\nneither had I, long as I had considered my position, made enough\r\nallowance for the complete moral insensibility and insensate\r\nreadiness to evil, which were the leading characters of Edward\r\nHyde. Yet it was by these that I was punished. My devil had been\r\nlong caged, he came out roaring. I was conscious, even when I\r\ntook the draught, of a more unbridled, a more furious propensity\r\nto ill. It must have been this, I suppose, that stirred in my\r\nsoul that tempest of impatience with which I listened to the\r\ncivilities of my unhappy victim; I declare, at least, before God,\r\nno man morally sane could have been guilty of that crime upon so\r\npitiful a provocation; and that I struck in no more reasonable\r\nspirit than that in which a sick child may break a plaything. But\r\nI had voluntarily stripped myself of all those balancing\r\ninstincts\r\n\r\n98)\r\n\r\nby which even the worst of us continues to walk with some degree\r\nof steadiness among temptations; and in my case, to be tempted,\r\nhowever slightly, was to fall.\r\n\r\nInstantly the spirit of hell awoke in me and raged. With a\r\ntransport of glee, I mauled the unresisting body, tasting delight\r\nfrom every blow; and it was not till weariness had begun to\r\nsucceed, that I was suddenly, in the top fit of my delirium,\r\nstruck through the heart by a cold thrill of terror. A mist\r\ndispersed; I saw my life to be forfeit; and fled from the scene\r\nof these excesses, at once glorying and trembling, my lust of\r\nevil gratified and stimulated, my love of life screwed to the\r\ntopmost peg. I ran to the house in Soho, and (to make assurance\r\ndoubly sure) destroyed my papers; thence I set out through the\r\nlamplit streets, in the same divided ecstasy of mind, gloating on\r\nmy crime, light-headedly devising others in the future, and yet\r\nstill hastening and still hearkening in my wake for the steps of\r\nthe avenger. Hyde had a song upon his lips as he compounded the\r\ndraught, and as he drank it, pledged the dead man. The pangs of\r\ntransformation had not done tearing him, before Henry Jekyll,\r\nwith streaming tears of gratitude and remorse, had fallen upon\r\nhis knees and lifted his clasped hands to God. The veil of\r\nself-indulgence was rent from head to foot, I saw my life as a\r\nwhole: I followed it up from the days of childhood, when I had\r\nwalked\r\n\r\n99)\r\n\r\nwith my father's hand, and through the self-denying toils of my\r\nprofessional life, to arrive again and again, with the same sense\r\nof unreality, at the damned horrors of the evening. I could have\r\nscreamed aloud; I sought with tears and prayers to smother down\r\nthe crowd of hideous images and sounds with which my memory\r\nswarmed against me; and still, between the petitions, the ugly\r\nface of my iniquity stared into my soul. As the acuteness of this\r\nremorse began to die away, it was succeeded by a sense of joy.\r\nThe problem of my conduct was solved. Hyde was thenceforth\r\nimpossible; whether I would or not, I was now confined to the\r\nbetter part of my existence; and oh, how I rejoiced to think it!\r\nwith what willing humility, I embraced anew the restrictions of\r\nnatural life! with what sincere renunciation, I locked the door\r\nby which I had so often gone and come, and ground the key under\r\nmy heel!\r\n\r\nThe next day, came the news that the murder had been overlooked,\r\nthat the guilt of Hyde was patent to the world, and that the\r\nvictim was a man high in public estimation. It was not only a\r\ncrime, it had been a tragic folly. I think I was glad to know it;\r\nI think I was glad to have my better impulses thus buttressed and\r\nguarded by the terrors of the scaffold. Jekyll was now my city of\r\nrefuge; let but Hyde peep out an instant, and the hands of all\r\nmen would be raised to take and slay him.\r\n\r\n100)\r\n\r\nI resolved in my future conduct to redeem the past; and I can say\r\nwith honesty that my resolve was fruitful of some good. You know\r\nyourself how earnestly in the last months of last year, I\r\nlaboured to relieve suffering; you know that much was done for\r\nothers, and that the days passed quietly, almost happily for\r\nmyself. Nor can I truly say that I wearied of this beneficent and\r\ninnocent life; I think instead that I daily enjoyed it more\r\ncompletely; but I was still cursed with my duality of purpose;\r\nand as the first edge of my penitence wore off, the lower side of\r\nme, so long indulged, so recently chained down, began to growl\r\nfor licence. Not that I dreamed of resuscitating Hyde; the bare\r\nidea of that would startle me to frenzy: no, it was in my own\r\nperson, that I was once more tempted to trifle with my\r\nconscience; and it was as an ordinary secret sinner, that I at\r\nlast fell before the assaults of temptation.\r\n\r\nThere comes an end to all things; the most capacious measure is\r\nfilled at last; and this brief condescension to evil finally\r\ndestroyed the balance of my soul. And yet I was not alarmed; the\r\nfall seemed natural, like a return to the old days before I had\r\nmade discovery. It was a fine, clear, January day, wet under foot\r\nwhere the frost had melted, but cloudless overhead; and the\r\nRegent's Park was full of winter chirrupings and sweet with\r\nspring odours. I sat in the sun on a bench; the animal within me\r\nlicking the\r\n\r\n101)\r\n\r\nchops of memory; the spiritual side a little drowsed, promising\r\nsubsequent penitence, but not yet moved to begin. After all, I\r\nreflected, I was like my neighbours; and then I smiled, comparing\r\nmyself with other men, comparing my active goodwill with the lazy\r\ncruelty of their neglect. And at the very moment of that\r\nvain-glorious thought, a qualm came over me, a horrid nausea and\r\nthe most deadly shuddering. These passed away, and left me faint;\r\nand then as in its turn the faintness subsided, I began to be\r\naware of a change in the temper of my thoughts, a greater\r\nboldness, a contempt of danger, a solution of the bonds of\r\nobligation. I looked down; my clothes hung formlessly on my\r\nshrunken limbs; the hand that lay on my knee was corded and\r\nhairy. I was once more Edward Hyde. A moment before I had been\r\nsafe of all men's respect, wealthy, beloved--the cloth laying\r\nfor me in the dining-room at home; and now I was the common\r\nquarry of mankind, hunted, houseless, a known murderer, thrall to\r\nthe gallows.\r\n\r\nMy reason wavered, but it did not fail me utterly. I have more\r\nthan once observed that, in my second character, my faculties\r\nseemed sharpened to a point and my spirits more tensely elastic;\r\nthus it came about that, where Jekyll perhaps might have\r\nsuccumbed, Hyde rose to the importance of the moment. My drugs\r\nwere in one of the presses of my cabinet; how was I\r\n\r\n102)\r\n\r\nto reach them? That was the problem that (crushing my temples in\r\nmy hands) I set myself to solve. The laboratory door I had\r\nclosed. If I sought to enter by the house, my own servants would\r\nconsign me to the gallows. I saw I must employ another hand, and\r\nthought of Lanyon. How was he to be reached? how persuaded?\r\nSupposing that I escaped capture in the streets, how was I to\r\nmake my way into his presence? and how should I, an unknown and\r\ndispleasing visitor, prevail on the famous physician to rifle the\r\nstudy of his colleague, Dr. Jekyll? Then I remembered that of my\r\noriginal character, one part remained to me: I could write my own\r\nhand; and once I had conceived that kindling spark, the way that\r\nI must follow became lighted up from end to end.\r\n\r\n Thereupon, I arranged my clothes as best I could, and summoning\r\na passing hansom, drove to an hotel in Portland Street, the name\r\nof which I chanced to remember. At my appearance (which was\r\nindeed comical enough, however tragic a fate these garments\r\ncovered) the driver could not conceal his mirth. I gnashed my\r\nteeth upon him with a gust of devilish fury; and the smile\r\nwithered from his face--happily for him--yet more happily for\r\nmyself, for in another instant I had certainly dragged him from\r\nhis perch. At the inn, as I entered, I looked about me with so\r\nblack a countenance as made the attendants tremble; not a look\r\ndid they exchange in my\r\n\r\n103)\r\n\r\npresence; but obsequiously took my orders, led me to a private\r\nroom, and brought me wherewithal to write. Hyde in danger of his\r\nlife was a creature new to me; shaken with inordinate anger,\r\nstrung to the pitch of murder, lusting to inflict pain. Yet the\r\ncreature was astute; mastered his fury with a great effort of the\r\nwill; composed his two important letters, one to Lanyon and one\r\nto Poole; and that he might receive actual evidence of their\r\nbeing posted, sent them out with directions that they should be\r\nregistered.\r\n\r\nThenceforward, he sat all day over the fire in the private room,\r\ngnawing his nails; there he dined, sitting alone with his fears,\r\nthe waiter visibly quailing before his eye; and thence, when the\r\nnight was fully come, he set forth in the corner of a closed cab,\r\nand was driven to and fro about the streets of the city. He, I\r\nsay--I cannot say, I. That child of Hell had nothing human;\r\nnothing lived in him but fear and hatred. And when at last,\r\nthinking the driver had begun to grow suspicious, he discharged\r\nthe cab and ventured on foot, attired in his misfitting clothes,\r\nan object marked out for observation, into the midst of the\r\nnocturnal passengers, these two base passions raged within him\r\nlike a tempest. He walked fast, hunted by his fears, chattering\r\nto himself, skulking through the less-frequented thoroughfares,\r\ncounting the minutes that still divided him from midnight. Once a\r\n\r\n104)\r\n\r\nwoman spoke to him, offering, I think, a box of lights. He smote\r\nher in the face, and she fled.\r\n\r\nWhen I came to myself at Lanyon's, the horror of my old friend\r\nperhaps affected me somewhat: I do not know; it was at least but\r\na drop in the sea to the abhorrence with which I looked back upon\r\nthese hours. A change had come over me. It was no longer the fear\r\nof the gallows, it was the horror of being Hyde that racked me. I\r\nreceived Lanyon's condemnation partly in a dream; it was partly\r\nin a dream that I came home to my own house and got into bed. I\r\nslept after the prostration of the day, with a stringent and\r\nprofound slumber which not even the nightmares that wrung me\r\ncould avail to break. I awoke in the morning shaken, weakened,\r\nbut refreshed. I still hated and feared the thought of the brute\r\nthat slept within me, and I had not of course forgotten the\r\nappalling dangers of the day before; but I was once more at home,\r\nin my own house and close to my drugs; and gratitude for my\r\nescape shone so strong in my soul that it almost rivalled the\r\nbrightness of hope.\r\n\r\nI was stepping leisurely across the court after breakfast,\r\ndrinking the chill of the air with pleasure, when I was seized\r\nagain with those indescribable sensations that heralded the\r\nchange; and I had but the time to gain the shelter of my cabinet,\r\nbefore I was once again raging and freezing with the passions of\r\nHyde. It took on this occasion a double dose to recall me to\r\n\r\n105)\r\n\r\nmyself; and alas! Six hours after, as I sat looking sadly in the\r\nfire, the pangs returned, and the drug had to be re-administered.\r\nIn short, from that day forth it seemed only by a great effort as\r\nof gymnastics, and only under the immediate stimulation of the\r\ndrug, that I was able to wear the countenance of Jekyll. At all\r\nhours of the day and night, I would be taken with the premonitory\r\nshudder; above all, if I slept, or even dozed for a moment in my\r\nchair, it was always as Hyde that I awakened. Under the strain of\r\nthis continually-impending doom and by the sleeplessness to which\r\nI now condemned myself, ay, even beyond what I had thought\r\npossible to man, I became, in my own person, a creature eaten up\r\nand emptied by fever, languidly weak both in body and mind, and\r\nsolely occupied by one thought: the horror of my other self. But\r\nwhen I slept, or when the virtue of the medicine wore off, I\r\nwould leap almost without transition (for the pangs of\r\ntransformation grew daily less marked) into the possession of a\r\nfancy brimming with images of terror, a soul boiling with\r\ncauseless hatreds, and a body that seemed not strong enough to\r\ncontain the raging energies of life. The powers of Hyde seemed to\r\nhave grown with the sickliness of Jekyll. And certainly the hate\r\nthat now divided them was equal on each side. With Jekyll, it was\r\na thing of vital instinct. He had now seen the full deformity of\r\nthat creature that shared with him some of the phenomena of\r\n\r\n106)\r\n\r\nconsciousness, and was co-heir with him to death: and beyond these\r\nlinks of community, which in themselves made the most poignant\r\npart of his distress, he thought of Hyde, for all his energy of\r\nlife, as of something not only hellish but inorganic. This was the\r\nshocking thing; that the slime of the pit seemed to utter cries\r\nand voices; that the amorphous dust gesticulated and sinned; that\r\nwhat was dead, and had no shape, should usurp the offices of life.\r\nAnd this again, that that insurgent horror was knit to him closer\r\nthan a wife, closer than an eye; lay caged in his flesh, where he\r\nheard it mutter and felt it struggle to be born; and at every hour\r\nof weakness, and in the confidence of slumber, prevailed against\r\nhim and deposed him out of life. The hatred of Hyde for Jekyll,\r\nwas of a different order. His terror of the gallows drove him\r\ncontinually to commit temporary suicide, and return to his\r\nsubordinate station of a part instead of a person; but he loathed\r\nthe necessity, he loathed the despondency into which Jekyll was\r\nnow fallen, and he resented the dislike with which he was himself\r\nregarded. Hence the ape-like tricks that he would play me,\r\nscrawling in my own hand blasphemies on the pages of my books,\r\nburning the letters and destroying the portrait of my father; and\r\nindeed, had it not been for his fear of death, he would long ago\r\nhave ruined himself in order to involve me in the ruin. But his\r\nlove of life is wonderful; I go further: I, who sicken\r\n\r\n107)\r\n\r\nand freeze at the mere thought of him, when I recall the\r\nabjection and passion of this attachment, and when I know how he\r\nfears my power to cut him off by suicide, I find it in my heart\r\nto pity him.\r\n\r\nIt is useless, and the time awfully fails me, to prolong this\r\ndescription; no one has ever suffered such torments, let that\r\nsuffice; and yet even to these, habit brought--no, not\r\nalleviation--but a certain callousness of soul, a certain\r\nacquiescence of despair; and my punishment might have gone on for\r\nyears, but for the last calamity which has now fallen, and which\r\nhas finally severed me from my own face and nature. My provision\r\nof the salt, which had never been renewed since the date of the\r\nfirst experiment, began to run low. I sent out for a fresh\r\nsupply, and mixed the draught; the ebullition followed, and the\r\nfirst change of colour, not the second; I drank it and it was\r\nwithout efficiency. You will learn from Poole how I have had\r\nLondon ransacked; it was in vain; and I am now persuaded that my\r\nfirst supply was impure, and that it was that unknown impurity\r\nwhich lent efficacy to the draught.\r\n\r\nAbout a week has passed, and I am now finishing this statement\r\nunder the influence of the last of the old powders. This, then,\r\nis the last time, short of a miracle, that Henry Jekyll can think\r\nhis own thoughts or see his own face (now how sadly altered!)\r\nin the glass. Nor must I delay\r\n\r\n108)\r\n\r\ntoo long to bring my writing to an end; for if my narrative has\r\nhitherto escaped destruction, it has been by a combination of\r\ngreat prudence and great good luck. Should the throes of change\r\ntake me in the act of writing it, Hyde will tear it in pieces;\r\nbut if some time shall have elapsed after I have laid it by, his\r\nwonderful selfishness and Circumscription to the moment will\r\nprobably save it once again from the action of his ape-like\r\nspite. And indeed the doom that is closing on us both, has\r\nalready changed and crushed him. Half an hour from now, when I\r\nshall again and for ever re-indue that hated personality, I know\r\nhow I shall sit shuddering and weeping in my chair, or continue,\r\nwith the most strained and fear-struck ecstasy of listening, to\r\npace up and down this room (my last earthly refuge) and give ear\r\nto every sound of menace. Will Hyde die upon the scaffold? or\r\nwill he find courage to release himself at the last moment? God\r\nknows; I am careless; this is my true hour of death, and what is\r\nto follow concerns another than myself. Here then, as I lay down\r\nthe pen and proceed to seal up my confession, I bring the life of\r\nthat unhappy Henry Jekyll to an end.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
}