{
    "id": "49",
    "formats": [
        {
            "format": "text/html",
            "fileName": "49.html.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/49.html.noimages",
            "extension": "noimages"
        },
        {
            "format": "application/epub+zip",
            "fileName": "49.epub.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/49.epub.noimages",
            "extension": "noimages"
        },
        {
            "format": "application/zip",
            "fileName": "49/49.zip",
            "filePath": "http://www.gutenberg.org/files/49/49.zip",
            "extension": "zip"
        },
        {
            "format": "text/plain; charset=us-ascii",
            "fileName": "49/49.txt",
            "filePath": "http://www.gutenberg.org/files/49/49.txt",
            "extension": "txt"
        },
        {
            "format": "text/html",
            "fileName": "49.html.images",
            "filePath": "http://www.gutenberg.org/ebooks/49.html.images",
            "extension": "images"
        },
        {
            "format": "application/rdf+xml",
            "fileName": "49.rdf",
            "filePath": "http://www.gutenberg.org/ebooks/49.rdf",
            "extension": "rdf"
        },
        {
            "format": "application/epub+zip",
            "fileName": "49.epub.images",
            "filePath": "http://www.gutenberg.org/ebooks/49.epub.images",
            "extension": "images"
        },
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "49.kindle.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/49.kindle.noimages",
            "extension": "noimages"
        },
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "49.kindle.images",
            "filePath": "http://www.gutenberg.org/ebooks/49.kindle.images",
            "extension": "images"
        },
        {
            "format": "text/plain",
            "fileName": "49.txt.utf-8",
            "filePath": "http://www.gutenberg.org/ebooks/49.txt.utf-8",
            "extension": "utf-8"
        }
    ],
    "languages": [
        "en"
    ],
    "title": [
        "Surfing the Internet: An Introduction\r\nVersion 2.0.2"
    ],
    "author": "Polly, Jean Armour",
    "isTextAvailable": false,
    "issued": "1993-01-01",
    "wordcount": 9873,
    "book": "\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nSurfing the INTERNET:  an Introduction Version 2.0.2     December 15, 1992\r\n\r\nc.  1992 Jean Armour Polly.   Material quoted from other authors was compiled\r\nfrom public Internet posts by those authors.  No copyright claims are made\r\nfor those compiled quotes.   Permission to reprint is granted for nonprofit\r\neducational purposes.  Please let me know if you find this compilation useful.\r\nThis first (much shorter) version of this appeared in the June, 1992 Wilson\r\nLibrary Bulletin.  Please include this entire copyright/copy notice if you\r\nduplicate this document.  Updates may be ftp'd:\r\n\r\nftp nysernet.org (192.77.173.2)\r\nlogin anonymous\r\npassword name@machine.node\r\ncd /pub/resources/guides\r\n\r\nPlease choose the most current version of surfing.the.internet.\r\n\r\nPlease send updates and corrections to:  jpolly@nysernet.org\r\n\r\nToday I'll travel to Minnesota, Texas, California, Cleveland, New Zealand,\r\nSweden, and England.  I'm not frantically packing, and I won't pick up\r\nany frequent flyer mileage.  In fact, I'm sipping cocoa at my Macintosh.\r\nMy trips will be electronic, using the computer on my desk, communications\r\nsoftware, a modem, and a standard phone line.\r\n\r\nI'll be using the Internet, the global network of computers and their\r\ninterconnections, which lets me skip like a stone across oceans and\r\ncontinents and control computers at remote sites.  I haven't \"visited\"\r\nAntarctica yet, but it is only a matter of time before a host computer\r\nbecomes available there!\r\n\r\nThis short, non-technical article is an introduction to Internet\r\ncommunications and how librarians and libraries can benefit from net\r\nconnectivity.  Following will be descriptions of electronic mail,\r\ndiscussion lists, electronic journals and texts, and resources available\r\nto those willing to explore.  Historical details about the building of the\r\nInternet and technical details regarding network speed and bandwidth are\r\noutside the scope of this piece.\r\n\r\n\r\nWhat's Out There Anyway?\r\n\r\nUntil you use a radio receiver, you are unaware of the wealth of\r\nprogramming, music, and information otherwise invisible to you.\r\nComputer networks are much the same.  About one million people\r\nworldwide use the Internet daily.  Information packet traffic\r\nrises by 12% each month.\r\n\r\nAbout 727,000 host computers are connected, according to a January, 1992\r\nreport (Network Working Group  Request for Comments:  1296) by Mark K. Lottor.\r\nSo, what's all the excitement about?  What's zipping around in that fiber\r\nand cable and ether, anyway?\r\n\r\nOn my electronic adventure I browsed the online catalog at the University\r\nLibrary in Liverpool, England, leaving some \"Hi there from Liverpool, New\r\nYork\" mail for the librarian.\r\n\r\nI downloaded some new Macintosh anti-virus software from Stanford's\r\nSUMEX archive.\r\n\r\nThen I checked a few databases for information needed for this article, and\r\nscanned today's news stories.\r\n\r\nI looked at the weather forecast for here in the East and for the San\r\nFrancisco Bay area, forwarding that information to a friend in San Jose\r\nwho would read it when he woke up.  The Internet never closes!\r\n\r\nAfter that I read some electronic mail from other librarians in\r\nIsrael, Korea, England, Australia and all over the U.S.  We're\r\nexchanging information about how to keep viruses off public computers,\r\nhow to network CDROMS, and how to reink inkjet printer cartridges,\r\namong other things.\r\n\r\nI monitor about twelve discussion groups.  Mail sent to the group\r\naddress is distributed to all other \"subscribers\".  It's similar to\r\na round-robin discussion.   These are known variously as mailing lists,\r\ndiscussion groups, reflectors, aliases, or listservs, depending on what\r\ntype they are and how they are driven.   Subscriptions are free.\r\n\r\nOne of these groups allows children and young adults all over the world to\r\ncommunicate with each other.   Kids from Cupertino to Moscow are talking\r\nabout their lives, pets, families, hope and dreams.  It's interesting to see\r\nthat Nintendo is a universal language!\r\n\r\nTeachers exchange lesson plans and bibliographies in another group, and\r\nschools participate in projects like the global market basket survey.\r\nFor this project, students researched what foods a typical family of four\r\nwould buy and prepare over one week's time.  Their results were posted to\r\nthe global project area, where they could be compared with reports from kids\r\nall over North and South America, India, Scandinavia, and Asia.  It opened\r\nup discussions of dietary laws, staple foods, and cultural differences.\r\n\r\nOther lists explore the worlds of library administration, reference,\r\nmystery readers, romance readers, bird-watcher hotlines, cat enthusiasts,\r\nex-Soviet Union watchers, packet radio techies, and thousands more.\r\nThere is even a list to announce the creation of new lists!\r\n\r\n\r\nThe Power of the Net\r\n\r\nA net connection in a school is like having multiple foreign\r\nexchange students in the classroom all the time.  It promotes\r\nactive, participatory learning.  Participating in a discussion\r\ngroup is like being at an ongoing library conference.  All the\r\nexperts are Out There, waiting to be asked.\r\n\r\nWant to buy a CDROM drive? Send one query and \"ask\" the 3,000 folks\r\non PACS-L (Public Access Computer Systems list) for advice.  In a few\r\nhours you'll have personal testimonies on the pros and cons of various\r\nhardware configurations.\r\n\r\nWant to see if any libraries are doing anything with Total Quality Management?\r\nAsk the members of LIBADMIN and you'll have offers of reports, studies,\r\npersonal experiences and more.  How do you cope with budget cuts:  personnel\r\nlayoffs or materials?  Again, LIBADMIN use allows shared advice.\r\n\r\nHere is one story about the power of the net.  At Christmas, an electronic\r\nplea came from Ireland.  \"My daughter believes in Santa Claus,\" it began.\r\n\"And although the `My Little Pony Megan & Sundance' set has not been\r\nmade in three years, she believes Santa will prevail and she will find one\r\nunder her tree.\"  Mom, a university professor, had called the manufacturer\r\nin the US, but none were available.  \"Check around,\" they said, \"maybe\r\nsome yet stand on store shelves.\"  So Mom sent the call out to the net.\r\n\r\nMany readers began a global search for the wily Pony as part of their own\r\nholiday shopping forays.\r\n\r\nSoon, another message came from Dublin.  It seemed that a reader of the\r\noriginal message had a father who was a high-ranking executive in the toy\r\ncompany, and he had managed to acquire said pony where others had failed!\r\n\r\nIt was duly shipped in time to save Santa's reputation.\r\n\r\nPart of the library's mission is to help remove barriers to accessing\r\ninformation, and part of this is removing barriers between people.\r\nOne of the most interesting things about telecommunications is that\r\nit is the Great Equalizer.  It lets all kinds of computers and humans\r\ntalk to each other.  The old barriers of sexism, ageism, and racism\r\nare not present, since you can't see the person to whom you're \"speaking\".\r\nYou get to know the person without preconceived notions about what you\r\nTHINK he is going to say, based on visual prejudices you may have,\r\nno matter how innocent.\r\n\r\nWell, almost without visual prejudice.  Electronic mail is not always an\r\nharmonic convergence of like souls adrift in the cyberspace cosmos:  there\r\nare arguments and tirades (called \"flames\").  Sometimes you get so used to\r\nseeing a frequent poster's electronic signature that you know what he's\r\ngoing to say before he says it!\r\n\r\n\r\nSmileys\r\n\r\nOne problem with written communication is that remarks meant to be humorous\r\nare often lost.  Without the visual body-language clues, some messages may\r\nbe misinterpreted.  So a visual shorthand known as \"smileys\" has been\r\ndeveloped.   There are a hundred or more variations on this theme-\r\n:-)\r\nThat's a little smiley face.  Look at it sideways.   More Smiley info may\r\nbe found via anonymous ftp at  many places, including the following:\r\nftp nic.funet.fi\r\ncd /pub/misc/funnies/smiley.txt\r\n\r\nFTP is introduced later in the text.\r\n\r\nWhat a range of emotions you can show using only keyboard characters.\r\nBesides the smiley face above, you can have :-( if you're sad, or :-<\r\nif you're REALLY upset!  ;-) is one way of showing a wink.   Folks wearing\r\nglasses might look like this online:  %^).\r\n\r\nBut for the most part, the electronic community is willing to help others.\r\nTelecommunications helps us overcome what has been called the tyranny\r\nof distance.  We DO have a global village.\r\n\r\nElectronic Newsletters and Serials\r\n\r\nSubscribing to lists with reckless abandon can clog your mailbox and\r\nprovide a convenient black hole to vacuum up all your spare time.  You\r\nmay be more interested in free subscriptions to compiled documents known\r\nas electronic journals.  These journals are automatically delivered to your\r\nelectronic door.\r\n\r\nThere are a growing number of these.  Some of the best for librarians are\r\nlisted below.  To subscribe to these journals you must know how to send an\r\ninteractive message to another computer.  This information is well-\r\ndocumented in the resources listed at the end of this article.  Telnet and\r\nftp\r\nare introduced further along in this article.\r\n\r\n\r\nALCTS NETWORK NEWS\r\n(Association for Library Collections and Technical Services)\r\n\r\nVarious ALA news, net news, other items of interest to librarians.  Send the\r\nfollowing message to\r\nLISTSERV@UICVM.BITNET\r\nSUBSCRIBE ALCTS First Name Last Name.\r\n\r\n\r\nCurrent Cites\r\n\r\nBibliography of current journal articles relating to computers, networks,\r\ninformation issues, and technology.  Distributed on PACS-L, or connect\r\nremotely via\r\nTELNET to MELVYL.UCOP.EDU (192.35.222.222);\r\nEnter this command at the prompt:  SHOW CURRENT CITES.\r\nFurther information:  David F.  W.  Robison, drobison@library.berkeley.edu.\r\n\r\n\r\nEFFector Online\r\n\r\nThe online newsletter of the Electronic Frontier Foundation.  All the hot\r\nnet issues are covered here:  privacy, freedom, first amendment rights.\r\nJoin EFF to be added to the mailing list or ftp the files yourself from\r\nftp.eff.org (192.88.144.4)\r\nThey are in the /pub/eff and subsequent directories.\r\n\r\n\r\nHot Off the Tree (HOTT)\r\n(Excerpts and Abstracts of Articles about Information Technology)\r\n\r\nTELNET MELVYL.UCOP.EDU (192.35.222.222); Enter command:\r\nSHOW HOTT.  Further information:  Susan Jurist, SJURIST@UCSD.EDU.\r\n\r\n\r\nNetwork News\r\n\r\nAn irreverent compendium of tidbits, resources, and net factoids that is a\r\nmust for true Internet surfers.  To subscribe, send the following message to\r\n\r\nLISTSERV@NDSUVM1.BITNET\r\nSUBSCRIBE NNEWS First Name Last Name.\r\nFor more information:  Dana Noonan at noonan@msus1.msus.edu.\r\n\r\nPublic-Access Computer Systems News\r\nand The Public-Access Computer Systems Review\r\nSent automatically to PACS-L subscribers.   See above.  For a list of back\r\nissue files, send the following message to:\r\nLISTSERV@UHUPVM1.BITNET\r\nINDEX PACS-L\r\n\r\nTo obtain a comprehensive list of electronic serials on all topics, send\r\nthe following commands to:\r\nLISTSERV@UOTTAWA.BITNET\r\nGET EJOURNL1 DIRECTRY\r\nGET EJOURNL2 DIRECTRY\r\nFor further information, contact Michael Strangelove:\r\n441495@ACADVM1.UOTTAWA.CA.\r\n\r\n\r\nRemote Login to Internet Resources:  TELNET\r\n\r\nOne step beyond electronic mail is the ability to control a remote computer\r\nusing TELNET.  This feature lets you virtually teleport anywhere on the\r\nnetwork and use resources located physically at that host.  Further, some\r\nhosts have gateways to other hosts, which have further gateways to still\r\nmore hosts.  How can you be in two places at once?  It sounds more\r\nconfusing than it is.  What resources are available?  Here is a sampling of\r\nsome of the fare awaiting you at several sites:\r\n\r\nCleveland Free-net\r\n\r\nFreenets are the progeny of:\r\nTom Grundner, Director,\r\nCommunity Telecomputing Laboratory\r\nCase Western Reserve University\r\n303 Wickenden Building\r\nCleveland, OH 44106\r\n216/368-2733  FAX:  216/368-5436\r\nInternet:  aa001@cleveland.freenet.edu\r\nBITNET:  aa001%cleveland.freenet.edu@cunyvm\r\nand the folks at:\r\nNational Public Telecomputing Network (NPTN)\r\nBox 1987\r\nCleveland, OH 44106\r\n216/368-2733  FAX:  216/368-5436\r\nInternet:  aa622@cleveland.freenet.edu.\r\n\r\nFree-nets are built around a city metaphor, complete with schools,\r\nhospitals, libraries, courthouses, and other public services.\r\n\r\n\r\nAcademy One recently held an online global simulation of a series of major\r\nspace achievements.  16 schools (from five states and four nations)\r\nparticipated.  Here are several of the descriptions of their projects:\r\n\r\n\"VALKEALA HIGH SCHOOL VALKEALA ELEMENTARY SCHOOL\r\nValkeala, Finland (sa124@cleveland.freenet.edu)\r\nActing as Space Shuttle Discovery taking the Hubble Telescope into space.\r\nThese Finnish students will be in communication with students in Estonia,\r\nrelaying their reports.\"\r\n\r\n\"DR. HOWARD ELEMENTARY SCHOOL Champaign, IL\r\n(cwilliam@mars.ncsa.uiuc.edu, cdouglas@ncsa.uiuc.edu)\r\nDr. Howard School (25 students in 3rd/4th grade) will be simulating the\r\nChallenger 2 launch.   They are being assisted by the National Center for\r\nSupercomputing Applications.\"\r\n\r\n\"ST. JULIE BILLIART SCHOOL Hamilton, OH\r\n(ba542@cleveland.freenet.edu)\r\nSimulating a NASA Tracking Station in Florida.   They will be\r\nposting hourly weather reports about the conditions in Florida\r\naround Cape Kennedy. This information is vital to the recovery\r\nof the Friendship 7 capsule and crew.  Students have taken an\r\ninterest in Space Junk and will be posting additional reports\r\non the various probes which were used to test the surface of\r\nthe moon and how all of that junk is now becoming a hazard to\r\ncurrent and future space exploration.\"\r\n\r\nAnother Free-net resource is Project Hermes.   This service provides\r\ncopies of Supreme Court opinions in electronic form to as wide an\r\naudience as possible, almost as soon as they are announced.\r\n\r\nThe Court's opinions can be sent directly to you or you may download the\r\nfiles directly from any NPTN community computer system.\r\n\r\nThe Free-nets also provide weather, news, and gateways to other resources.\r\nTo access the Cleveland Free-Net (where all this is being held) simply\r\ntelnet to:\r\nfreenet-in-a.cwru.edu 129.22.8.82\r\nor 129.22.8.75\r\nor 129.22.8.76\r\nor 129.22.8.44 and select \"visitor\" at the login menu.\r\n\r\n\r\nMELVYL\r\n\r\nCatalog Division of Library Automation\r\nUniversity of California\r\nOffice of the President\r\n300 Lakeside Drive, 8th floor,\r\nOakland, California 94612-3550\r\n415/987-0555 (MELVYL Catalog Helpline)\r\nE-mail:  lynch@postgres.berkeley.edu\r\n\r\nThe MELVYL catalog is the union catalog of monographs and serials\r\n(periodicals) held by the nine University of California campuses and\r\naffiliated libraries.  It represents nearly 11 million holdings at UC,\r\nthe California State Library, and the Center for Research Libraries.\r\n\r\nThe MELVYL catalog also provides access to MEDLINE and Current\r\nContents as well as a gateway to many other systems.  Access to some\r\ndatabases is restricted under a license agreement to the University of\r\nCalifornia faculty, staff, and students.  Telnet:\r\nMELVYL.UCOP.EDU (192.35.222.222)\r\n\r\n\r\nCARL\r\n\r\nColorado Alliance of Research Libraries\r\n777 Grant\r\nSuite 306\r\nDenver CO 80203-3580\r\n303/861-5319\r\nE-mail:  help@carl.org\r\n\r\nCARL offers access to the following groups of databases:  Academic and\r\npublic library online catalogs, current article indexes such as UnCover\r\nand Magazine Index, databases such as the Academic American Encyclopedia\r\nand Internet Resource Guide, and a gateway to other library systems.\r\nAccess to some items is limited.  Telnet:\r\npac.carl.org (192.54.81.128)\r\n\r\n\r\nMICROMUSE\r\n\r\nThis is how Barry Kort (aka `Moulton'), Visiting Scientist at Educational\r\nTechnology Research, BBN Labs, Cambridge, MA describes MicroMuse at M.I.T.\r\n\r\n\"MUDs (Multi-User Dimensions) or MUSEs (Multi-User Simulation\r\nEnvironments) are virtual realities which offer a rich environment for\r\nsynergy, community, collaboration, and exploratory discovery.\"\r\n\r\n\"Players connect to the host computer, adopt a character and personality of\r\ntheir choosing, and enter into the synthetic world, consisting of a web of\r\nconnected rooms and movable props.\"\r\n\r\n\"Everything (rooms, movable objects, connecting passageways, and\r\nplayers) has a description (typically a few lines of text) which\r\nare displayed when a player looks at it.\"\r\n\r\n\"Actions such as picking up or dropping an object, and exiting to an\r\nadjacent room also generate a short message appropriate to the action.\"\r\n\r\n\"At MIT's AI Lab, MicroMuse features explorations, adventures, and\r\npuzzles with redeeming social, cultural, and educational content.\r\nThe MicroMuse Science Center offers an Exploratorium and Mathematica\r\nExhibit complete with interactive exhibits drawn from experience with\r\nScience Museums around the country.   The Mission to Mars includes an\r\nelaborate tour of the red planet with accurate descriptions rivaling\r\nthose found in National Geographic.\"\r\n\r\n\"Elsewhere on MicroMuse, one can find an outstanding adventure based on the\r\nchildren's classic Narnia; a recreation of the Wizard of Oz adventure built\r\nby a gifted 8-year old; a challenging Logic Quest; and a living model of the\r\nscience fiction genre `The DragonRiders of Pern' by author Anne McCaffrey.\"\r\n\r\nIf you would like to explore MicroMuse, you may connect as follows from\r\nyour local host computer:\r\ntelnet michael.ai.mit.edu [18.43.0.177]\r\nlogin:  guest [no password required]\r\ntt [TinyTalk client program]\r\nconnect guest [Connect to MicroMuse]\r\n\r\nBBS.OIT.UNC.EDU\r\n\r\nTelnet to BBS.OIT.UNC.EDU or 152.2.22.80.\r\nType launch at the login message.\r\nIt's a must.  Not only can you read Usenet Newsfeeds, but you can use\r\nLibTel, a scripted telnet gateway to access both US and international\r\nlibraries plus such things as Data Research Associates Library of Congress\r\ncatalog, the Ham Radio Call Book, the National Science Foundation, the\r\nWeather Server, Webster's dictionary and thesaurus, and more.\r\n\r\n\r\nRemote Access to Files (FTP)\r\n\r\nFTP or File Transfer Protocol is what to use to retrieve a text file,\r\nsoftware, or other item from a remote host.  Normal practice is to ftp\r\nto the host you want and login as \"anonymous\".  Some sites use the\r\npassword \"guest\" while others require that you put in your network\r\naddress as the password.  Some popular ftp sites follow:\r\n\r\n\r\nSUMEX-AIM\r\n\r\nThis archive at Stanford (sumex-aim.stanford.edu or 36.44.0.6) houses a\r\nplethora of Macintosh applications, utilities, graphics and sound files.\r\n\r\n\r\nSIMTEL20\r\n\r\n(simtel20.army.mil or 192.88.110.20) at the White Sands Missile Range in\r\nNew Mexico contains a similar archive software for MS-DOS computers.\r\n\r\nAn FTP visit to the Network Service Center at nnsc.nsf.net (128.89.1.178)\r\nis a gold mine of documents and training materials on net use.  See further\r\ninformation on this in the \"Resources for Learning More\" section of this\r\narticle.\r\n\r\n\r\nProject Gutenberg\r\n\r\nThe primary goal of Project Gutenberg is to encourage the creation and\r\ndistribution of electronic text.   They hope to get ten thousand titles\r\nto one hundred million users for a trillion etexts in distribution by\r\nthe end of 2001.\r\n\r\nSome of the many texts available now include Alice in Wonderland,\r\nPeter Pan, Moby Dick, Paradise Lost and other texts in the public domain.\r\nMany of these texts are availablevia ftp:\r\n\r\nftp mrcnext.cso.uiuc.edu (128.174.201.12)\r\n\r\ncd etext/etext92 [for 1992 releases]  [etext93 is available for testing now]\r\ncd etext/etext91 [for 1991 releases]  [This file should  be in it]\r\ncd etext/articles [for Project Gutenberg articles and newsletters].\r\nMost  are also available from quake.think.com (192.31.181.1); /pub/etext,\r\nfrom simtel20, and from many other sites.\r\n\r\nFor more info try Gopher as in the following section or contact:\r\nMichael S. Hart, Director\r\nProject Gutenberg\r\nNational Clearinghouse for Machine Readable Texts\r\nIllinois Benedictine College\r\n5700 College Road\r\nLisle, Illinois 60532-0900\r\nINTERNET:  dircompg@ux1.cso.uiuc.edu\r\nCompuServe:  >INTERNET:dircompg@ux1.cso.uiuc.edu\r\nAttmail:  internet!ux1.cso.uiuc.edu!dircompg\r\nBITNET:  HART@UIUCVMD\r\n\r\n\r\nTravel Agents:\r\nArchie, Gopher, Veronica, WAIS, Worldwide Web and More\r\n\r\nThere is so much information on the net, it's impossible to know\r\nwhere everything is, or even how to begin looking.  Fortunately,\r\nsome computerized \"agents\" are in development to help sort through\r\nthe massive data libraries on the net.\r\n\r\n\r\nArchie\r\n\r\nPeter Deutsch, of McGill's Computing Centre, describes the archie server\r\nconcept, which allows users to ask a question once yet search many\r\ndifferent hosts for files of interest.\r\n\r\n\"The archie service is a collection of resource discovery tools that together\r\nprovide an electronic directory service for locating information in an\r\nInternet environment.  Originally created to track the contents of\r\nanonymous ftp archive sites, the archie service is now being expanded to\r\ninclude a variety of other online directories and resource listings.\"\r\n\r\n\"Currently, archie tracks the contents of over 800 anonymous FTP archive\r\nsites containing some 1,000,000 files throughout the Internet.  Collectively,\r\nthese files represent well over 50 Gigabytes (50,000,000,000 bytes) of\r\ninformation, with additional information being added daily.  Anonymous ftp\r\narchive sites offer software, data and other information which can be\r\ncopied and used without charge by anyone with connection to the Internet.\"\r\n\r\n\"The archie server automatically updates the listing information from each\r\nsite about once a month, ensuring users that the information they receive\r\nis reasonably timely, without imposing an undue load on the archive sites\r\nor network bandwidth.\"\r\n\r\nUnfortunately the archie server at McGill is currently out of service.\r\nOther sites are:\r\narchie.ans.net (USA [NY])\r\narchie.rutgers.edu (USA [NJ])\r\narchie.sura.net (USA [MD])\r\narchie.funet.fi (Finland/Mainland Europe)\r\narchie.au (Australia/New Zealand)\r\narchie.doc.ic.ac.uk (Great Britain/Ireland)\r\n\r\nMore information avaiable from:\r\nUNIX Support Group\r\nComputing Centre\r\nMcGill University\r\nRoom 200\r\nBurnside Hall\r\n805 Sherbrooke Street West\r\nMontreal, Quebec CANADA H3A 2K6\r\n514/398-3709\r\npeterd@cc.mcgill.ca\r\n\r\n\r\nInternet Gopher\r\nGopher (or go-fer):  someone who fetches necessary items from many locations.\r\n\r\nLogin as gopher after you telnet to consultant.micro.umn.edu and enjoy\r\nhaving a computer do all the work for you.  Almost.  Gopher is still in\r\nexperimental mode at many gopherized sites.  Still, it is one of the best\r\nways to locate information on and in the Internet.\r\n\r\nBesides archie, the gopher at consultant.micro.umn.edu includes fun and\r\ngames, humor, libraries (including reference books such as the Hacker's\r\nDictionary, Roget's 1911 Thesaurus, and the CIA World Fact Book), gateways\r\nto other US and foreign gophers, news, and gateways to other systems.\r\n\r\nVERONICA:  Very Easy Rodent-Oriented Net-wide Index to Computerized Archives.\r\n\r\nVery new on the scene is VERONICA.\r\nHere is some information from Steve Foster about it.\r\n\r\n\"Veronica offers a keyword search of most gopher-server menus in the entire\r\ngopher web.   As Archie is to ftp archives, Veronica is to gopherspace.\r\nUnlike Archie, the search results can connect you directly to the data source.\r\nImagine an Archie search that lets you select the data, not just the host\r\nsites, directly from a menu.   Because Veronica is accessed through a gopher\r\nclient, it is easy to use, and gives access to all types of data supported\r\nby the gopher protocol.\"\r\n\r\n\"Veronica was designed as a response to the problem of resource discovery\r\nin the rapidly-expanding gopher web.  Frustrated comments in the net news-\r\ngroups have recently reflected the need for such a service.  Additional\r\nmotivation came from the comments of naive gopher users, several of\r\nwhom assumed that a simple-touse service would provide a means to find\r\nresources `without having to know where they are.'\"\r\n\r\n\"The result of a Veronica search is an automatically-generated gopher\r\nmenu, customized according to the user's keyword specification.  Items on\r\nthis menu may be drawn from many gopher servers.   These are functional\r\ngopher items, immediately accessible via the gopher client   just double-\r\nclick to open directories, read files, or perform other searches -- across\r\nhundreds of gopher servers.  You need never know which server is actually\r\ninvolved in filling your request for information.  Items that are appear\r\nparticularly interesting can be saved in the user's bookmark list.\"\r\n\r\n\"Notice that these are NOT full-text searches of data at gopher-server sites,\r\njust as Archie does not index the contents of ftp sites, but only the names of\r\nfiles at those sites.   Veronica indexes the TITLES on all levels of the\r\nmenus, for most gopher sites in the Internet.   258 gophers are indexed by\r\nVeronica on Nov. 17, 1992; we have discovered over 500 servers and will\r\nindex the full set in the near future.  We hope that Veronica will encourage\r\ngopher administrators to use very descriptive titles on their menus.\"\r\n\r\n\"To try Veronica, select it from the `Other Gophers' menu on Minnesota's\r\ngopher server (consultant.micro.umn.edu), or point your gopher at:\r\nName=Veronica (search menu items in most of GopherSpace)\r\nType=1\r\nPort=70\r\nPath=1/Veronica Host=futique.scs.unr.edu\"\r\n\r\n\"Veronica is an experimental service, developed by Steve Foster and\r\nFred Barrie at University of Nevada.   As we expect that the load will\r\nsoon outgrow our hardware, we will distribute the Veronica service\r\nacross other sites in the near future.\"\r\n\r\n\"Please address comments to:  gophadm@futique.scs.unr.edu\"\r\n\r\nIs this the new world order of automated librarianship?\r\n\r\n\r\nWAIS\r\n\r\nWide Area Information Servers (pronounced ways) allows users to\r\nget information from a variety of hosts by means of a \"client\".\r\nThe user tells the client, in plain English, what to look for\r\nout in dataspace.  The client then searches various WAIS servers\r\naround the globe.  The user tells the client how relevant each hit is,\r\nand the client can be sent out on the same quest again and again to\r\nfind new documents.  Client software is available for many different\r\ntypes of computers.\r\n\r\nWAIStation is an easy to use Macintosh implementation of a WAIS client.\r\nIt can be downloaded from think.com as well as a self-running MediaTracks\r\ndemo of WAIStation in action.  Kahle also moderates a thoughtful WAIS\r\nnewsletter and discussion group, often speculating about the future of\r\nlibraries and librarians.\r\n\r\nInfo from:  Brewster Kahle, Project Leader\r\nWide Area Information Servers\r\nThinking Machines Corporation\r\n1010 El Camino Real\r\nMenlo Park, CA 94025\r\n415/329-9300 x228\r\nbrewster@Think.COM\r\n\r\n\r\nWorldWideWeb\r\n\r\nTim Berners-Lee describes the Web this way:  \"The WWW project merges\r\nthe techniques of information retrieval and hypertext to make an easy but\r\npowerful global information system.  The WWW world consists of documents,\r\nand links.   Indexes are special documents which, rather than being read,\r\nmay be searched.   The result of such a search is another (`virtual')\r\ndocument containing links to the documents found.   The Web contains\r\ndocuments in many formats.  Those documents which are hypertext,\r\n(real or virtual) contain links to other documents, or places\r\nwithin documents.  All documents, whether real, virtual or indexes, look\r\nsimilar to the reader and are contained within the same addressing scheme.\r\nTo follow a link, a reader clicks with a mouse (or types in a number if\r\nhe or she has no mouse).  To search and index, a reader gives keywords\r\n(or other search criteria).  These are the only operations necessary to\r\naccess the entire world of data.\"\r\n\r\nInfo from:  Tim Berners-Lee\r\nWorldWideWeb project\r\nCERN\r\n1211 Geneva 23, Switzerland\r\nTel:  +41(22)767 3755  FAX:+41(22)767 7155\r\nemail:tbl@cernvax.cern.ch\r\n\r\nHytelnet\r\n\r\nPeter Scott, the creator of HYTELNET, sends this recent update:\r\n\"HYTELNET version 6.3, the utility which gives an IBM-PC user instant-\r\naccess to all Internetaccessible library catalogs, FREE-NETS, CWISs,\r\nBBSs, Gophers, WAIS, etc.  is now available.  You can get it via anonymous\r\nftp from:  access.usask.ca in the pub/hytelnet/pc subdirectory.  It is\r\nlisted as HYTELN63.ZIP.\"\r\n\r\n\"Version 6.3 is a major upgrade.  Much redundant information has been\r\ndeleted, and errors have been corrected.  New subdirectories have been\r\nadded, which has meant that many files now have a more meaningful home.\r\nAlso all the new/updated files created since Version 6.2 were incorporated.\"\r\n\r\n\"Note:  the UNZIPPED files total over 1.2 mb but remember, you can always\r\nedit out any information you do not need, in order to save space.\r\nInformation from Roy Tennant follows, slightly edited, describing how to\r\nobtain HYTELNET 6.3 from the ftp site (thanks Roy)::\"\r\n\r\n\"TO RETRIEVE HYTELNET:\r\nAt your system prompt, enter:\r\nftp access.usask.ca or ftp 128.233.3.1\r\nWhen you receive the Name prompt, enter:  anonymous\r\nWhen you receive the password prompt, enter: your Internet address.\r\nWhen you are at the ftp> prompt, enter:  binary\r\nAt the next ftp> prompt, enter:   cd pub/hytelnet/pc\r\nThen enter:  get hyteln63.zip\r\n\r\nAfter the transfer has occurred, either proceed with the instructions\r\nbelow to retrieve the UNZIP utility (which you need unless you already\r\nhave it) or enter:  quit\r\n\r\nThe Hytelnet program is archived using a ZIP utility.  To unarchive it,\r\nyou must be able to \"unzip\" the file.   If you have the file PKUNZIP.EXE,\r\nit will unarchive the HYTELN63.ZIP file (see below for instructions).\r\nIf you do not have it, you may retrieve it by following these instructions:\r\n\r\nTO RETRIEVE PKUNZIP:\r\nUse the above instructions for connecting to:\r\naccess.usask.ca At the ftp> prompt, enter:  binary\r\nThen enter:  cd pub/hytelnet/pc\r\nThen enter:  get pkunzip.exe\r\nAfter the transfer has occurred, enter:  quit\r\n\r\nTO DOWNLOAD IT TO YOUR PC:\r\nBecause of the plethora of PC communications programs, I will not attempt\r\nto give step-by-step instructions here.  You should check the instructions\r\nfor your software for downloading a *binary* file from your Internet account\r\nto your PC.\r\n\r\nTO UNARCHIVE HYTELN63.ZIP:\r\nMake a new directory on your hard disk (e.g., mkdir hytelnet) Copy\r\nPKUNZIP.EXE and HYTELN63.ZIP into the new directory Make sure you\r\nare in that directory, then enter:  pkunzip HYTELN63 It will then\r\nunarchive HYTELN63.ZIP, which contains the following files:  HYTELNET.ZIP\r\nREADNOW.  The file READNOW gives full instructions for un-archiving\r\nHYTELNET.ZIP.   Simply put, you **MUST** unZIP the file with the -d\r\nparameter so that all the subdirectories will be recursed.\r\n\r\nTo use HYTELNET, you should refer to the instructions in the release\r\nannouncement by Peter Scott, or to the README file included with the package.\"\r\n\r\n\"PLEASE NOTE that I offer the above instructions as a service for those\r\nwho are unfamiliar with the steps required to download and use files from\r\nnetwork sources.   I cannot be responsible for any local variations in these\r\nprocedures which may exist.   Please contact your local computer support\r\nstaff if you have difficulty performing these tasks.\"\r\n\r\n\"The UNIX/VMS version, created by Earl Fogel, is available for browsing\r\nby telnet to access.usask.ca   login with   hytelnet (lower case).\r\nFor more information on this version contact Earl at:  fogel@skyfox.usask.ca.\"\r\n\r\n\r\n\r\nHow to Get Connected\r\n\r\nNow that you're interested in what resources are available, how does one go\r\nabout getting connected?  Time was that you needed a standard, dedicated\r\nconnection to the Internet.  Then you needed a robust computer system and\r\na couple of zany gurus to keep it all running.  And once a year you could\r\nexpect an invoice in the $30,000 range to keep the data flowing.\r\n\r\nThese days, anyone can connect, from small libraries and non-profits to\r\nindividuals.  (and of course commercial-mh)  And the prices are affordable.\r\n\r\nThere is a NSFNet acceptable-use policy you must agree to adhere to\r\nif your traffic passes through NSFNet.  It is available from the NSF\r\nNetwork Service Center.\r\n\r\nContact your regional network first to see what services might be available\r\nto you.   A list of regional nets can be obtained from the NSF Network\r\nService Center (address below), or check with a local college or\r\nuniversity's academic computing center.  A university may be able to give\r\nyou a guest account on its system for educational purposes.\r\n\r\nAccess to electronic mail alone is roughly $20 a month at this writing.\r\nAdditional capabilities, including telnet and ftp, cost more, and it will\r\ncost $2,000 or more per year if you want to operate your own host system.\r\nThe good news is that the costs are spiraling downwards.  Here are a few other\r\nmethods of connecting to the net.  Many more are listed in the \"must-have\"\r\nbooks at the end of this article.\r\n\r\nCERFnet\r\nThe California Education and Research Federation (CERFnet) has announced\r\nDIAL N' CERF USA.  It allows educators, scientists, corporations, and\r\nindividuals access to the Internet from anywhere in the continental US.\r\n\r\nA toll-free number, 1-800-7CERFNET (1-800-723-7363), provides subscribers\r\nwith the capability to log in to remote machines, transfer files, and send\r\nand receive electronic mail, as if they had a standard, dedicated connection.\r\nThe cost of this toll-free connection is $20 a month with a $10 per hour\r\nusage fee and free installation.   There is an installation charge of $50.\r\n\r\nCERFnet\r\nCalifornia Education and Research Federation\r\nc/o San Diego Supercomputer Center\r\nP.O. Box 85608\r\nSan Diego, CA 92186-9784\r\n800/876-CERF or 619/534-5087\r\nhelp@cerf.net\r\n\r\n\r\nPerformance Systems International\r\n\r\nPSI offers several permutations of network connectivity, including low-end\r\nemail-only accounts, dial-up host connectivity on demand, and dedicated\r\nconnections.  Costs are competitive and performance is reliable.  PSI has\r\nPOPs (points of presence) in over forty U.S. cities.\r\n\r\nPSILink, email and delayed ftp, is $19 a month for 2400 baud service or\r\nbelow, $29 per month for 9600 baud service.\r\n\r\nGDS (Global Dialup Service) includes telnet, rlogins at $39 a month,\r\n2400 baud, 24 hour access.\r\n\r\nHost DCS (Dialup Connection Service), at about $2000 per year,\r\nincludes a full suite of internet activities (mail, news, ftp, telnet).\r\n\r\nPerformance Systems International, Inc.\r\n11800 Sunrise Valley Dr.  Suite 1100\r\nReston, VA 22091\r\n800/82PSI82 or 703/620-6651 FAX:  703/620-4586\r\ninfo@psi.com.  All-info@psi.com generates an automatic reply response\r\ncontaining summaries of various PSI products.\r\n\r\n\r\nSoftware Tool & Die\r\n\r\nSoftware Tool & Die offers The World, a public access Unix system:\r\nThe basic rates are $2 per hour and a $5 monthly account fee.\r\nServices offered by The World include internet electronic mail,\r\nUSENET news, ClariNet -UPI, AP, and satellite news services,\r\nreal-time chat, Unix Software, Archie, the Online Book Initiative\r\n(a publicly accessible repository for freely redistributable\r\ncollections of textual information, a net-worker's library.)\r\nAlterNet Access - Users have access to AlterNet via ftp/telnet.\r\nThe World can also be accessed over the Compuserve Packet Network.\r\nYou do not have to be a Compuserve subscriber to use this network,\r\nbut you will be billed for its use.\r\n\r\nThe WORLD\r\nSoftware Tool & Die\r\n1330 Beacon Street\r\nBrookline, MA  02146\r\n617/39-0202\r\n\r\nDaniel Dern also provides the following definitive information file on\r\nhow to get connected:\r\nDaniel Dern's Short Answer to \"How do I get a list of Internet\r\nService/Access Providers for Individual Accounts\":\r\n\r\nFor a list of Internet Service Providers contact:\r\n\r\nNSF Network Service Center (NNSC)\r\nBBN Laboratories Inc.\r\n10 Moulton St.\r\nCambridge, MA 02238\r\n617/873-3361\r\nnnsc@nnsc.nsf.net\r\n\r\nThe NNSC info-server utility can also automatically e-mail you a copy of\r\nthis list and other documents.   Simply send an e-mail message to:\r\ninfo-server@nnsc.nsf.net\r\n\r\nwith the following text in the body:\r\n\r\nrequest:  nsfnet\r\ntopic:  <topic-here>\r\ntopic:  <topic-here>\r\nrequest:  end\r\n\r\nYou don't need to put anything in the subject line.\r\n\r\n\"referral-list\" gets you the NNSC's referral list of Internet Service\r\nProviders based in the U.S.  (possibly providing international service).\r\nThis is generally agreed to be the most comprehensive and least-biased list.\r\n\"limited-referral\" gets you the NNSC's referral list of Internet providers\r\nfor \"limited service,\" which includes Dial-Up IP, Internet E-mail.\r\n\r\n\"help\" (recommended) gets you the Help document for the info-server facility.\r\n\r\nFor a list of dial-up-accessible Public-Access Internet Hosts (Unix BBSs\r\nthat can do telnet, ftp, etc., that can you can access by calling from\r\nyour PC and modem), see the PDIAL list, maintained by Peter Kaminski.\r\nKaminski periodically posts an updated version to the usenet groups\r\nalt.bbs.lists and alt.bbs.internet; also, the most recent edition may\r\nbe obtained by sending e-mail to:\r\nkaminski@netcom.com\r\nwith the\r\n`Send PDIAL'\r\n\r\nin the subject.   To be placed on a list to receive future editions\r\nautomatically, send e-mail to:\r\nkaminski@netcom.com with `Subscribe PDIAL' in the subject.\r\n\r\nThe `nixpub' list is a frequently updated list of Public-Access unix\r\nSystems -Unix-based BBSs usually carrying usenet news, supporting e-mail\r\nconnectivity to the Internet, and with some mix of local archives, multi-\r\nuser games, etc.   The full list is long (over 1,000 lines).   To get a\r\ncurrent copy of `nixpub' as an automatic e-mail reply, Send a message to\r\n`nixpub@digex.com' (no subject or message text needed), or to\r\n`archive-server@cs.widener.edu' with message body of one of these:\r\n\r\nsend nixpub long\r\nsend nixpub short\r\nsend nixpub long short\r\nindex nixpub\r\n\r\nThe nixpub and nixpub.short lists are regularly reposted to the USENET\r\ncomp.misc and alt.bbs groups\r\n\r\nInfo from:  Daniel P. Dern Free-lance technology writer\r\nP.O.  Box 309\r\nNewton Centre, MA 02159\r\n617/969-7947  FAX:  617/969-7949\r\nddern@world.std.com\r\n\r\n\r\nResources for Learning More\r\n\r\n\r\nCERFnet Network Information Center (NIC)\r\n\r\nThis is a repository for many eclectic internet guides and RFC (Requests\r\nFor Comments) from many sources, including the famous, if technical\r\n\"Hitchhiker's Guide to the Internet.\"  These may be obtained via anonymous\r\nftp to nic.cerf.net (192.102.249.3).\r\nCall the CERFnet Hotline at 800-876-CERF for assistance.\r\nCalifornia Education and Research Federation\r\nc/o San Diego Supercomputer Center\r\nP.  O.  Box 85608\r\nSan Diego, CA 92186- 9784\r\n800/876-CERF or 619/534-5087\r\nhelp@cerf.net\r\n\r\n\r\nCICNet Resource Guide\r\n\r\nOver 200 pages of Internet resources, published June, 1992.  Copies are\r\n$27.00 from CICNet, Inc.\r\nAttn Kim Schaffer\r\n2901 Hubbard Pod A\r\nAnn Arbor, MI 48109.\r\n313/998-6103  FAX 313/998-6105\r\ninfo@cic.net\r\n\r\n\r\n\"The December Lists\"\r\n\r\n\"Information Sources:   the Internet and Computer-Mediated Communication\"\r\nCompiled by John December (decemj@rpi.edu)\r\nHere is part of his information file on this excellent resource:\r\n\r\n\"This document or updates are available via anonymous ftp.\r\nHost:  ftp.rpi.edu\r\nfile:  /pub/communications/internet-cmc\r\n\r\nPURPOSE:   to list pointers to information describing the Internet,\r\ncomputer networks, and issues related to computer- mediated\r\ncommunication (CMC).   Topics of interest include the technical, social,\r\ncognitive, and psychological aspects of CMC.\r\n\r\nAUDIENCE:   this file is useful for those getting started in understanding\r\nthe Internet and CMC; it compactly summarizes sources of information for\r\nthose who are already exploring these issues.\r\n\r\nASSUMPTIONS:   to access many information sources listed here you must\r\nhave access to and know how to use anonymous ftp, email, or  USENET\r\nnewsgroups.   Some files are in TeX or PostScript format.\r\n\r\nContents:\r\nSection -1- THE INTERNET AND SERVICES\r\nSection -2- INFORMATION SERVICES/ELECTRONIC PUBLICATIONS\r\nSection -3- SOCIETIES AND ORGANIZATIONS\r\nSection -4- NEWSGROUPS\r\nSection -5- SELECTED BIBLIOGRAPHY\"\r\n\r\n\r\n\"Emily Postnews Answers Your Questions on Netiquette\"\r\n\r\nBrad Templeton's (brad@looking.on.ca) satirical and hilarious piece on\r\nhow NOT to behave on the net.  Emily Postnews, foremost authority on\r\nproper net behaviour, gives her advice.  There are many places to ftp this\r\nfile, and it is appearing on many gophers.  One place to get the file is by\r\nftp to ra.msstate.edu (130.18.80.10)\r\nLocation:  /pub/docs/words- l/Funnies\r\n\r\nThe file is called emily.postnews.  Here is a sample:\r\n\r\n\"Dear Miss Postnews:\r\nHow long should my signature be?\r\n-- verbose@noisy\r\n\r\nA:  Dear Verbose:\r\nPlease try and make your signature as long as you can.   It's much more\r\nimportant than your article, of course, so try to have more lines of\r\nsignature than actual text.   Try to include a large graphic made of\r\nASCII characters, plus lots of cute quotes and slogans.   People will\r\nnever tire of reading these pearls of wisdom again and again, and you\r\nwill soon become personally associated with the joy each reader feels\r\nat seeing yet another delightful repeat of your signature.  Be sure\r\nas well to include a complete map of USENET with each signature, to\r\nshow how anybody can get mail to you from any site in the world.\r\nBe sure to include Internet gateways as well.  Also tell people\r\non your own site how to mail to you.   Give independent addresses\r\nfor Internet, UUCP, and BITNET, even if they're all the same.\"\r\n\r\n\r\n\"Incomplete Guide to the Internet\"\r\n\r\nThe \"Incomplete Guide\" was compiled by the NCSA Education Group,\r\ndated September, 1992.  It is also available for anonymous FTP at:\r\n\r\nftp.ncsa.uiuc.edu in the /misc directory\r\n\r\nThis excellent manual is a must.\r\nIt even covers SLIP connections and use of Eudora.\r\n\r\nHere are some comments about it from cfarmer@ncsa.uiuc.EDU (Chuck Farmer):\r\n\"The first half of the text is devoted to the mechanics of telecommunications,\r\nhow to connect, what to do once you are connected, etc.  The second half of\r\nthe manual is devoted to current telecommunications projects, past successful\r\nprojects, and resources.  The resources include FTP sites, open BBS's and\r\nnetworks, Free-Nets, subscription services, and where to get more information\r\non each resource.  This resource was complied by the Living Lab program\r\n(NSF funded) at NCSA as an attempt to encourage the proliferation of HPCC\r\nuse in the K-12 classroom.  We welcome your comments and suggestions.\r\n\r\nFor further information:\r\nNational Center for Supercomputing Applications\r\n605 E Springfield Ave.\r\nChampaign, IL 61820\r\n217/244-6122\r\n\r\n\r\n\"Library Resources on the Internet:\r\nStrategies for Selection and Use\" 1992.\r\nRASD Occasional Paper no. 12, selling for $18 to members,\r\n$20 for nonmembers.  It can be ordered from:\r\nALA Order Services\r\n50 E.  Huron\r\nChicago, IL 60611,\r\n800/545-2433\r\n\r\nElectronic versions available via FTP\r\nASCII file from:\r\nhost DLA.UCOP.EDU (128.48.108.25)\r\ndirectory /pub/internet/Libcat-guide\r\n\r\nhost FTP.UNT.EDU (129.120.1.1)\r\ndirectory /pub/library/libcat-guide\r\n\r\nWordPerfect 5.1 file from:\r\nhost HYDRA.UWO.CA (129.100.2.13)\r\ndirectory libsoft/internet.com\r\n\r\nMerit's Cruise of the Internet\r\n\r\nThis attractive overview looks great on a Macintosh.\r\nI have not seen the Windows version.\r\n\r\nFrom the README text:  \"Merit's `Cruise of the Internet' is a computer-\r\nbased tutorial for new as well as experienced Internet `navigators.'\r\nThe Cruise will introduce you to Internet resources as diverse as\r\nsupercomputing, minorities, multimedia, and even cooking.  It will also\r\nprovide information about the tools needed to access those resources.\"\r\n\r\nftp to NIC.MERIT.EDU /internet/resources.  There are Macintosh and\r\nWindows versions, and README text files to explain installation procedures.\r\n\r\nA Cruise of the Internet\r\nVersion 2.01 for Apple Macintosh computers\r\nDecember 1, 1992\r\n\r\nSYSTEM REQUIREMENTS\r\nThis tutorial will run on any color Macintosh which is capable of\r\ndisplaying 256 colors.\r\n\r\nTo run the Cruise tutorial you will need:\r\n\r\n- A Macintosh II, LC or Quadra series computer\r\n- 8-bit color and any color monitor  (12\" minimum)\r\n- System 6.05 or 7.x\r\n- Approximately 3 MB of disk space\r\n- 4 MB RAM is recommended\r\n- Internet connectivity and software that does file transfers via FTP.\r\n\r\nA Cruise of the Internet\r\nVersion 2.0 for IBM-DOS and DOS compatibles running Windows\r\nOctober 28, 1992\r\n\r\nSYSTEM REQUIREMENTS:\r\nThis tutorial will run on any IBM-DOS or DOS-compatible computer\r\nwhich is equipped to display 256 colors at an aspect ratio of 640 x 480.\r\n\r\nTo run the Cruise tutorial you will need:\r\n\r\n    - An IBM-DOS or DOS-compatible computer\r\n- XGA- or XGA-compatible adapter set to display 256 colors at 640 x 480\r\n- Microsoft Windows(TM) version 3.1\r\n- Approximately 1.5 MB of disk space\r\n- 2 MB RAM minimum\r\n- Internet connectivity and software that does file transfers via FTP.\r\n\r\n\r\n\"Mining the Internet\"\r\n\r\nThe Net as mine metaphor is a popular theme.  Tunneling through the\r\nnetwork matrix in search of gems and ore is not far from fact.\r\nSometimes it is hard work, and a lot of it is working in the dark.\r\n\r\nThere is a guidebook called \"Mining the Internet\", available from\r\nUniversity of California at Davis.  Here is how the Gold Country Mining\r\n\r\nInstructions begin:\r\n\"Jist durn tuckered o' workin' eight t' five for a salary.  ain't you?\r\nAn' you wanna set out for parts unknown.  You're hankerin' for an a'venture.\r\nCome'n then go `Mining the Internet'  with me, father of Clementine\r\n(that's my darlin'), and I'll tell you some old timey tales and\r\nintroduce you to a new resource for students, faculty, and staff called\r\nwide area networking 'Taint goin' to hurt you any, and the prospect looks\r\ngood for a lucky strike.\"\r\n\r\n\"Mining the Internet\" and \"Using the Internet A&B\" available from:\r\nComputing Services\r\nUniversity of California\r\nDavis, CA 95616-8563\r\n916/752-0233.\r\nOr electronically by anonymous ftp from\r\nucdavis.edu (128.120.2.1)\r\ndirectory /ucd.netdocs/mining\r\n\r\n\r\nNSF Network Service Center (NNSC)\r\n\r\nNSF Internet Tour HyperCard Stack--borrow a Macintosh long enough\r\nto view this, worth the effort! Includes net history, net maps,\r\nnet poetry and lore.  Free.\r\n\r\nThey also publish a very complete Internet Resource Guide ($15).\r\nMany items, including the HyperCard Tour to the Internet, freely\r\navailable by anonymous\r\nftp from nnsc.nsf.net\r\n\r\nNNSC\r\nBolt Beranek and Newman Inc.\r\n10 Moulton Street, Cambridge, MA  02138\r\n617/873-3400\r\nnnsc@nnsc.nsf.net\r\n\r\n\r\nNew User's Guide to Unique and Interesting Resources on the Internet 2.2.\r\n\r\nAvailable from NYSERNet (New York State Education and Research Network).\r\nIt is over 145 pages and lists some 50 sources.  OPACS, databases,\r\ninformation resources, and more.  The New User's Guide is available\r\nin hard copy at the cost of $25.00.  (NYSERNet Members: $18.00)\r\nIt is available electronically at\r\nnysernet.org (192.77.173.2)\r\nin the directory\r\n/pub/resources/guides\r\n\r\nIt is called the new.user.guide.v2.2.txt\r\n\r\nFor more information:\r\nNYSERNet, Inc.\r\n111 College Pl.\r\nSyracuse, NY 13244-4100\r\n315/443-4120  FAX 315/425-7518\r\ninfo@nysernet.org\r\n\r\n\r\nNorthWestNet User Services Internet Resource Guide\r\n\r\nNorthWestNet has released a 300-page guide to the Internet, covering\r\nelectronic mail, file transfer, remote login, discussion groups,\r\nonline library catalogues, and supercomputer access.\r\n\r\nCopies may be purchased for $20.00 from NorthWestNet.\r\nIt is also available via anonymous ftp:\r\nftphost.nwnet.net\r\nin the directory\r\n/nic/nwnet/user-guide\r\n\r\nNorthWestNet\r\n15400 SE 30th Place, Suite 202,\r\nBellevue, WA  98007\r\n206/562-3000 FAX:  206/562-4822\r\n\r\n\r\n\"There's Gold in Them Thar Networks! or Searching for Gold in all the\r\nWrong Places\" written by Jerry Martin at Ohio State University.  This\r\ndocument is available via Internet message to Infoserver@nnsc.nsf.net.\r\nOnce inside the message area, give the following commands to retrieve the\r\ndocument:  REQUEST:NSFNET\r\nTOPIC:NETWORK-TREASURES\r\nREQUEST:  END\r\n\r\n\r\n\"The Yanoff Lists\"\r\n\r\n\"Special Internet Connections\"  Compiled by Scott Yanoff.\r\nThis is an indispensable weekly list of network resources\r\navailable using telnet and ftp.\r\n\r\nIt includes a few Online Public Access Catalogs, chat lines, weather\r\nservers, Campus Wide Information Systems, and reference resources.\r\nSend e-mail to the list manager (Scott Yanoff) at:\r\nyanoff@csd4.csd.uwm.edu\r\nor\r\nftp to csd4.csd.uwm.edu\r\nThe filename is inet-services.\r\n\r\n\r\nHow to Find out More About Discussion Lists\r\n\r\nThousands of discussion groups, LISTSERVs, and mail reflectors exist on\r\nthe Internet.  Here are several ways to find lists of interest to you.\r\n\r\nLISTSERVs available from NYSERNet.org\r\nNysernet.org hosts over 20 lists, including folk_music and PUBLIB for\r\npublic librarians.  Send a LIST GLOBAL command in an interactive\r\nmessage to our host.   For example:\r\n\r\nTo:  LISTSERV@nysernet.org\r\nSubject:\r\nMessage:  LIST GLOBAL\r\n\r\nThe SRI NIC Maintained Interest-Groups List of Lists\r\nThis is available by FTP from ftp.nisc.sri.com  (192.33.33.22) in the\r\ndirectory /netinfo/interest-groups.\r\n\r\nThe SRI NIC list-of-lists is also available via electronic mail.  Send a\r\nmessage to mail-server@nisc.sri.com with the following line in the\r\nmessage body:\r\nSend netinfo/interest-groups\r\nExample:\r\nTo:  mail-server@nisc.sri.com\r\nSubject:\r\nMessage:  Send netinfo/interest-groups\r\n\r\n\r\nThe List of Lists\r\n\r\nA comprehensive list-of-lists can be obtained from some larger host\r\ncomputers running LISTSERV software, by sending a LIST GLOBAL command\r\nin an interactive message.  This will return a \"one line per list\"\r\nlist of all lists known to that host as of that date.\r\nFor example:\r\nTo:  LISTSERV@VM1.NoDak.EDU mail\r\nSubject:\r\nMessage:  LIST GLOBAL\r\n\r\nThe global list can also be searched online.\r\nFor details send LISTSERV the command INFO DATABASE\r\n\r\n\r\nNetwork Accessible Database Server\r\n\r\nOnly available on the LISTSERV@VM1.NoDak.EDU is a searchable interest\r\ngroups database.   For example, to search of the databases for lists\r\non \"cats\" you would send the following statements (copy them exactly into\r\nyour mail message to the LISTSERV):\r\n\r\n//DBlook   JOB   Echo=No\r\nDatabase Search DD=Rules\r\n//Rules DD *\r\nSelect cats in lists\r\nindex\r\nSelect cats in intgroup\r\nindex\r\nSelect cats in new-list\r\nindex\r\n\r\nThese statements search the global LISTSERV list of lists (\"in lists\"),\r\nand the local copy of the SRI-NIC Interest Groups (\"in intgroup\"), and\r\nthe archives of the \"new-list\" list (\"in new-list\").   Send LISTSERV the\r\ncommand INFO DATABASE for more information.\r\n\r\n\r\nThe 5th Revision of the Directory of Scholarly Electronic Conferences\r\n\r\nThis resource is available at LISTSERV@KENTVM or\r\nLISTSERV@KENTVM.KENT.EDU and via anonymous FTP to\r\nksuvxa.kent.edu\r\nin the\r\nlibrary\r\ndirectory.\r\n\r\nThis announcement is extracted from the ACADLIST README FILE\r\n\r\n\"This directory contains descriptions of 805 electronic conferences\r\n(econferences) on topics of interest to scholars.   E- conference is the\r\numbrella term that includes discussion lists, interest groups, e-journals,\r\ne-newsletters, Usenet newsgroups, forums, etc.   We have used our own\r\njudgment in deciding what is of scholarly interest -- and accept any advice\r\nor argument about our decisions.   We have placed the entries into\r\ncategories by deciding what the *dominant* academic subject area of the\r\nelectronic conference is.\"\r\n\r\n\"The 5th Revision involves an attempt to make it easier to feed the\r\nDirectory into HyperCard(TM), dBase(TM) and other database programs.\r\nThe first step in this effort has been to use field labels for each part of\r\neach record.   We've also reduced the size of each record by trying to keep\r\ntopic information between 25-50 words (some are still bigger).  Advice on\r\nthis topic will be gratefully accepted at dkovacs@kentvm.kent.edu.\"\r\n\r\n\"In addition, information about editorial policy and archive availability\r\nand frequency have also been included in each record.   Where possible the\r\ninformation in each record has been checked for currency and accuracy by\r\nchecking the LISTSERV header in the case of LISTSERV based e-conferences\r\nand contacting the moderators of other kinds of e-conferences.\"\r\n\r\n\"The field labels are as follows:\r\nLN:  (e-conference name)\r\nTI:  (topic information)\r\nSU:  (subscription information)\r\nED:  (edited?  Yes or No)\r\nAR:  (archived?   if Yes, frequency, private=subscribers only)\r\nMO:  (moderator, editor, listowner, manager, coordinator, etc.)\r\nIA:  (`official' institutional affiliation).\"\r\n\r\n\"Topic descriptions are taken in whole or part from the descriptions\r\nprovided by each listowner, editor, moderator or coordinator to the\r\nNew-List, the List of Lists, and the Internet Interest Groups file.\"\r\n\r\n\"Any errors are the responsibility of the compiler of the Electronic\r\nConferences for Academics Files.   If you can provide corrections or\r\nadditional information about any of these electronic conferences,\r\nplease contact:\r\n\r\nDiane Kovacs (Bitnet)  DKOVACS@KENTVM (Internet)\r\nDKOVACS@KENTVM.KENT.EDU\r\n\r\nThese files are available on the Directory of Scholarly E-Conferences:\r\nACADLIST README  (explanatory notes for the Directory)\r\nACADSTCK HQX  (binhexed, self-decompressing, HyperCard Stack of\r\n               entire Directory - Keyword searchable)\r\nACADLIST FILE1 (Anthropology- Education)\r\nACADLIST FILE2 (Geography-Library and Information Science)\r\nACADLIST FILE3 (Linguistics-Political Science)\r\nACADLIST FILE4 (Psychology-Writing)\r\nACADLIST FILE5  (Biological sciences)\r\nACADLIST FILE6 (Physical sciences -now includes Academic Computing\r\n                and Computer Science)\r\nACADLIST FILE7 (business, Academia, news)\r\nACADWHOL HQX (binhexed self-decompressing Macintosh M.S.  Word\r\n              4.0 document of all 7 directories)\r\nACADLIST.CHANGES (Major additions and deletions)\r\n\r\nHow to retrieve the abovefiles via mail\r\n\r\n1.  Send an e-mail message addressed to LISTSERV@KENTVM or\r\n    LISTSERV@KENTVM.KENT.EDU.\r\n2.  Leave the subject and other info lines blank.\r\n3.  The message must read:  GET Filename Filetype\r\n    (e.g.,filename=ACADLIST filetype=FILE1 or HQX or whatever)\r\n4.  The files will be sent to you and you must receive them.\r\n5.  If you need assistance receiving, etc.  contact your local Computer\r\n    Services people.\r\n\r\nHow to retrieve the files via anonymous FTP (File Transfer Protocol)\r\n\r\nFTP to KSUVXA.KENT.EDU\r\n1.  when prompted for `USERID,' type   ANONYMOUS.\r\n2.  Your password will be your actual userid on your local machine.\r\n3.  Type:   cd library\r\n4.  Type:   GET Filename.Filetype (e.g., filename=ACADLIST\r\n    filetype=FILE1 or HQX or whatever)\r\n5.  The files will be transferred directly into the directory you ftp'ed\r\n    from at your site.\r\n\r\n\r\nNew Lists and List Changes\r\n\r\nNew lists are being started every day, and old ones fade away.\r\nTo find out bout these changes, join the NEW-LIST mailing.\r\n  Here is part of their Welcome message:\r\n\r\n\"The `NEW-LIST' list has been established as a central address to post\r\nannouncements of new public mailing lists.  In addition, `NEW-LIST' might\r\nbe used as a final verification before establishing a list (to check for\r\nexisting lists on the same topic, etc.).  However, be sure to check sources\r\nsuch as the Internet List-of-Lists (SIGLIST or INTEREST-GROUPS list),\r\nLISTSERV GROUPS, and the LISTS database on the major LISTSERVs\r\n(we have the LISTS database on NDSUVM1).\"\r\n\r\n\"We will gladly rebroadcast New List announcements, final list proposals\r\n(to avoid conflicts or redundancy), or emergency announcements about the\r\navailability of some list.\r\n\r\n\r\nList Review Service\r\n\r\nThese folks subscribe to and monitor a list for awhile and then report on it\r\nto everyone else.  It's a great idea and a useful way to \"sample\" a list.\r\nHere is the subscription information.   Email its author to be added to the\r\nList Review Service list, BITNET ADDRESS:  SRCMUNS@UMSLVMA\r\n\r\nLIST REVIEW SERVICE         ISSN:  1060-8192 Published bi-weekly, when school\r\nis in session, by The University of Missouri, St. Louis Libraries.\r\nRaleigh C. Muns, editor.\r\nFor more information:\r\nThomas Jefferson Library\r\nUniversity of Missouri St. Louis\r\n8001 Natural Bridge Road\r\nSt. Louis, MO 63121\r\n314/553-5059\r\n\r\n\r\nInternet Library Guides\r\n\r\nThree different Internet library guides are available to help both\r\nbeginning and experienced OPAC users.\r\n\r\nArt St. George's Internet-Accessible Library Catalogs and Databases includes\r\ndirections for Internet libraries and Campus Wide Information Systems as\r\nwell as dialup libraries and bulletin boards in the United States.\r\nAvailable from:\r\nariel.unm.edu\r\n/LIBRARY/INTERNET.LIBRARY\r\n\r\nBilly Barron's Accessing On-line Bibliographic Databases contains a number\r\nof useful features such as guides to local OPAC escape sequences and commands.   FTP to ftp.unt.edu\r\n(129.120.1.1)\r\n/LIBRARY/LIBRARIES.TXT\r\n\r\nDana Noonan's A Guide to Internet/Bitnet comes in two parts.  Part two is\r\nabout Internet Libraries.  It is an easy to use guide to many national and\r\ninternational OPACS and their login and use instructions.  (available via\r\nanonymous ftp from vm1.nodak.edu then CD NNEWS  (although nnews may not\r\nshow up on the directory menu, it works.)  A printed version is available\r\nfor $10 from Metronet.   For more information:\r\nMetronet\r\n226 Metro Square Building\r\nSeventh and Robert Streets\r\nSt.  Paul, Minnesota 55101\r\n612/224-4801 FAX 612/224-4827\r\n\r\n\r\nMust-have Books for the Internet Surfer\r\n\r\nKehoe, Brendan.  (1993).  Zen and the Art of the Internet:  a Beginner's\r\nGuide (2nd ed.).  Englewood Cliffs, NJ:  Prentice-Hall.   The first edition is\r\navailable for free from many FTP sites (see below) This version has about\r\n30 pages of new material and corrects various minor errors in the first\r\nedition.  Includes the story of the Coke Machine on the Internet.  For much\r\nof late 1991 and the first half of 1992, this was the document of choice\r\nfor learning about the Internet.   ISBN 0-13-010778-6.  Index.  $22.00\r\n\r\nTo ftp Zen 1.0 in a PostScript version:\r\nftp.uu.net [137.39.1.9] directory /inet/doc\r\nftp.cs.toronto.edu [128.100.3.6] directory /pub/zen\r\nftp.cs.widener.edu [147.31.254.132] directory /pub/zen as zen-1.0.tar.Z,\r\n       zen-1.0.dvi, and zen-1.0.PS\r\nftp.sura.net [128.167.254.179] directory /pub/nic as zen-1.0.PS\r\nIt is also available to read on many Gopher servers.\r\n\r\n\r\nKrol, Ed.  (1992).  The Whole Internet User's Guide & Catalog.  Sebastopol,\r\nCA:  O'Reilly & Associates.   Comprehensive guide to how the network\r\nworks, the domain name system, acceptable use, security, and other issues.\r\nChapters on telnet/remote login, File Transfer Protocol, and electronic\r\nmail explain error messages, special situations, and other arcana.  Archie,\r\nGopher, Net News, WAIS, WWW, and troubleshooting each enjoy a chapter in this\r\nwell-written book.   Appendices contain info on how to get connected in\r\naddition to a glossary.  ISBN 1-56592-025-2.  $24.95\r\n\r\n\r\nLaQuey, Tracey, & Ryer, J.C. (1993).  The Internet Companion:  a\r\nBeginner's Guide to Global Networking.  Reading, MA:  Addison-Wesley.\r\nBeginning with a forewordby Vice-President Elect Al Gore, this book\r\nprovides an often-humorous explanation of the origins of the Internet,\r\nacceptable use, basics of electronic mail, netiquette, online resources,\r\ntransferring information, and finding email addresses.   The In the Know\r\nguide provides background on Internet legends (Elvis sightings is one),\r\norganizations, security issues, and how to get connected.  Bibliography.\r\nIndex.  ISBN 0-201-62224-6 $10.95\r\n\r\n\r\nMarine, April.  (1992).  INTERNET:  Getting Started..  Menlo Park, CA:  SRI\r\nInternational.   This book has an international overview, and includes things\r\nthe others don't, such as an index to all the RFC's (Request for Comments),\r\nInternet organizations, source information for the TCP/IP CD ROM, and\r\nthe answer to \"who is in charge of the Internet?\" (No one is.  The Internet\r\nis a cooperating group of independently administered networks.  Some groups\r\nset basic policy though.) ISBN 0-944604-15-3 $39.00\r\nSRI\r\n333 Ravenswood Ave.\r\nMenlo Park, CA 94025\r\n\r\n\r\nTennant, Roy, Ober, J., & Lipow, A.  G.  (1993).  Crossing the Internet\r\nThreshold:  An Instructional Handbook.  Berkeley, CA:  Library Solutions\r\nPress.   A cookbook to run your own Internet training sessions.  Real- world\r\nexamples.  Foreword by Cliff Lynch.  ISBN:  1-882208-01-3 $45.00\r\nLibrary Solutions Institute and Press\r\n2137 Oregon Street Berkeley, CA 94705\r\n510/841-2636  FAX:  510/841-2926\r\n\r\n\r\nMagazine\r\n\r\nMatrix News, the monthly newsletter edited by John S.  Quarterman.\r\nSubscriptions are $30 per year.  for a paper edition, $25/yr for an online\r\nedition.  Matrix News, Matrix Information & Directory Services, Inc.\r\n(MIDS)\r\n1106 Clayton La.\r\nSuite 500 W\r\nAustin, TX 78746\r\n512/329-1087 FAX:  512/327-1274\r\nmids@tic.com\r\n\r\n\r\nOrganizations\r\n\r\nCNI Coalition for Networked Information\r\n1527 New Hampshire Ave., NW\r\nWashington, DC  20036\r\n202/232-2466  FAX:  202/462-7849\r\ninfo@cni.org\r\n\r\nCPSR  Computer Professionals for Social Responsibility\r\nPO Box 717\r\nPalo Alto, CA 94302\r\n415/322-3778 FAX:  415/322-3798\r\nCPSR Newsletter, annual Computers, Freedom and Privacy Conference, poster\r\n(\"Technology is driving the future-- it's time to find out who's steering.\")\r\ncpsr@clsi.stanford.edu\r\n\r\nEFF The Electronic Frontier Foundation, Inc.\r\n155 Second St.\r\nCambridge, MA 02141\r\n617/864-1550 FAX:  617/864-0866\r\nPublishes the EFFector in online and print editions.  T-shirts,\r\nbumper stickers (\"I'd rather be telecommuting\"; \"ISDN:  Make it so.\";\r\n\"CYBERNAUT\")\r\neff@eff.org\r\n\r\n\r\nInternet Society\r\n1895 Preston White Drive\r\nSuite 100\r\nReston, VA 22091\r\n703/620-8990, FAX 703/620-0913\r\nAnnual conference, quarterly Internet Society News.\r\nisoc@nri.reston.va.us\r\n\r\n=============================================\r\nFor more information about this article:\r\nJean Armour Polly\r\nManager of Network Development and User Training\r\nNYSERNet, Inc.\r\n111 College Place\r\nSyracuse, NY 13244-4100\r\n315/443-4120\r\nFAX:  315/425-7518\r\njpolly@nysernet.org\r\n=============================================\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
}