{
    "id": "56",
    "formats": [
        {
            "format": "text/html",
            "fileName": "56.html.images",
            "filePath": "http://www.gutenberg.org/ebooks/56.html.images",
            "extension": "images"
        },
        {
            "format": "text/plain; charset=us-ascii",
            "fileName": "56/56.txt",
            "filePath": "http://www.gutenberg.org/files/56/56.txt",
            "extension": "txt"
        },
        {
            "format": "text/plain; charset=iso-8859-1",
            "fileName": "56/56-8.txt",
            "filePath": "http://www.gutenberg.org/files/56/56-8.txt",
            "extension": "txt"
        },
        {
            "format": "text/plain",
            "fileName": "56.txt.utf-8",
            "filePath": "http://www.gutenberg.org/ebooks/56.txt.utf-8",
            "extension": "utf-8"
        },
        {
            "format": "application/zip",
            "fileName": "56/56-8.zip",
            "filePath": "http://www.gutenberg.org/files/56/56-8.zip",
            "extension": "zip"
        },
        {
            "format": "application/epub+zip",
            "fileName": "56.epub.images",
            "filePath": "http://www.gutenberg.org/ebooks/56.epub.images",
            "extension": "images"
        },
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "56.kindle.images",
            "filePath": "http://www.gutenberg.org/ebooks/56.kindle.images",
            "extension": "images"
        },
        {
            "format": "text/html",
            "fileName": "56.html.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/56.html.noimages",
            "extension": "noimages"
        },
        {
            "format": "application/epub+zip",
            "fileName": "56.epub.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/56.epub.noimages",
            "extension": "noimages"
        },
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "56.kindle.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/56.kindle.noimages",
            "extension": "noimages"
        },
        {
            "format": "application/rdf+xml",
            "fileName": "56.rdf",
            "filePath": "http://www.gutenberg.org/ebooks/56.rdf",
            "extension": "rdf"
        },
        {
            "format": "text/plain; charset=us-ascii",
            "fileName": "56/56.zip",
            "filePath": "http://www.gutenberg.org/files/56/56.zip",
            "extension": "zip"
        }
    ],
    "languages": [
        "en"
    ],
    "title": [
        "NREN for All: Insurmountable Opportunity"
    ],
    "author": "Polly, Jean Armour",
    "isTextAvailable": false,
    "issued": "1993-03-01",
    "wordcount": 4297,
    "book": "\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nNREN for All:\r\n\r\nInsurmountable Opportunity\r\n\r\nc. 1993 Jean Armour Polly\r\nManager of Network Development and User Training\r\nNYSERNet, Inc.\r\njpolly@nysernet.org\r\n\r\nThis was originally published in the February 1, 1993 issue of\r\nLibrary Journal (volume 118, n. 2, pp  38-41).\r\nIt may be freely reprinted for educational use, please let me know if you\r\nare redistributing it, I like to know if it's useful and where it's been.\r\nPlease do not sell it, and keep this message intact.\r\n\r\n\r\nWhen Senator Al Gore was evangelizing support for his visionary\r\nNational Research and Education Network bill, he often pointed to\r\nthe many benefits of a high-speed, multi-lane, multi-level data\r\nsuperhighway. Some of these included:\r\n\r\n-- collaborating research teams, physically distant from each other,\r\nworking on shared projects via high speed computer networks.\r\nSome of these \"grand challenges\" might model global environmental\r\nchange, or new therapeutic drug research, or the design of a new\r\nairplane for inexpensive consumer air travel.\r\n\r\n-- a scientist or engineer might design a product, which could be\r\ninstantly communicated to a manufacturing plant, whose robotic\r\nmachine could turn the drawing-board product into reality. One example\r\nof this is the capability to digitally measure a new recruit for an\r\narmy uniform, transmit the information to a clothing manufacturer,\r\nand take delivery of a custom-tailored uniform the next day.\r\n\r\n-- access to digital libraries of information, both textual and graphic.\r\nBesides hundreds of online public access catalogs, and full text\r\ndocuments, color illustrations of photographic quality, full motion\r\nvideos and digital audio will also be available over the network.\r\n\r\nIn his many articles and speeches touting the bill, Gore often used\r\nan example of a little girl, living in a rural area, at work on a school\r\nproject. Was she information-poor due to her physical location, far\r\nfrom the resources of large cities? No-- the National Research and\r\nEducation Network would give her the capability to dial into the\r\nLibrary of Congress-- to collect information on dinosaurs.\r\n\r\nNow that the NREN bill has been signed into law (12/91), and\r\ncommittees are being formed, and policies are being made, I'm still\r\nthinking about that little girl, and her parents, for that matter. In\r\nfact I've got some \"Grand Questions\" to pose.\r\n\r\n\r\n1- How will we get access?\r\n\r\nThe Internet has been called the \"Interim NREN\", since it's what we\r\nhave in place now.\r\n\r\nI'm wondering how the family is going to get to the Internet \"dial tone\",\r\nlet alone the NREN, especially since they live in a rural area.\r\nThe information superhighway may be miles from their home, and\r\nit may be an expensive long-distance call to the \"entrance ramp\".\r\n\r\nOr, the superhighway may run right through their front yard, but\r\nthey can't make use of it because they have no computer, no modem,\r\nand no phone line to make the connection. What good is a superhighway\r\nif all you've got is a tricycle?\r\n\r\n\r\n2- What will they be able to gain access to,\r\n   and will their privacy be protected?\r\n\r\nBeyond the infrastructure issues, I'm concerned about what kind of\r\nthings will be available for them once they do get connected,\r\nhow the resources will be arranged, and how they will learn to use\r\nthese tools to advantage.  Beyond that, how authoritative is the\r\ninformation in the digital collection, and how do we know for sure\r\nit came from a legitimate source? How confidential will their\r\ninformation searches be, and how will it be safeguarded?\r\n\r\n\r\n3- Who will get access?\r\n\r\nI'm concerned that even if the infrastructure and resource problems\r\nare resolved, that little girl still won't be allowed access, because a\r\nlot of folks don't think the Internet is a safe place for\r\nunaccompanied minors.\r\n\r\n\r\n4- Does the family have any electronic rights?\r\n   Electronic responsibilities?\r\n   Are dinosaurs and a grade-school project too trivial for NREN?\r\n\r\nSome people think the NREN should be reserved for scientists\r\nworking on \"Grand Challenges\", not ordinary ones. Who will\r\ndecide what constitutes \"acceptable use\"?\r\n\r\n\r\n5- What is the future of the local public library?\r\n\r\nWorse yet, I'm worried that the reason they are phoning the Library\r\nof Congress in the first place is that their local public library has\r\nshut its doors, sold off the book stock, and dismissed the librarian.\r\nWhat can public libraries do to avoid that future?\r\n\r\nBrief Background: The Internet Today\r\n\r\nComputers all over the world are linked by high speed\r\ntelecommunications lines. On the other side of their\r\nscreens are people of all races and nationalities who\r\nare able to exchange ideas quickly through this network.\r\n\r\nThis \"brain to brain\" interface brings both delight and despair, as\r\nevidenced by the following True Tales from the Internet:\r\n\r\n-- Children all over the world participate in class collaborations,\r\nsharing holiday customs, local food prices, proverbs, acid rain\r\nmeasurements, and surveys such as a recent one from a fifth\r\ngrade class in Argentina who wanted to know (among other things)\r\n\"Can you wear jeans to school?\".\r\n\r\n-- During the Soviet coup in the summer of 1991, hundreds read\r\neyewitness accounts of developments posted to the net by computer\r\nusers in Moscow and other Soviet cities with network connectivity.\r\nA literal hush fell over this side of the network after a plea came\r\nacross from the Soviet side. We appreciate your messages of\r\nencouragement and offers of help, it said, but please save the\r\nbandwidth for our outgoing reports!\r\n\r\n- Proliferation of discussion groups on the Internet means one can\r\nfind a niche to discuss everything from cats to Camelot, from\r\nlibrary administration to lovers of mysteries, from Monty Python\r\nto Medieval History.\r\n\r\n-- Predictably, Elvis has been sighted on the Internet.\r\n\r\nBesides electronic mail, full text resources may be downloaded\r\nfrom many Internet host computers. Some of these are religious\r\nmaterials, such as the Bible, and the Koran, others are the complete\r\nworks of Shakespeare, Peter Pan, and Far From the Madding Crowd.\r\n\r\nSearchable resources include lyrics from popular songs, chord\r\ntablature for guitar, recipes, news articles, government information,\r\nSupreme Court Opinions, census data, current and historical weather\r\ninformation, dictionaries, thesauri, the CIA World Fact Book,\r\nand much more.\r\n\r\nHundreds of library OPACS may be searched, and those with\r\naccounts set up at CARL may use UnCover to find articles of\r\ninterest, which then may be faxed on demand.\r\n\r\nThe richness of the Internet changes on a daily basis as more data\r\nresources, computer resources, and human resources join those\r\nalready active on the net.\r\n\r\nBut, back to that little girl.\r\n\r\nHow will she get access?\r\n\r\nShe'll need a plain old telephone line, a modem, a computer, and\r\nsome communications software. Will her family be able to afford it?\r\nIf not, will she be able to dial in from her school? Her Post Office?\r\nThe local feed store?  A kiosk at K-Mart?\r\n\r\nAt the American Library Association's 1992 convention in San\r\nFrancisco, Gloria Steinem said \"the public library is the last refuge\r\nof those without modems.\" I'm sure she meant that the library will\r\nact as information provider for those unable to get their\r\ninformation using a home computer's telecommunications\r\nconnections. But it could be taken another way. Couldn't the public\r\nlibrary act as electronic information access centers, providing public\r\nmodems and telecommunications alongside the books and videos?\r\n\r\nWhy the Public Library is a good place for NREN access\r\n\r\nThe public library is an institution based on long-standing beliefs in\r\nintellectual freedom and the individual's right to know. Let's revisit\r\nALA's LIBRARY BILL OF RIGHTS, Adopted June 18, 1948; amended February\r\n2, 1961, and January 23, 1980, by the ALA Council.\r\n\r\nThe American Library Association affirms that all libraries are\r\nforums for information and ideas, and that the following basic\r\npolicies should guide their services.\r\n\r\n      1.  Books and other library resources should be provided for the\r\ninterest, information, and enlightenment of all people of the\r\ncommunity the library serves.  Materials should not be excluded\r\nbecause of the origin, background, or views of those contributing to\r\ntheir creation.\r\n\r\nNo problem here. The Internet's resources are as diverse as their\r\ncreators, from nations all over the world. Every community can\r\nfind something of interest on the Internet.\r\n\r\n      2.  Libraries should provide materials and information\r\npresenting all points of view on current and historical issues.\r\nMaterials should not be proscribed or removed because of partisan\r\nor doctrinal disapproval.\r\n\r\n      3.  Libraries should challenge censorship in the fulfillment of\r\ntheir responsibility to provide information and enlightenment.\r\n\r\n      4.  Libraries should cooperate with all persons and groups\r\nconcerned with resisting abridgment of free expression and free\r\naccess to ideas.\r\n\r\nAgain, global electronic communication allows discussion and\r\ndebate in an instant electronic forum. There is no better\r\n\"reality check\" than this.\r\n\r\n      5.  A person's right to use a library should not be denied or\r\nabridged because of origin, age, background, or views.\r\n\r\nIn a public library, the little girl won't be barred from using the\r\nInternet because of her age. The ALA interpretation of the above\r\nright states:\r\n\"Librarians and governing bodies should not resort to age\r\nrestrictions on access to library resources in an effort to avoid actual\r\nor anticipated objections from parents or anyone else.  The mission,\r\ngoals, and objectives of libraries do not authorize librarians or\r\ngoverning bodies to assume, abrogate, or overrule the rights and\r\nresponsibilities of parents or legal guardians.  Librarians and\r\ngoverning bodies should maintain that parents - and only parents\r\n- have the right and the responsibility to restrict the access\r\nof their children - and only their children - to library resources.\r\nParents or legal guardians who do not want their children to have\r\naccess to certain library services, materials or facilities, should so\r\nadvise their children. Librarians and governing bodies cannot\r\nassume the role of parents or the functions of parental authority in\r\nthe private relationship between parent and child.  Librarians and\r\ngoverning bodies have a public and professional obligation to\r\nprovide equal access to all library resources for all library users.\"\r\n\r\n      6.  Libraries which make exhibit spaces and meeting rooms\r\navailable to the public they serve should make such facilities\r\navailable on an equitable basis, regardless of the beliefs or\r\naffiliations of individuals or groups requesting their use.\"\r\n\r\nThe Internet provides the equivalent of electronic meeting rooms\r\nand virtual exhibit spaces. Public libraries will offer access to all\r\ncomers, regardless of their status.\r\n\r\nFurther, as part of the Interpretation of the Library Bill of Rights,\r\nthis statement appears:\r\n\"The U.S. Supreme Court has recognized that `the right to receive\r\nideas follows ineluctably from the sender's First Amendment right\r\nto send them. . . . More importantly, the right to receive ideas is a\r\nnecessary predicate to the recipient's meaningful exercise of his\r\nown rights such as speech, press, and political freedom' Board of\r\nEducation, Island Trees Union Free School District No. 26 v. Pico,\r\n457 U.S. 853, 866-67 (1982) (plurality opinion).\"\r\n\r\nClearly, reception and sending of ideas is a First Amendment issue.\r\nOral, written, and electronic speech must be equally protected so\r\nthat democracy may flourish.\r\n\r\nPublic libraries also provide \"free\" services, though in fact the costs\r\nare just deferred. Taxes, state aid derived from taxes, federal aid\r\nderived from taxes, and private funds all pay for the \"free\" services\r\nat public libraries. Public libraries may be thought of as\r\nInformation Management Organizations (IMO's), similar to Health\r\nManagement Organizations, where patrons/patients contribute\r\nbefore they need information/health care, so that when they do\r\nneed it, librarians/doctors are available to render aid.\r\n\r\nWhy NREN in the Public Library is a bad idea\r\n\r\nOn the surface, the public library looks like an excellent place to\r\ndrop Internet/NREN connectivity. Libraries are veritable temples\r\nof learning, intellectual freedom, and confidentiality.\r\n\r\nHowever, most public libraries lack what computer experts call\r\ninfrastructure. If there are computers, they may be out of date. Staff\r\nmay not have had time to learn to operate them, and the computers\r\nmay literally be collecting dust.\r\n\r\nThere may be no modems, no phone line to share, no staff with\r\ntime to learn about the Internet and its many resources.  Money to\r\nupdate equipment, hire staff, and buy training is out of the\r\nquestion. Public libraries face slashed budgets, staff layoffs,\r\nreduced hours, and cutbacks in services.\r\n\r\nMany of these drawbacks are noted in the recent study by Dr.\r\nCharles R. McClure, called Public Libraries and the\r\nInternet/NREN: New Challenges, New Opportunities.\r\n\r\nPublic librarians were surveyed about their attitudes toward NREN\r\nin interviews and focus groups. According to the study, public\r\nlibrarians thought that the public had a \"right\" to the Internet, and\r\nits availability in their libraries would provide a safety net for the\r\nelectronic-poor.\r\n\r\nOn the other hand they felt that they could not commit resources to\r\nthis initiative until they knew better what the costs were and the\r\nbenefits might be. They longed for someone else to create a pilot\r\nproject to demonstrate the Internet's usefulness, or lack thereof,\r\nfor public library users.\r\n\r\nThe study describes several scenarios for public libraries as the\r\nNREN evolves. Some may simply choose to ignore the sweeping\r\ntechnological changes in information transfer. They may continue\r\nto exist by purveying high-demand items and traditional services,\r\nbut they may find it increasingly difficult to maintain funding\r\nlevels as the rest of the world looks elsewhere for their information\r\nand reference needs. The public library may find itself servicing\r\nonly the information disenfranchised, while the rest of the\r\ncommunity finds, and pays for, other solutions.\r\n\r\n As the study explains:\r\n\r\n\"While embracing and exploiting networked information and services,\r\n[successfully transitioned libraries] also maintain high visibility\r\nand high demand traditional services. But resources will be reallocated\r\nfrom collections and less-visible services to support their involvement\r\nin the network. All services will be more client-centered and demand-based,\r\nand the library will consciously seek opportunities to deliver new types\r\nof information resources and services electronically.\"\r\n\r\n\"In this scenario, the public library will develop and mount services\r\nover the NREN, provide for public access to the NREN, and will\r\ncompete successfully against other information providers. In its\r\nnetworked role, the library can serve as a central point of contact as\r\nan electronic navigator and intermediary in linking individuals to\r\nelectronic information resources- regardless of type or physical\r\nlocation. The public library in this second scenario will define a\r\nfuture for itself in the NREN and develop a strategic plan to insure\r\nits successful participation as an information provider in the\r\nnetworked environment.\"\r\n\r\n\r\nWhat Should Happen\r\n\r\nSenator Gore has proposed what has been variously called Son of\r\nNREN or Gore II, which should help address many of these\r\ninfrastructure problems.\r\n\r\nUnfortunately, the Bill was not passed and the closing of the last\r\nCongress. There is hope, however, that it will be reintroduced this\r\nSpring.\r\n\r\nSpecifically, Gore's bill would have ensured that the technology\r\ndeveloped by the High-Performance Computing Act of 1991 is\r\napplied widely in K-12 education, libraries, health care and\r\nindustry, particularly manufacturing.  It would have authorized a\r\ntotal of $1.15 billion over the next five years.\r\n\r\nAccording to a press release from Senator Gore's office,\r\n\r\n\"The Information Infrastructure and Technology Act charges the\r\nWhite House Office of Science and Technology Policy (OSTP) with\r\ncoordinating efforts to develop applications for high-performance\r\ncomputing networking and assigns specific responsibilities to the\r\nNational Science Foundation, the National Aeronautics and Space\r\nAgency, the National Institute of Standards and Technology, and\r\nthe National Institutes of Health. It would expand the role of\r\nOSTP in overseeing federal efforts to disseminate scientific and\r\ntechnical information.\"\r\n\r\n\"The bill provides funding to both NSF and NASA to develop\r\ntechnology for 'digital libraries'-- huge data bases that store text,\r\nimagery, video, and sound and are accessible over computer\r\nnetworks like NSFNET.  The bill also funds development of\r\nprototype 'digital libraries' around the country.\"\r\n\r\nThe public needs NREN because 300 baud used to be fast and low-\r\nresolution graphics used to be pretty. Now we get impatient\r\nwaiting for fax machines to print out a document from half a\r\ncontinent away, when a few years ago we would have been\r\ncontent to wait days or weeks for the same article to arrive by mail.\r\nWe are satisfied with technology until it starts to impede our lives\r\nin some way. We wait impatiently, sure that we spend half our\r\nlives waiting for printers, and the other half waiting for disk drives.\r\nTime is a commodity.\r\n\r\nI can envision that little girl walking into the public library with the\r\nfollowing request:\r\n\"I'm doing a school report on the Challenger disaster. I need a video\r\nclip of the explosion, a sound bite of Richard Feynman explaining\r\nthe O-ring problem, some neat graphics from NASA, oh, and\r\nmaybe some virtual reality mock-ups of the shuttle interior. Can\r\nyou put it all on this floppy disk for me, I know it's only 15 minutes\r\nbefore you close but, gee, I had band practice.\"  This is why\r\npublic libraries need NREN.\r\n\r\nWe would do well to remember the words of Ranganathan, whose\r\nbasic tenets of good librarianship need just a little updating from\r\n1931:\r\n\r\n\"[Information] is for use.\"\r\n\"Every [bit of information], its user.\"\r\n\"Every user, [his/her bit of information].\"\r\n\"Save the time of the [user].\"\r\n\"A [network] is a growing organism.\"\r\n\r\nAnd so is the public library. A promising future awaits the public\r\nlibrary that can be proactive rather than reactive to technology.\r\nInformation technology is driving the future, librarians should be at\r\nthe wheel. It is hoped that the new Administration in Washington\r\nwill provide the fuel to get us going.\r\n\r\n_______________________________\r\nSIDEBAR\r\n-------------------------------------------------------\r\nExcerpts from S.2937 as introduced July 1, 1992\r\n102nd Congress\r\n2nd Session\r\n              IN THE SENATE OF THE UNITED STATES\r\n\r\n     Mr. GORE (for himself, Rockefeller (D-WV), Kerry (D-MA),\r\nPrestler (R-SD), Riegle (D-MI), Robb (D-VA), Lieberman (D-CT),\r\nKerrey (D-NE) and Burns (R-MT)) introduced the following bill;\r\nwhich was read twice and referred to the Committee on Commerce,\r\nScience and Transportation.\r\n\r\n                           A BILL\r\nTo expand Federal efforts to develop technologies for applications\r\nof high-performance computing and high-speed networking, to\r\nprovide for a coordinated Federal program to accelerate development\r\nand deployment of an advanced information infrastructure,\r\nand for other purposes.\r\n\r\n     Be it enacted by the Senate and House of Representatives\r\nof the United States of America in Congress assembled,\r\n\r\n\r\nSECTION 1. SHORT TITLE.\r\n     This Act may be cited as the \"Information Infrastructure and\r\nTechnology Act of                                1992\".\r\n\r\nSEC. 7. APPLICATIONS FOR LIBRARIES.\r\n          (a) DIGITAL LIBRARIES.--In accordance with the Plan\r\ndeveloped under section 701 of the National Science and\r\nTechnology Policy, Organization and Priorities Act of 1976 (42\r\nU.S.C. 6601 et seq.), as added by section 3 of this Act, the National\r\nScience Foundation, the National Aeronautics and Space\r\nAdministration, the Defense Advanced Research Projects Agency,\r\nand other appropriate agencies shall develop technologies for\r\n\"digital libraries\" of electronic information. Development of digital\r\nlibraries shall include the following:\r\n               (1) Development of advanced data storage systems\r\n          capable of storing hundreds of trillions of bits of data\r\n          and giving thousands of users nearly instantaneous\r\n          access to that information.\r\n               (2) Development of high-speed, highly accurate\r\n          systems for converting printed text, page images,\r\n          graphics, and photographic images into electronic form.\r\n               (3) Development of database software capable of\r\n          quickly searching, filtering, and summarizing large\r\n          volumes of text, imagery, data, and sound.\r\n               (4) Encouragement of development and adoption of\r\n          standards for electronic data.\r\n               (5) Development of computer technology to\r\n          categorize and organize electronic information in a\r\n          variety of formats.\r\n               (6) Training of database users and librarians in\r\n          the use of and development of electronic databases.\r\n               (7) Development of technology for simplifying the\r\n          utilization of networked databases distributed around\r\n          the Nation and around the world.\r\n               (8) Development of visualization technology for\r\n          quickly browsing large volumes of imagery.\r\n          (b) DEVELOPMENT OF PROTOTYPES.--The National\r\nScience\r\n     Foundation, working with the supercomputer centers it\r\n     supports, shall develop prototype digital libraries of\r\n     scientific data available over the Internet and the National\r\n     Research and Education Network.\r\n          (c) DEVELOPMENT OF DATABASES OF REMOTE-\r\nSENSING\r\n     IMAGES.--The National Aeronautics and Space Administration\r\n     shall develop databases of software and remote-sensing images\r\n     to be made available over computer networks like the\r\n     Internet.\r\n\r\n (d) AUTHORIZATION OF APPROPRIATIONS.--\r\n              (1) There are authorized to be appropriated to the National\r\nScience\r\nFoundation for the purposes of this section, $10,000,000 for  fiscal\r\nyear 1993, $20,000,000 for fiscal year 1994, $30,000,000 for fiscal year\r\n1995, $40,000,000 for fiscal year 1996, and $50,000,000 for fiscal year\r\n1997.\r\n               (2) There are authorized to be appropriated to the National\r\nAeronautics and Space Administration for the purposes of this\r\nsection, $10,000,000 for fiscal year 1993, $20,000,000 for fiscal year\r\n1994, $30,000,000  for fiscal year 1995, $40,000,000 for fiscal year\r\n1996, and $50,000,000 for fiscal year 1997.\r\n\r\n________________________\r\nSIDEBAR\r\n Resources\r\n___________________________\r\n\r\nMcClure, Charles R., Joe Ryan, Diana Lauterbach and William E. Moen\r\nPublic Libraries and the INTERNET/NREN: New Challenges, New Opportunities.\r\n1992. Copies of this 38-page study may be ordered at $15 each from\r\nthe Publication Office, School of Information Studies, Syracuse\r\nUniversity, Syracuse, NY 13244-4100  315/443-2911.\r\n\r\nThe U.S. National Commission on Libraries and Information\r\nScience (NCLIS) has issued a Report to the Office of Science and\r\nTechnology Policy on Library and Information Services' Roles in\r\nthe National Research and Education  Network. The 25-page\r\ndocument, released in late November, 1992,  summarizes the results\r\nof an open forum held in Washington during the previous summer.\r\nTopics addressed include funding NREN, charging for use,\r\ncommercial  access, protection of intellectual property, and security\r\nand privacy. The report \"focuses on fulfilling the potential for\r\nextending the services and effectiveness of libraries and\r\ninformation services for all Americans  through high-speed\r\nnetworks and electronic databases.\"  A limited number of copies are\r\navailable from NCLIS at 111 18th St., NW, Suite 310, Washington,\r\nD.C. 20036  202/254-3100.\r\n\r\nGrand Challenges 1993: High Performance Computing and\r\nCommunications. The \"Teal Book\" (because of its color) \"provides a\r\nfar-sighted vision for investment in technology but also recognizes\r\nthe importance of human resources  and applications that serve\r\nmajor national needs. This É investment will bring both economic\r\nand social dividends, including advances in education,\r\nproductivity, basic science, and technological innovation.\"\r\nRequests for copies of this 68-page document should go to: Federal\r\nCoordinating Council for Science, Engineering and Technology,\r\nCommittee on Physical, Mathematical, and Engineering Sciences\r\nc/o National Science Foundation,  Computer and Information Science\r\nand Engineering Directorate, 1800 G St. NW, Washington, D.C. 20550\r\n\r\nCarl Kadie operates an excellent electronic resource of documents\r\npertaining to academic freedom, the Library Bill of Rights, and\r\nsimilar policy statements. Those with Internet access may use File\r\nTransfer Protocol (FTP)  to ftp.eff.org (192.88.144.4) Login as\r\nanonymous, use your network address as the password. The documents\r\nare in the /pub/academic directory.\r\n\r\nFurther Reading\r\n\r\nKehoe, Brendan. (1993). Zen and the Art of the Internet: a\r\nBeginner's Guide (2nd ed.). Englewood Cliffs, NJ: Prentice-Hall.\r\nThe first edition is available for free from many FTP sites. (see\r\nbelow) This version has about 30 pages of new material and\r\ncorrects various minor errors in the first edition. Includes the story\r\nof the Coke Machine on the  Internet. For much of late\r\n1991 and the first half of 1992, this was the document of choice for\r\nlearning about the Internet. ISBN 0-13-010778-6. Index. $22.00\r\n\r\nTo ftp Zen: ftp.uu.net [137.39.1.9] in /inet/doc ftp.cs.toronto.edu\r\n[128.100.3.6] in pub/zen ftp.cs.widener.edu [147.31.254.132] in\r\npub/zen as zen-1.0.tar.Z, zen-1.0.dvi, and zen-1.0.PS ftp.sura.net\r\n[128.167.254.179] in pub/nic as zen-1.0.PS\r\n\r\nKrol, Ed. (1992). The Whole Internet User's Guide & Catalog.\r\nSebastopol, CA: O'Reilly & Associates.\r\nComprehensive guide to how the network works, the domain name\r\nsystem, acceptable use, security, and other issues. Chapters on\r\ntelnet/remote login, File Transfer Protocol, and electronic mail\r\nexplain error messages, special  situations, and\r\nother arcana. Archie, Gopher, NetNews, WAIS, WWW, and\r\ntroubleshooting each enjoy a chapter in this well-written book.\r\nAppendices contain info on how to get connected in addition to a\r\nglossary. ISBN 1-56592-025-2. $24.95\r\n\r\nLaQuey, Tracy, & Ryer, J. C. (1993). The Internet Companion: a\r\nBeginner's Guide to Global Networking. Reading, MA: Addison-Wesley.\r\nBeginning with a foreword by Vice-President Elect Al Gore, this\r\nbook provides an often- humorous explanation of the origins of the\r\nInternet, acceptable use, basics of electronic mail, netiquette, online\r\nresources, transferring  information, and finding email addresses.\r\nThe In the Know guide provides background on Internet legends (Elvis\r\nsightings is one), organizations, security issues, and how to get connected.\r\nBibliography. Index. ISBN 0-201-62224-6 $10.95\r\n\r\nPolly, Jean Armour. Surfing the Internet 2.0. An enthusiastic tour of\r\nselected Internet resources, electronic serials, listserv discussion\r\ngroups, service providers, manuals and guides and more. Available\r\nvia anonymous FTP  from NYSERNET.org (192.77.173.2) in the\r\ndirectory /pub/resources/guides surfing.2.0.txt.\r\n\r\nTennant, Roy, Ober, J., & Lipow, A. G. (1993). Crossing the Internet\r\nThreshold: An Instructional Handbook. Berkeley, CA: Library\r\nSolutions Press.\r\nA cookbook to run your own Internet training sessions. Real-world examples.\r\nForeword by Cliff Lynch. Library Solutions Institute and Press\r\n2137 Oregon Street Berkeley, CA 94705\r\nPhone:(510) 841-2636  Fax: (510) 841-2926\r\nISBN: 1-882208-01-3 $45.00\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
}