{
    "id": "57",
    "formats": [
        {
            "format": "application/epub+zip",
            "fileName": "57.epub.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/57.epub.noimages",
            "extension": "noimages"
        },
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "57.kindle.images",
            "filePath": "http://www.gutenberg.org/ebooks/57.kindle.images",
            "extension": "images"
        },
        {
            "format": "text/plain; charset=us-ascii",
            "fileName": "57/57.txt",
            "filePath": "http://www.gutenberg.org/files/57/57.txt",
            "extension": "txt"
        },
        {
            "format": "application/zip",
            "fileName": "57/57.zip",
            "filePath": "http://www.gutenberg.org/files/57/57.zip",
            "extension": "zip"
        },
        {
            "format": "text/html; charset=iso-8859-1",
            "fileName": "57/57-h.zip",
            "filePath": "http://www.gutenberg.org/files/57/57-h.zip",
            "extension": "zip"
        },
        {
            "format": "text/plain",
            "fileName": "57.txt.utf-8",
            "filePath": "http://www.gutenberg.org/ebooks/57.txt.utf-8",
            "extension": "utf-8"
        },
        {
            "format": "application/rdf+xml",
            "fileName": "57.rdf",
            "filePath": "http://www.gutenberg.org/ebooks/57.rdf",
            "extension": "rdf"
        },
        {
            "format": "application/epub+zip",
            "fileName": "57.epub.images",
            "filePath": "http://www.gutenberg.org/ebooks/57.epub.images",
            "extension": "images"
        },
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "57.kindle.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/57.kindle.noimages",
            "extension": "noimages"
        },
        {
            "format": "text/html; charset=iso-8859-1",
            "fileName": "57/57-h/57-h.htm",
            "filePath": "http://www.gutenberg.org/files/57/57-h/57-h.htm",
            "extension": "htm"
        }
    ],
    "languages": [
        "en"
    ],
    "title": [
        "Aladdin and the Magic Lamp"
    ],
    "author": "Unknown",
    "issued": "1993-03-01",
    "text": "*** START OF THIS PROJECT GUTENBERG EBOOK ALADDIN AND THE MAGIC LAMP ***\r\n\r\n\r\n\r\n\r\nProduced by Kristin Schultz\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nAladdin and the Magic Lamp\r\n\r\n\r\nThere once lived a poor tailor, who had a son called Aladdin, a\r\ncareless, idle boy who would do nothing but play all day long in the\r\nstreets with little idle boys like himself.  This so grieved the father\r\nthat he died; yet, in spite of his mother's tears and prayers, Aladdin\r\ndid not mend his ways.  One day, when he was playing in the streets as\r\nusual, a stranger asked him his age, and if he was not the son of\r\nMustapha the tailor.  \"I am, sir,\" replied Aladdin; \"but he died a long\r\nwhile ago.\"  On this the stranger, who was a famous African magician,\r\nfell on his neck and kissed him saying: \"I am your uncle, and knew you\r\nfrom your likeness to my brother.  Go to your mother and tell her I am\r\ncoming.\"  Aladdin ran home and told his mother of his newly found\r\nuncle.  \"Indeed, child,\" she said, \"your father had a brother, but I\r\nalways thought he was dead.\" However, she prepared supper, and bade\r\nAladdin seek his uncle, who came laden with wine and fruit.  He fell\r\ndown and kissed the place where Mustapha used to sit, bidding Aladdin's\r\nmother not to be surprised at not having seen him before, as he had\r\nbeen forty years out of the country.  He then turned to Aladdin, and\r\nasked him his trade, at which the boy hung his head, while his mother\r\nburst into tears.  On learning that Aladdin was idle and would learn no\r\ntrade, he offered to take a shop for him and stock it with merchandise.\r\nNext day he bought Aladdin a fine suit of clothes and took him all over\r\nthe city, showing him the sights, and brought him home at nightfall to\r\nhis mother, who was overjoyed to see her son so fine.\r\n\r\nNext day the magician led Aladdin into some beautiful gardens a long\r\nway outside the city gates.  They sat down by a fountain and the\r\nmagician pulled a cake from his girdle, which he divided between them.\r\nThen they journeyed onwards till they almost reached the mountains.\r\nAladdin was so tired that he begged to go back, but the magician\r\nbeguiled him with pleasant stories and lead him on in spite of himself.\r\nAt last they came to two mountains divided by a narrow valley.  \"We\r\nwill go no farther,\" said his uncle.  \"I will show you something\r\nwonderful; only do you gather up sticks while I kindle a fire.\"  When\r\nit was lit the magician threw on it a powder he had about him, at the\r\nsame time saying some magical words.  The earth trembled a little in\r\nfront of them, disclosing a square flat stone with a brass ring in the\r\nmiddle to raise it by.  Aladdin tried to run away, but the magician\r\ncaught him and gave him a blow that knocked him down.  \"What have I\r\ndone, uncle?\" he said piteously; whereupon the magician said more\r\nkindly:  \"Fear nothing, but obey me.  Beneath this stone lies a\r\ntreasure which is to be yours, and no one else may touch it, so you\r\nmust do exactly as I tell you.\"  At the word treasure Aladdin forgot\r\nhis fears, and grasped the ring as he was told, saying the names of his\r\nfather and grandfather.  The stone came up quite easily, and some steps\r\nappeared.  \"Go down,\" said the magician; \"at the foot of those steps\r\nyou will find an open door leading into three large halls.  Tuck up\r\nyour gown and go through them without touching anything, or you will\r\ndie instantly.  These halls lead into a garden of fine fruit trees.\r\nWalk on till you come to niche in a terrace where stands a lighted\r\nlamp.  Pour out the oil it contains, and bring it me.\"  He drew a ring\r\nfrom his finger and gave it to Aladdin, bidding him prosper.\r\n\r\nAladdin found everything as the magician had said, gathered some fruit\r\noff the trees, and, having got the lamp, arrived at the mouth of the\r\ncave.  The magician cried out in a great hurry: \"Make haste and give me\r\nthe lamp.\"  This Aladdin refused to do until he was out of the cave.\r\nThe magician flew into a terrible passion, and throwing some more\r\npowder on to the fire, he said something, and the stone rolled back\r\ninto its place.\r\n\r\nThe man left the country, which plainly showed that he was no uncle of\r\nAladdin's but a cunning magician, who had read in his magic books of a\r\nwonderful lamp, which would make him the most powerful man in the\r\nworld.  Though he alone knew where to find it, he could only receive it\r\nfrom the hand of another.  He had picked out the foolish Aladdin for\r\nthis purpose, intending to get the lamp and kill him afterwards.\r\n\r\nFor two days Aladdin remained in the dark, crying and lamenting.  At\r\nlast he clasped his hands in prayer, and in so doing rubbed the ring,\r\nwhich the magician had forgotten to take from him.  Immediately an\r\nenormous and frightful genie rose out of the earth, saying:  \"What\r\nwouldst thou with me?  I am the Slave of the Ring, and will obey thee\r\nin all things.\"  Aladdin fearlessly replied, \"Deliver me from this\r\nplace!\" whereupon the earth opened, and he found himself outside.  As\r\nsoon as his eyes could bear the light he went home, but fainted on the\r\nthreshold.  When he came to himself he told his mother what had passed,\r\nand showed her the lamp and the fruits he had gathered in the garden,\r\nwhich were in reality precious stones.  He then asked for some food.\r\n\"Alas!  child,\" she said, \"I have nothing in the house, but I have spun\r\na little cotton and will go sell it.\"  Aladdin bade her keep her\r\ncotton, for he would sell the lamp instead.  As it was very dirty, she\r\nbegan to rub it, that it might fetch a higher price.  Instantly a\r\nhideous genie appeared, and asked what she would have.  She fainted\r\naway, but Aladdin, snatching the lamp, said boldly: \"Fetch me something\r\nto eat!\"  The genie returned with a silver bowl, twelve silver plates\r\ncontaining rich meats, two silver cups, and two bottles of wine.\r\nAladdin's mother, when she came to herself, said:  \"Whence comes this\r\nsplendid feast?\"  \"Ask not, but eat,\" replied Aladdin.  So they sat at\r\nbreakfast till it was dinner-time, and Aladdin told his mother about\r\nthe lamp.  She begged him to sell it, and have nothing to do with\r\ndevils.  \"No,\" said Aladdin, \"since chance hath made us aware of its\r\nvirtues, we will use it, and the ring likewise, which I shall always\r\nwear on my finger.\"  When they had eaten all the genie had brought,\r\nAladdin sold one of the silver plates, and so on until none were left.\r\nHe then had recourse to the genie, who gave him another set of plates,\r\nand thus they lived many years.\r\n\r\nOne day Aladdin heard an order from the Sultan proclaimed that everyone\r\nwas to stay at home and close his shutters while the Princess his\r\ndaughter went to and from the bath.  Aladdin was seized by a desire to\r\nsee her face, which was very difficult, as she always went veiled.  He\r\nhid himself behind the door of the bath, and peeped through a chink.\r\nThe Princess lifted her veil as she went in, and looked so beautiful\r\nthat Aladdin fell in love with her at first sight.  He went home so\r\nchanged that his mother was frightened.  He told her he loved the\r\nPrincess so deeply he could not live without her, and meant to ask her\r\nin marriage of her father.  His mother, on hearing this, burst out\r\nlaughing, but Aladdin at last prevailed upon her to go before the\r\nSultan and carry his request.  She fetched a napkin and laid in it the\r\nmagic fruits from the enchanted garden, which sparkled and shone like\r\nthe most beautiful jewels.  She took these with her to please the\r\nSultan, and set out, trusting in the lamp.  The Grand Vizier and the\r\nlords of council had just gone in as she entered the hall and placed\r\nherself in front of the Sultan.  He, however, took no notice of her.\r\nShe went every day for a week, and stood in the same place.  When the\r\ncouncil broke up on the sixth day the Sultan said to his Vizier:  \"I\r\nsee a certain woman in the audience-chamber every day carrying\r\nsomething in a napkin.  Call her next time, that I may find out what\r\nshe wants.\"  Next day, at a sign from the vizier, she went up to the\r\nfoot of the throne and remained kneeling until the Sultan said to her:\r\n\"Rise, good woman, and tell me what you want.\"  She hesitated, so the\r\nSultan sent away all but the Vizier, and bade her speak freely,\r\npromising to forgive her beforehand for anything she might say.  She\r\nthen told him of her son's violent love for the Princess.  \"I prayed\r\nhim to forget her,\" she said, \"but in vain; he threatened to do some\r\ndesperate deed if I refused to go and ask your Majesty for the hand of\r\nthe Princess.  Now I pray you to forgive not me alone, but my son\r\nAladdin.\"  The Sultan asked her kindly what she had in the napkin,\r\nwhereupon she unfolded the jewels and presented them.  He was\r\nthunderstruck, and turning to the vizier, said:  \"What sayest thou?\r\nOught I not to bestow the Princess on one who values her at such a\r\nprice?\"  The Vizier, who wanted her for his own son, begged the Sultan\r\nto withhold her for three months, in the course of which he hoped his\r\nson could contrive to make him a richer present.  The Sultan granted\r\nthis, and told Aladdin's mother that, though he consented to the\r\nmarriage, she must not appear before him again for three months.\r\n\r\nAladdin waited patiently for nearly three months, but after two had\r\nelapsed, his mother, going into the city to buy oil, found everyone\r\nrejoicing, and asked what was going on.  \"Do you not know,\" was the\r\nanswer, \"that the son of the Grand Vizier is to marry the Sultan's\r\ndaughter tonight?\"  Breathless she ran and told Aladdin, who was\r\noverwhelmed at first, but presently bethought him of the lamp.  He\r\nrubbed it and the genie appeared, saying: \"What is thy will?\"  Aladdin\r\nreplied:  \"The Sultan, as thou knowest, has broken his promise to me,\r\nand the vizier's son is to have the Princess.  My command is that\r\nto-night you bring hither the bride and bridegroom.\"  \"Master, I obey,\"\r\nsaid the genie.  Aladdin then went to his chamber, where, sure enough,\r\nat midnight the genie transported the bed containing the vizier's son\r\nand the Princess.  \"Take this new-married man,\" he said, \"and put him\r\noutside in the cold, and return at daybreak.\"  Whereupon the genie took\r\nthe vizier's son out of bed, leaving Aladdin with the Princess.  \"Fear\r\nnothing,\" Aladdin said to her; \"you are my wife, promised to me by your\r\nunjust father, and no harm will come to you.\"  The Princess was too\r\nfrightened to speak, and passed the most miserable night of her life,\r\nwhile Aladdin lay down beside her and slept soundly.  At the appointed\r\nhour the genie fetched in the shivering bridegroom, laid him in his\r\nplace, and transported the bed back to the palace.\r\n\r\nPresently the Sultan came to wish his daughter good-morning.  The\r\nunhappy Vizier's son jumped up and hid himself, while the Princess\r\nwould not say a word and was very sorrowful.  The Sultan sent her\r\nmother to her, who said:  \"How comes it, child, that you will not speak\r\nto your father?  What has happened?\"  The Princess sighed deeply, and\r\nat last told her mother how, during the night, the bed had been carried\r\ninto some strange house, and what had passed there. Her mother did not\r\nbelieve her in the least, but bade her rise and consider it an idle\r\ndream.\r\n\r\nThe following night exactly the same thing happened, and next morning,\r\non the Princess's refusing to speak, the Sultan threatened to cut off\r\nher head.  She then confessed all, bidding him ask the Vizier's son if\r\nit were not so.  The Sultan told the Vizier to ask his son, who owned\r\nthe truth, adding that, dearly as he loved the Princess, he had rather\r\ndie than go through another such fearful night, and wished to be\r\nseparated from her.  His wish was granted, and there was an end of\r\nfeasting and rejoicing.\r\n\r\nWhen the three months were over, Aladdin sent his mother to remind the\r\nSultan of his promise.  She stood in the same place as before, and the\r\nSultan, who had forgotten Aladdin, at once remembered him, and sent for\r\nher.  On seeing her poverty the Sultan felt less inclined than ever to\r\nkeep his word, and asked his Vizier's advice, who counselled him to set\r\nso high a value on the Princess that no man living would come up to it.\r\nThe Sultan than turned to Aladdin's mother, saying:  \"Good woman, a\r\nsultan must remember his promises, and I will remember mine, but your\r\nson must first send me forty basins of gold brimful of jewels, carried\r\nby forty black slaves, led by as many white ones, splendidly dressed.\r\nTell him that I await his answer.\"  The mother of Aladdin bowed low and\r\nwent home, thinking all was lost.  She gave Aladdin the message adding,\r\n\"He may wait long enough for your answer!\"  \"Not so long, mother, as\r\nyou think,\" her son replied.  \"I would do a great deal more than that\r\nfor the Princess.\" He summoned the genie, and in a few moments the\r\neighty slaves arrived, and filled up the small house and garden.\r\nAladdin made them to set out to the palace, two by two, followed by his\r\nmother.  They were so richly dressed, with such splendid jewels, that\r\neveryone crowded to see them and the basins of gold they carried on\r\ntheir heads.  They entered the palace, and, after kneeling before the\r\nSultan, stood in a half-circle round the throne with their arms\r\ncrossed, while Aladdin's mother presented them to the Sultan.  He\r\nhesitated no longer, but said:  \"Good woman, return and tell your son\r\nthat I wait for him with open arms.\"  She lost no time in telling\r\nAladdin, bidding him make haste.  But Aladdin first called the genie.\r\n\"I want a scented bath,\" he said, \"a richly embroidered habit, a horse\r\nsurpassing the Sultan's, and twenty slaves to attend me.  Besides this,\r\nsix slaves, beautifully dressed, to wait on my mother; and lastly, ten\r\nthousand pieces of gold in ten purses.\"  No sooner said then done.\r\nAladdin mounted his horse and passed through the streets, the slaves\r\nstrewing gold as they went.  Those who had played with him in his\r\nchildhood knew him not, he had grown so handsome.  When the sultan saw\r\nhim he came down from his throne, embraced him, and led him into a hall\r\nwhere a feast was spread, intending to marry him to the Princess that\r\nvery day.  But Aladdin refused, saying, \"I must build a palace fit for\r\nher,\" and took his leave.  Once home, he said to the genie:  \"Build me\r\na palace of the finest marble, set with jasper, agate, and other\r\nprecious stones.  In the middle you shall build me a large hall with a\r\ndome, its four walls of massy gold and silver, each side having six\r\nwindows, whose lattices, all except one which is to be left unfinished,\r\nmust be set with diamonds and rubies.  There must be stables and horses\r\nand grooms and slaves; go and see about it!\"\r\n\r\nThe palace was finished the next day, and the genie carried him there\r\nand showed him all his orders faithfully carried out, even to the\r\nlaying of a velvet carpet from Aladdin's palace to the Sultan's.\r\nAladdin's mother then dressed herself carefully, and walked to the\r\npalace with her slaves, while he followed her on horseback.  The Sultan\r\nsent musicians with trumpets and cymbals to meet them, so that the air\r\nresounded with music and cheers.  She was taken to the Princess, who\r\nsaluted her and treated her with great honour.  At night the princess\r\nsaid good-bye to her father, and set out on the carpet for Aladdin's\r\npalace, with his mother at her side, and followed by the hundred\r\nslaves.  She was charmed at the sight of Aladdin, who ran to receive\r\nher.  \"Princess,\" he said, \"blame your beauty for my boldness if I have\r\ndispleased you.\" She told him that, having seen him, she willingly\r\nobeyed her father in this matter.  After the wedding had taken place,\r\nAladdin led her into the hall, where a feast was spread, and she supped\r\nwith him, after which they danced till midnight.\r\n\r\nNext day Aladdin invited the Sultan to see the palace.  On entering the\r\nhall with the four-and-twenty windows with their rubies, diamonds and\r\nemeralds, he cried, \"It is a world's wonder!  There is only one thing\r\nthat surprises me.  Was it by accident that one window was left\r\nunfinished?\"  \"No, sir, by design,\" returned Aladdin.  \"I wished your\r\nMajesty to have the glory of finishing this palace.\"  The Sultan was\r\npleased, and sent for the best jewelers in the city.  He showed them\r\nthe unfinished window, and bade them fit it up like the others.  \"Sir,\"\r\nreplied their spokesman, \"we cannot find jewels enough.\"  The Sultan\r\nhad his own fetched, which they soon used, but to no purpose, for in a\r\nmonth's time the work was not half done.  Aladdin knowing that their\r\ntask was vain, bade them undo their work and carry the jewels back, and\r\nthe genie finished the window at his command.  The Sultan was surprised\r\nto receive his jewels again, and visited Aladdin, who showed him the\r\nwindow finished.  The Sultan embraced him, the envious vizier meanwhile\r\nhinting that it was the work of enchantment.\r\n\r\nAladdin had won the hearts of the people by his gentle bearing.  He was\r\nmade captain of the Sultan's armies, and won several battles for him,\r\nbut remained as courteous as before, and lived thus in peace and\r\ncontent for several years.\r\n\r\nBut far away in Africa the magician remembered Aladdin, and by his\r\nmagic arts discovered that Aladdin, instead of perishing miserably in\r\nthe cave, had escaped, and had married a princess, with whom he was\r\nliving in great honour and wealth.  He knew that the poor tailor's son\r\ncould only have accomplished this by means of the lamp, and travelled\r\nnight and day till he reached the capital of China, bent on Aladdin's\r\nruin.  As he passed through the town he heard people talking everywhere\r\nabout a marvelous palace.  \"Forgive my ignorance,\" he asked, \"what is\r\nthe palace you speak of?\"  \"Have you not heard of Prince Aladdin's\r\npalace,\" was the reply, \"the greatest wonder in the world?  I will\r\ndirect you if you have a mind to see it.\"  The magician thanked him who\r\nspoke, and having seen the palace knew that it had been raised by the\r\nGenie of the Lamp, and became half mad with rage.  He determined to get\r\nhold of the lamp, and again plunge Aladdin into the deepest poverty.\r\n\r\nUnluckily, Aladdin had gone a-hunting for eight days, which gave the\r\nmagician plenty of time.  He bought a dozen lamps, put them into a\r\nbasket, and went to the palace, crying:  \"New lamps for old!\" followed\r\nby a jeering crowd.  The Princess, sitting in the hall of\r\nfour-and-twenty windows, sent a slave to find out what the noise was\r\nabout, who came back laughing, so that the Princess scolded her.\r\n\"Madam,\" replied the slave, \"who can help laughing to see an old fool\r\noffering to exchange fine new lamps for old ones?\"  Another slave,\r\nhearing this, said, \"There is an old one on the cornice there which he\r\ncan have.\"  Now this was the magic lamp, which Aladdin had left there,\r\nas he could not take it out hunting with him.  The Princess, not\r\nknowing its value, laughingly bade the slave take it and make the\r\nexchange.  She went and said to the magician:  \"Give me a new lamp for\r\nthis.\" He snatched it and bade the slave take her choice, amid the\r\njeers of the crowd.  Little he cared, but left off crying his lamps,\r\nand went out of the city gates to a lonely place, where he remained\r\ntill nightfall, when he pulled out the lamp and rubbed it.  The genie\r\nappeared, and at the magician's command carried him, together with the\r\npalace and the Princess in it, to a lonely place in Africa.\r\n\r\nNext morning the Sultan looked out of the window towards Aladdin's\r\npalace and rubbed his eyes, for it was gone.  He sent for the Vizier\r\nand asked what had become of the palace.  The Vizier looked out too,\r\nand was lost in astonishment.  He again put it down to enchantment, and\r\nthis time the Sultan believed him, and sent thirty men on horseback to\r\nfetch Aladdin back in chains.  They met him riding home, bound him, and\r\nforced him to go with them on foot.  The people, however, who loved\r\nhim, followed, armed, to see that he came to no harm.  He was carried\r\nbefore the Sultan, who ordered the executioner to cut off his head.\r\nThe executioner made Aladdin kneel down, bandaged his eyes, and raised\r\nhis scimitar to strike.  At that instant the Vizier, who saw that the\r\ncrowd had forced their way into the courtyard and were scaling the\r\nwalls to rescue Aladdin, called to the executioner to stay his hand.\r\nThe people, indeed, looked so threatening that the Sultan gave way and\r\nordered Aladdin to be unbound, and pardoned him in the sight of the\r\ncrowd.  Aladdin now begged to know what he had done.  \"False wretch!\"\r\nsaid the Sultan, \"come hither,\" and showed him from the window the\r\nplace where his palace had stood.  Aladdin was so amazed he could not\r\nsay a word.  \"Where is your palace and my daughter?\" demanded the\r\nSultan.  \"For the first I am not so deeply concerned, but my daughter I\r\nmust have, and you must find her or lose your head.\"  Aladdin begged\r\nfor forty days in which to find her, promising if he failed to return\r\nto suffer death at the Sultan's pleasure.  His prayer was granted, and\r\nhe went forth sadly from the Sultan's presence.\r\n\r\nFor three days he wandered about like a madman, asking everyone what\r\nhad become of his palace, but they only laughed and pitied him.  He\r\ncame to the banks of a river, and knelt down to say his prayers before\r\nthrowing himself in.  In doing so he rubbed the ring he still wore.\r\nThe genie he had seen in the cave appeared, and asked his will.  \"Save\r\nmy life, genie,\" said Aladdin, \"and bring my palace back.\"  \"That is\r\nnot in my power,\" said the genie; \"I am only the Slave of the Ring; you\r\nmust ask him of the lamp.\" \"Even so,\" said Aladdin, \"but thou canst\r\ntake me to the palace, and set me down under my dear wife's window.\"\r\nHe at once found himself in Africa, under the window of the Princess,\r\nand fell asleep out of sheer weariness.\r\n\r\nHe was awakened by the singing of the birds, and his heart was lighter.\r\nHe saw plainly that all his misfortunes were owning to the loss of the\r\nlamp, and vainly wondered who had robbed him of it.\r\n\r\nThat morning the Princess rose earlier than she had done since she had\r\nbeen carried into Africa by the magician, whose company she was forced\r\nto endure once a day.  She, however, treated him so harshly that he\r\ndared not live there altogether.  As she was dressing, one of her women\r\nlooked out and saw Aladdin.  The Princess ran and opened the window,\r\nand at the noise she made, Aladdin looked up.  She called to him to\r\ncome to her, and great was the joy of these lovers at seeing each other\r\nagain.  After he had kissed her Aladdin said:  \"I beg of you, Princess,\r\nin God's name, before we speak of anything else, for your own sake and\r\nmine, tell me what has become of an old lamp I left on the cornice in\r\nthe hall of four-and-twenty windows when I went a-hunting.\" \"Alas,\" she\r\nsaid, \"I am the innocent cause of our sorrows,\" and told him of the\r\nexchange of the lamp.  \"Now I know,\" cried Aladdin, \"that we have to\r\nthank the African magician for this!  Where is the lamp?\"  \"He carries\r\nit about with him,\" said the Princess.  \"I know, for he pulled it out\r\nof his breast to show me.  He wishes me to break my faith with you and\r\nmarry him, saying that you were beheaded by my father's command.  He is\r\nforever speaking ill of you, but I only reply by my tears.  If I\r\npersist, I doubt not but he will use violence.\"  Aladdin comforted her,\r\nand left her for a while.  He changed clothes with the first person he\r\nmet in the town, and having bought a certain powder returned to the\r\nPrincess, who let him in by a little side door.  \"Put on your most\r\nbeautiful dress,\" he said to her, \"and receive the magician with\r\nsmiles, leading him to believe that you have forgotten me.  Invite him\r\nto sup with you, and say you wish to taste the wine of his country.  He\r\nwill go for some, and while he is gone I will tell you what to do.\"\r\nShe listened carefully to Aladdin and when he left her, arrayed herself\r\ngaily for the first time since she left China.  She put on a girdle and\r\nhead-dress of diamonds and seeing in a glass that she was more\r\nbeautiful than ever, received the magician, saying, to his great\r\namazement:  \"I have made up my mind that Aladdin is dead, and that all\r\nmy tears will not bring him back to me, so I am resolved to mourn no\r\nmore, and have therefore invited you to sup with me; but I am tired of\r\nthe wines of China, and would fain taste those of Africa.\"  The\r\nmagician flew to his cellar, and the Princess put the powder Aladdin\r\nhad given her in her cup.  When he returned she asked him to drink her\r\nhealth in the wine of Africa, handing him her cup in exchange for his,\r\nas a sign she was reconciled to him.  Before drinking the magician made\r\nher a speech in praise of her beauty, but the Princess cut him short,\r\nsaying:  \"Let us drink first, and you shall say what you will\r\nafterwards.\"  She set her cup to her lips and kept it there, while the\r\nmagician drained his to the dregs and fell back lifeless.  The Princess\r\nthen opened the door to Aladdin, and flung her arms around his neck;\r\nbut Aladdin went to the dead magician, took the lamp out of his vest,\r\nand bade the genie carry the palace and all in it back to China.  This\r\nwas done, and the Princess in her chamber felt only two little shocks,\r\nand little thought she was home again.\r\n\r\nThe Sultan, who was sitting in his closet, mourning for his lost\r\ndaughter, happened to look up, and rubbed his eyes, for there stood the\r\npalace as before!  He hastened thither, and Aladdin received him in the\r\nhall of the four-and-twenty windows, with the Princess at his side.\r\nAladdin told him what had happened, and showed him the dead body of the\r\nmagician, that he might believe.  A ten days' feast was proclaimed, and\r\nit seemed as if Aladdin might now live the rest of his life in peace;\r\nbut it was not meant to be.\r\n\r\nThe African magician had a younger brother, who was, if possible, more\r\nwicked and more cunning than himself.  He travelled to China to avenge\r\nhis brother's death, and went to visit a pious woman called Fatima,\r\nthinking she might be of use to him.  He entered her cell and clapped a\r\ndagger to her breast, telling her to rise and do his bidding on pain of\r\ndeath.  He changed clothes with her, coloured his face like hers, put\r\non her veil, and murdered her, that she might tell no tales.  Then he\r\nwent towards the palace of Aladdin, and all the people, thinking he was\r\nthe holy woman, gathered round him, kissing his hands and begging his\r\nblessing.  When he got to the palace there was such a noise going on\r\nround him that the Princess bade her slave look out the window and ask\r\nwhat was the matter.  The slave said it was the holy woman, curing\r\npeople by her touch of their ailments, whereupon the Princess, who had\r\nlong desired to see Fatima, sent for her.  On coming to the Princess\r\nthe magician offered up a prayer for her health and prosperity.  When\r\nhe had done the Princess made him sit by her, and begged him to stay\r\nwith her always.  The false Fatima, who wished for nothing better,\r\nconsented, but kept his veil down for fear of discovery.  The princess\r\nshowed him the hall, and asked him what he thought of it.  \"It is truly\r\nbeautiful,\" said the false Fatima.  \"In my mind it wants but one\r\nthing.\"  \"And what is that?\" said the Princess.  \"If only a roc's egg,\"\r\nreplied he, \"were hung up from the middle of this dome, it would be the\r\nwonder of the world.\"\r\n\r\nAfter this the Princess could think of nothing but the roc's egg, and\r\nwhen Aladdin returned from hunting he found her in a very ill humour.\r\nHe begged to know what was amiss, and she told him that all her\r\npleasure in the hall was spoilt for want of a roc's egg hanging from\r\nthe dome.  \"If that is all,\" replied Aladdin, \"you shall soon be\r\nhappy.\"  He left her and rubbed the lamp, and when the genie appeared\r\ncommanded him to bring a roc's egg.  The genie gave such a loud and\r\nterrible shriek that the hall shook.\r\n\r\n\"Wretch!\" he cried, \"is it not enough that I have done everything for\r\nyou, but you must command me to bring my master and hang him up in the\r\nmidst of this dome?  You and your wife and your palace deserve to be\r\nburnt to ashes, but that this request does not come from you, but from\r\nthe brother of the African magician, whom you destroyed.  He is now in\r\nyour palace disguised as the holy woman, whom he murdered.  He it was\r\nwho put that wish into your wife's head.  Take care of yourself, for he\r\nmeans to kill you.\"  So saying, the genie disappeared.\r\n\r\nAladdin went back to the Princess, saying his head ached, and\r\nrequesting that the holy Fatima should be fetched to lay her hands on\r\nit.  But when the magician came near, Aladdin, seizing his dagger,\r\npierced him to the heart.  \"What have you done?\" cried the Princess.\r\n\"You have killed the holy woman!\"  \"Not so,\" replied Aladdin, \"but a\r\nwicked magician,\" and told her of how she had been deceived.\r\n\r\nAfter this Aladdin and his wife lived in peace.  He succeeded the\r\nSultan when he died, and reigned for many years, leaving behind him a\r\nlong line of kings.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nEnd of the Project Gutenberg EBook of Aladdin and the Magic Lamp, by Unknown\r\n",
    "textIndexes": {
        "header": 17,
        "footer": 491
    },
    "buildPath": "./json//pg57.json",
    "wordcount": 5353
}