{
    "id": "6",
    "formats": [
        {
            "format": "application/epub+zip",
            "fileName": "6.epub.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/6.epub.noimages",
            "extension": "noimages"
        },
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "6.kindle.images",
            "filePath": "http://www.gutenberg.org/ebooks/6.kindle.images",
            "extension": "images"
        },
        {
            "format": "text/plain; charset=us-ascii",
            "fileName": "6/6.zip",
            "filePath": "http://www.gutenberg.org/files/6/6.zip",
            "extension": "zip"
        },
        {
            "format": "application/rdf+xml",
            "fileName": "6.rdf",
            "filePath": "http://www.gutenberg.org/ebooks/6.rdf",
            "extension": "rdf"
        },
        {
            "format": "text/plain",
            "fileName": "6.txt.utf-8",
            "filePath": "http://www.gutenberg.org/ebooks/6.txt.utf-8",
            "extension": "utf-8"
        },
        {
            "format": "application/epub+zip",
            "fileName": "6.epub.images",
            "filePath": "http://www.gutenberg.org/ebooks/6.epub.images",
            "extension": "images"
        },
        {
            "format": "text/html",
            "fileName": "6/6-h.zip",
            "filePath": "http://www.gutenberg.org/files/6/6-h.zip",
            "extension": "zip"
        },
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "6.kindle.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/6.kindle.noimages",
            "extension": "noimages"
        },
        {
            "format": "text/html",
            "fileName": "6/6-h/6-h.htm",
            "filePath": "http://www.gutenberg.org/files/6/6-h/6-h.htm",
            "extension": "htm"
        },
        {
            "format": "text/plain; charset=us-ascii",
            "fileName": "6/6.txt",
            "filePath": "http://www.gutenberg.org/files/6/6.txt",
            "extension": "txt"
        }
    ],
    "languages": [
        "en"
    ],
    "title": [
        "Give Me Liberty or Give Me Death"
    ],
    "author": "Henry, Patrick",
    "issued": "1976-12-01",
    "text": "*These Etexts Prepared By Hundreds of Volunteers and Donations*\r\n\r\n\r\nThe Project Gutenberg Etext of Give Me Liberty Or Give Me Death\r\n\r\n******This file should be named 6.txt or 6.zip*****\r\n\r\nDecember, 1975  [Etext #6]\r\n[Date last updated: May 5, 2005]\r\n\r\nOfficially released in December 1975, unofficially released for\r\nthe 200th anniversary of the speech by Patrick Henry before the\r\n\"House\" as he referred to it. [Which was the Virgina Provincial\r\nConvention, March 23, 1775]\r\n\r\nWe apologize for the fact that the legal small print is longer,\r\nand more complicated, than the Etext itself; our legal beagles,\r\nof whom there are now a half dozen or so, insist this must be a\r\npart of any Project Gutenberg Etext we post, for our protection\r\nfrom the rest of the legal beagles out there.  The US has twice\r\nas many lawyers as the rest of the world combined!\r\n\r\nYou are free to delete the headers and just keep the Etexts, we\r\nare not free not to post it this way.  Again my apologies.  The\r\nnormal Project Gutenberg blurb has been deleted, you can get it\r\nin this location in most Project Gutenberg Etexts.  Thanks,  mh\r\n\r\n\r\n\r\n***START**THE SMALL PRINT!**FOR PUBLIC DOMAIN ETEXTS**START***\r\nWhy is this \"Small Print!\" statement here?  You know: lawyers.\r\nThey tell us you might sue us if there is something wrong with\r\nyour copy of this etext, even if you got it for free from\r\nsomeone other than us, and even if what's wrong is not our\r\nfault.  So, among other things, this \"Small Print!\" statement\r\ndisclaims most of our liability to you.  It also tells you how\r\nyou can distribute copies of this etext if you want to.\r\n\r\n*BEFORE!* YOU USE OR READ THIS ETEXT\r\nBy using or reading any part of this PROJECT GUTENBERG-tm\r\netext, you indicate that you understand, agree to and accept\r\nthis \"Small Print!\" statement.  If you do not, you can receive\r\na refund of the money (if any) you paid for this etext by\r\nsending a request within 30 days of receiving it to the person\r\nyou got it from.  If you received this etext on a physical\r\nmedium (such as a disk), you must return it with your request.\r\n\r\nABOUT PROJECT GUTENBERG-TM ETEXTS\r\nThis PROJECT GUTENBERG-tm etext, like most PROJECT GUTENBERG-\r\ntm etexts, is a \"public domain\" work distributed by Professor\r\nMichael S. Hart through the Project Gutenberg Association at\r\nIllinois Benedictine College (the \"Project\").  Among other\r\nthings, this means that no one owns a United States copyright\r\non or for this work, so the Project (and you!) can copy and\r\ndistribute it in the United States without permission and\r\nwithout paying copyright royalties.  Special rules, set forth\r\nbelow, apply if you wish to copy and distribute this etext\r\nunder the Project's \"PROJECT GUTENBERG\" trademark.\r\n\r\nTo create these etexts, the Project expends considerable\r\nefforts to identify, transcribe and proofread public domain\r\nworks.  Despite these efforts, the Project's etexts and any\r\nmedium they may be on may contain \"Defects\".  Among other\r\nthings, Defects may take the form of incomplete, inaccurate or\r\ncorrupt data, transcription errors, a copyright or other\r\nintellectual property infringement, a defective or damaged\r\ndisk or other etext medium, a computer virus, or computer\r\ncodes that damage or cannot be read by your equipment.\r\n\r\nLIMITED WARRANTY; DISCLAIMER OF DAMAGES\r\nBut for the \"Right of Replacement or Refund\" described below,\r\n[1] the Project (and any other party you may receive this\r\netext from as a PROJECT GUTENBERG-tm etext) disclaims all\r\nliability to you for damages, costs and expenses, including\r\nlegal fees, and [2] YOU HAVE NO REMEDIES FOR NEGLIGENCE OR\r\nUNDER STRICT LIABILITY, OR FOR BREACH OF WARRANTY OR CONTRACT,\r\nINCLUDING BUT NOT LIMITED TO INDIRECT, CONSEQUENTIAL, PUNITIVE\r\nOR INCIDENTAL DAMAGES, EVEN IF YOU GIVE NOTICE OF THE\r\nPOSSIBILITY OF SUCH DAMAGES.\r\n\r\nIf you discover a Defect in this etext within 90 days of\r\nreceiving it, you can receive a refund of the money (if any)\r\nyou paid for it by sending an explanatory note within that\r\ntime to the person you received it from.  If you received it\r\non a physical medium, you must return it with your note, and\r\nsuch person may choose to alternatively give you a replacement\r\ncopy.  If you received it electronically, such person may\r\nchoose to alternatively give you a second opportunity to\r\nreceive it electronically.\r\n\r\nTHIS ETEXT IS OTHERWISE PROVIDED TO YOU \"AS-IS\".  NO OTHER\r\nWARRANTIES OF ANY KIND, EXPRESS OR IMPLIED, ARE MADE TO YOU AS\r\nTO THE ETEXT OR ANY MEDIUM IT MAY BE ON, INCLUDING BUT NOT\r\nLIMITED TO WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A\r\nPARTICULAR PURPOSE.\r\n\r\nSome states do not allow disclaimers of implied warranties or\r\nthe exclusion or limitation of consequential damages, so the\r\nabove disclaimers and exclusions may not apply to you, and you\r\nmay have other legal rights.\r\n\r\nINDEMNITY\r\nYou will indemnify and hold the Project, its directors,\r\nofficers, members and agents harmless from all liability, cost\r\nand expense, including legal fees, that arise directly or\r\nindirectly from any of the following that you do or cause:\r\n[1] distribution of this etext, [2] alteration, modification,\r\nor addition to the etext, or [3] any Defect.\r\n\r\nDISTRIBUTION UNDER \"PROJECT GUTENBERG-tm\"\r\nYou may distribute copies of this etext electronically, or by\r\ndisk, book or any other medium if you either delete this\r\n\"Small Print!\" and all other references to Project Gutenberg,\r\nor:\r\n\r\n[1]  Only give exact copies of it.  Among other things, this\r\n     requires that you do not remove, alter or modify the\r\n     etext or this \"small print!\" statement.  You may however,\r\n     if you wish, distribute this etext in machine readable\r\n     binary, compressed, mark-up, or proprietary form,\r\n     including any form resulting from conversion by word pro-\r\n     cessing or hypertext software, but only so long as\r\n     *EITHER*:\r\n\r\n     [*]  The etext, when displayed, is clearly readable, and\r\n          does *not* contain characters other than those\r\n          intended by the author of the work, although tilde\r\n          (~), asterisk (*) and underline (_) characters may\r\n          be used to convey punctuation intended by the\r\n          author, and additional characters may be used to\r\n          indicate hypertext links; OR\r\n\r\n     [*]  The etext may be readily converted by the reader at\r\n          no expense into plain ASCII, EBCDIC or equivalent\r\n          form by the program that displays the etext (as is\r\n          the case, for instance, with most word processors);\r\n          OR\r\n\r\n     [*]  You provide, or agree to also provide on request at\r\n          no additional cost, fee or expense, a copy of the\r\n          etext in its original plain ASCII form (or in EBCDIC\r\n          or other equivalent proprietary form).\r\n\r\n[2]  Honor the etext refund and replacement provisions of this\r\n     \"Small Print!\" statement.\r\n\r\n[3]  Pay a trademark license fee to the Project of 20% of the\r\n     net profits you derive calculated using the method you\r\n     already use to calculate your applicable taxes.  If you\r\n     don't derive profits, no royalty is due.  Royalties are\r\n     payable to \"Project Gutenberg Association / Illinois\r\n     Benedictine College\" within the 60 days following each\r\n     date you prepare (or were legally required to prepare)\r\n     your annual (or equivalent periodic) tax return.\r\n\r\nWHAT IF YOU *WANT* TO SEND MONEY EVEN IF YOU DON'T HAVE TO?\r\nThe Project gratefully accepts contributions in money, time,\r\nscanning machines, OCR software, public domain etexts, royalty\r\nfree copyright licenses, and every other sort of contribution\r\nyou can think of.  Money should be paid to \"Project Gutenberg\r\nAssociation / Illinois Benedictine College\".\r\n\r\nThis \"Small Print!\" by Charles B. Kramer, Attorney\r\nInternet (72600.2026@compuserve.com); TEL: (212-254-5093)\r\n*END*THE SMALL PRINT! FOR PUBLIC DOMAIN ETEXTS*Ver.04.29.93*END*\r\n\r\n\r\nAll of the original Project Gutenberg Etexts from the\r\n1970's were produced in ALL CAPS, no lower case.  The\r\ncomputers we used then didn't have lower case at all.\r\n\r\n***\r\n\r\nThese original Project Gutenberg Etexts will be compiled into a file\r\ncontaining them all, in order to improve the content ratios of Etext\r\nto header material.\r\n\r\n***\r\n\r\n\r\nGive Me Liberty Or Give Me Death\r\n\r\n\r\nPatrick Henry, March 23, 1775.\r\n\r\n\r\nNo man thinks more highly than I do of the patriotism, as well as abilities,\r\nof the very worthy gentlemen who have just addressed the House.  But different\r\nmen often see the same subject in different lights; and, therefore, I hope it\r\nwill not be thought disrespectful to those gentlemen if, entertaining as I do\r\nopinions of a character very opposite to theirs, I shall speak forth my\r\nsentiments freely and without reserve.  This is no time for ceremony.\r\nThe question before the House is one of awful moment to this country.\r\nFor my own part, I consider it as nothing less than a question of\r\nfreedom or slavery; and in proportion to the magnitude of the subject\r\nought to be the freedom of the debate.  It is only in this way that\r\nwe can hope to arrive at truth, and fulfill the great responsibility\r\nwhich we hold to God and our country.  Should I keep back my opinions\r\nat such a time, through fear of giving offense, I should consider myself\r\nas guilty of treason towards my country, and of an act of disloyalty\r\ntoward the Majesty of Heaven, which I revere above all earthly kings.\r\n\r\nMr. President, it is natural to man to indulge in the illusions of hope.\r\nWe are apt to shut our eyes against a painful truth, and listen to the\r\nsong of that siren till she transforms us into beasts.  Is this the part\r\nof wise men, engaged in a great and arduous struggle for liberty?\r\nAre we disposed to be of the number of those who, having eyes, see not,\r\nand, having ears, hear not, the things which so nearly concern their\r\ntemporal salvation?  For my part, whatever anguish of spirit it may cost,\r\nI am willing to know the whole truth; to know the worst, and to provide for it.\r\n\r\nI have but one lamp by which my feet are guided, and that is the lamp of\r\nexperience.  I know of no way of judging of the future but by the past.\r\nAnd judging by the past, I wish to know what there has been in the conduct\r\nof the British ministry for the last ten years to justify those hopes with\r\nwhich  gentlemen have been pleased to solace themselves and the House.\r\nIs it that insidious smile with which our petition has been lately received?\r\nTrust it not, sir; it will prove a snare to your feet.  Suffer not yourselves\r\nto be betrayed with a kiss.  Ask yourselves how this gracious reception of our\r\npetition comports with those warlike preparations which cover our waters and\r\ndarken our land.  Are fleets and armies necessary to a work of love and\r\nreconciliation?  Have we shown ourselves so unwilling to be reconciled that\r\nforce must be called in to win back our love?  Let us not deceive ourselves,\r\nsir.  These are the implements of war and subjugation; the last arguments to\r\nwhich kings resort.  I ask gentlemen, sir, what means this martial array, if\r\nits purpose be not to force us to submission?  Can gentlemen assign any other\r\npossible motive for it?  Has Great Britain any enemy, in this quarter of\r\nthe world, to call for all this accumulation of navies and armies?  No, sir,\r\nshe has none.  They are meant for us:  they can be meant for no other.\r\nThey are sent over to bind and rivet upon us those chains which the British\r\nministry have been so long forging.  And what have we to oppose to them?\r\nShall we try argument?  Sir, we have been trying that for the last ten years.\r\nHave we anything new to offer upon the subject?  Nothing.  We have held the\r\nsubject up in every light of which it is capable; but it has been all in vain.\r\nShall we resort to entreaty and humble supplication?  What terms shall we\r\nfind which have not been already exhausted?  Let us not, I beseech you, sir,\r\ndeceive ourselves.  Sir, we have done everything that could be done to avert\r\nthe storm which is now coming on.  We have petitioned; we have remonstrated;\r\nwe have supplicated; we have prostrated ourselves before the throne, and have\r\nimplored its interposition to arrest the tyrannical hands of the ministry and\r\nParliament.  Our petitions have been slighted; our remonstrances have produced\r\nadditional violence and insult; our supplications have been disregarded;\r\nand we have been spurned, with contempt, from the foot of the throne!\r\nIn vain, after these things, may we indulge the fond hope of peace and\r\nreconciliation.  There is no longer any room for hope.  If we wish to be free--\r\nif we mean to preserve inviolate those inestimable privileges for which\r\nwe have been so long contending--if we mean not basely to abandon the noble\r\nstruggle in which we have been so long engaged, and which we have pledged\r\nourselves never to abandon until the glorious object of our contest\r\nshall be obtained--we must fight!  I repeat it, sir, we must fight!\r\nAn appeal to arms  and to the God of hosts is all that is left us!\r\n\r\nThey tell us, sir, that we are weak; unable to cope with so formidable\r\nan adversary.  But when shall we be stronger?  Will it be the next week,\r\nor the next year?  Will it be when we are totally disarmed, and when a British\r\nguard shall be stationed in every house?  Shall we gather strength by\r\nirresolution and inaction?  Shall we acquire the means of effectual resistance\r\nby lying supinely on our backs and hugging the delusive phantom of hope, until\r\nour enemies shall have bound us hand and foot?  Sir, we are not weak if we make\r\na proper use of those means which the God of nature hath placed in our power.\r\nThe millions of people, armed in the holy cause of liberty, and in such a\r\ncountry as that which we possess, are invincible by any force which our enemy\r\ncan send against us.  Besides, sir, we shall not fight our battles alone.\r\nThere is a just God who presides over the destinies of nations, and who will\r\nraise up friends to fight our battles for us.  The battle, sir, is not to the\r\nstrong alone; it is to the vigilant, the active, the brave.  Besides, sir,\r\nwe have no election.  If we were base enough to desire it, it is now too late\r\nto retire from the contest.  There is no retreat but in submission and slavery!\r\nOur chains are forged!  Their clanking may be heard on the plains of Boston!\r\nThe war is inevitable--and let it come!  I repeat it, sir, let it come.\r\n\r\nIt is in vain, sir, to extenuate the matter.  Gentlemen may cry, Peace, Peace--\r\nbut there is no peace.  The war is actually begun!  The next gale that sweeps\r\nfrom the north will bring to our ears the clash of resounding arms!\r\nOur brethren are already in the field!  Why stand we here idle?\r\nWhat is it that gentlemen wish?  What would they have?  Is life so dear,\r\nor peace so sweet, as to be purchased at the price of chains and slavery?\r\nForbid it, Almighty God!  I know not what course others may take;\r\nbut as for me, give me liberty or give me death!\r\n",
    "textIndexes": {
        "header": 4,
        "footer": 284
    },
    "buildPath": "./json//pg6.json",
    "wordcount": 2541
}