{
    "id": "72",
    "formats": [
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "72.kindle.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/72.kindle.noimages",
            "extension": "noimages"
        },
        {
            "format": "application/rdf+xml",
            "fileName": "72.rdf",
            "filePath": "http://www.gutenberg.org/ebooks/72.rdf",
            "extension": "rdf"
        },
        {
            "format": "application/epub+zip",
            "fileName": "72.epub.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/72.epub.noimages",
            "extension": "noimages"
        },
        {
            "format": "text/plain",
            "fileName": "72.txt.utf-8",
            "filePath": "http://www.gutenberg.org/ebooks/72.txt.utf-8",
            "extension": "utf-8"
        },
        {
            "format": "application/epub+zip",
            "fileName": "72.epub.images",
            "filePath": "http://www.gutenberg.org/ebooks/72.epub.images",
            "extension": "images"
        },
        {
            "format": "text/plain; charset=us-ascii",
            "fileName": "72/72.txt",
            "filePath": "http://www.gutenberg.org/files/72/72.txt",
            "extension": "txt"
        },
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "72.kindle.images",
            "filePath": "http://www.gutenberg.org/ebooks/72.kindle.images",
            "extension": "images"
        },
        {
            "format": "application/zip",
            "fileName": "72/72-h.zip",
            "filePath": "http://www.gutenberg.org/files/72/72-h.zip",
            "extension": "zip"
        },
        {
            "format": "text/html; charset=iso-8859-1",
            "fileName": "72/72-h/72-h.htm",
            "filePath": "http://www.gutenberg.org/files/72/72-h/72-h.htm",
            "extension": "htm"
        },
        {
            "format": "application/zip",
            "fileName": "72/72.zip",
            "filePath": "http://www.gutenberg.org/files/72/72.zip",
            "extension": "zip"
        }
    ],
    "languages": [
        "en"
    ],
    "title": [
        "Thuvia, Maid of Mars"
    ],
    "author": "Burroughs, Edgar Rice",
    "issued": "1993-07-01",
    "text": "*** START OF THIS PROJECT GUTENBERG EBOOK THUVIA, MAID OF MARS ***\r\n\r\n\r\n\r\n\r\nProduced by Judith Boss and Charles Keller.  HTML version by Al Haines.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nThuvia, Maid of Mars\r\n\r\n\r\nBy\r\n\r\nEdgar Rice Burroughs\r\n\r\n\r\n\r\n\r\n             CONTENTS\r\n\r\n CHAPTER\r\n\r\n    I  Carthoris and Thuvia\r\n   II  Slavery\r\n  III  Treachery\r\n   IV  A Green Man's Captive\r\n    V  The Fair Race\r\n   VI  The Jeddak of Lothar\r\n  VII  The Phantom Bowmen\r\n VIII  The Hall of Doom\r\n   IX  The Battle in the Plain\r\n    X  Kar Komak, the Bowman\r\n   XI  Green Men and White Apes\r\n  XII  To Save Dusar\r\n XIII  Turjun, the Panthan\r\n  XIV  Kulan Tith's Sacrifice\r\n       Glossary of Names and Terms\r\n\r\n\r\n\r\n\r\nTHUVIA, MAID OF MARS\r\n\r\n\r\nCHAPTER I\r\n\r\nCARTHORIS AND THUVIA\r\n\r\n\r\nUpon a massive bench of polished ersite beneath the gorgeous blooms\r\nof a giant pimalia a woman sat.  Her shapely, sandalled foot tapped\r\nimpatiently upon the jewel-strewn walk that wound beneath the\r\nstately sorapus trees across the scarlet sward of the royal gardens\r\nof Thuvan Dihn, Jeddak of Ptarth, as a dark-haired, red-skinned\r\nwarrior bent low toward her, whispering heated words close to her\r\near.\r\n\r\n\"Ah, Thuvia of Ptarth,\" he cried, \"you are cold even before the\r\nfiery blasts of my consuming love!  No harder than your heart, nor\r\ncolder is the hard, cold ersite of this thrice happy bench which\r\nsupports your divine and fadeless form!  Tell me, O Thuvia of\r\nPtarth, that I may still hope--that though you do not love me now,\r\nyet some day, some day, my princess, I--\"\r\n\r\nThe girl sprang to her feet with an exclamation of surprise and\r\ndispleasure.  Her queenly head was poised haughtily upon her smooth\r\nred shoulders.  Her dark eyes looked angrily into those of the man.\r\n\r\n\"You forget yourself, and the customs of Barsoom, Astok,\" she said.\r\n\"I have given you no right thus to address the daughter of Thuvan\r\nDihn, nor have you won such a right.\"\r\n\r\nThe man reached suddenly forth and grasped her by the arm.\r\n\r\n\"You shall be my princess!\" he cried.  \"By the breast of Issus, thou\r\nshalt, nor shall any other come between Astok, Prince of Dusar,\r\nand his heart's desire.  Tell me that there is another, and I shall\r\ncut out his foul heart and fling it to the wild calots of the dead\r\nsea-bottoms!\"\r\n\r\nAt touch of the man's hand upon her flesh the girl went pallid\r\nbeneath her coppery skin, for the persons of the royal women of\r\nthe courts of Mars are held but little less than sacred.  The act\r\nof Astok, Prince of Dusar, was profanation.  There was no terror\r\nin the eyes of Thuvia of Ptarth--only horror for the thing the man\r\nhad done and for its possible consequences.\r\n\r\n\"Release me.\"  Her voice was level--frigid.\r\n\r\nThe man muttered incoherently and drew her roughly toward him.\r\n\r\n\"Release me!\" she repeated sharply, \"or I call the guard, and the\r\nPrince of Dusar knows what that will mean.\"\r\n\r\nQuickly he threw his right arm about her shoulders and strove to\r\ndraw her face to his lips.  With a little cry she struck him full\r\nin the mouth with the massive bracelets that circled her free arm.\r\n\r\n\"Calot!\" she exclaimed, and then:  \"The guard!  The guard!  Hasten\r\nin protection of the Princess of Ptarth!\"\r\n\r\nIn answer to her call a dozen guardsmen came racing across the\r\nscarlet sward, their gleaming long-swords naked in the sun, the\r\nmetal of their accoutrements clanking against that of their leathern\r\nharness, and in their throats hoarse shouts of rage at the sight\r\nwhich met their eyes.\r\n\r\nBut before they had passed half across the royal garden to where\r\nAstok of Dusar still held the struggling girl in his grasp, another\r\nfigure sprang from a cluster of dense foliage that half hid a golden\r\nfountain close at hand.  A tall, straight youth he was, with black\r\nhair and keen grey eyes; broad of shoulder and narrow of hip; a\r\nclean-limbed fighting man.  His skin was but faintly tinged with\r\nthe copper colour that marks the red men of Mars from the other\r\nraces of the dying planet--he was like them, and yet there was a\r\nsubtle difference greater even than that which lay in his lighter\r\nskin and his grey eyes.\r\n\r\nThere was a difference, too, in his movements.  He came on in great\r\nleaps that carried him so swiftly over the ground that the speed\r\nof the guardsmen was as nothing by comparison.\r\n\r\nAstok still clutched Thuvia's wrist as the young warrior confronted\r\nhim.  The new-comer wasted no time and he spoke but a single word.\r\n\r\n\"Calot!\" he snapped, and then his clenched fist landed beneath the\r\nother's chin, lifting him high into the air and depositing him in\r\na crumpled heap within the centre of the pimalia bush beside the\r\nersite bench.\r\n\r\nHer champion turned toward the girl.  \"Kaor, Thuvia of Ptarth!\" he\r\ncried.  \"It seems that fate timed my visit well.\"\r\n\r\n\"Kaor, Carthoris of Helium!\" the princess returned the young man's\r\ngreeting, \"and what less could one expect of the son of such a\r\nsire?\"\r\n\r\nHe bowed his acknowledgment of the compliment to his father, John\r\nCarter, Warlord of Mars.  And then the guardsmen, panting from\r\ntheir charge, came up just as the Prince of Dusar, bleeding at the\r\nmouth, and with drawn sword, crawled from the entanglement of the\r\npimalia.\r\n\r\nAstok would have leaped to mortal combat with the son of Dejah\r\nThoris, but the guardsmen pressed about him, preventing, though it\r\nwas clearly evident that naught would have better pleased Carthoris\r\nof Helium.\r\n\r\n\"But say the word, Thuvia of Ptarth,\" he begged, \"and naught will\r\ngive me greater pleasure than meting to this fellow the punishment\r\nhe has earned.\"\r\n\r\n\"It cannot be, Carthoris,\" she replied.  \"Even though he has forfeited\r\nall claim upon my consideration, yet is he the guest of the jeddak,\r\nmy father, and to him alone may he account for the unpardonable\r\nact he has committed.\"\r\n\r\n\"As you say, Thuvia,\" replied the Heliumite.  \"But afterward he\r\nshall account to Carthoris, Prince of Helium, for this affront to\r\nthe daughter of my father's friend.\" As he spoke, though, there\r\nburned in his eyes a fire that proclaimed a nearer, dearer cause\r\nfor his championship of this glorious daughter of Barsoom.\r\n\r\nThe maid's cheek darkened beneath the satin of her transparent skin,\r\nand the eyes of Astok, Prince of Dusar, darkened, too, as he read\r\nthat which passed unspoken between the two in the royal gardens of\r\nthe jeddak.\r\n\r\n\"And thou to me,\" he snapped at Carthoris, answering the young\r\nman's challenge.\r\n\r\nThe guard still surrounded Astok.  It was a difficult position for\r\nthe young officer who commanded it.  His prisoner was the son of a\r\nmighty jeddak; he was the guest of Thuvan Dihn--until but now an\r\nhonoured guest upon whom every royal dignity had been showered.\r\nTo arrest him forcibly could mean naught else than war, and yet he\r\nhad done that which in the eyes of the Ptarth warrior merited death.\r\n\r\nThe young man hesitated.  He looked toward his princess.  She, too,\r\nguessed all that hung upon the action of the coming moment.  For\r\nmany years Dusar and Ptarth had been at peace with each other.\r\nTheir great merchant ships plied back and forth between the larger\r\ncities of the two nations.  Even now, far above the gold-shot\r\nscarlet dome of the jeddak's palace, she could see the huge bulk\r\nof a giant freighter taking its majestic way through the thin\r\nBarsoomian air toward the west and Dusar.\r\n\r\nBy a word she might plunge these two mighty nations into a bloody\r\nconflict that would drain them of their bravest blood and their\r\nincalculable riches, leaving them all helpless against the inroads\r\nof their envious and less powerful neighbors, and at last a prey\r\nto the savage green hordes of the dead sea-bottoms.\r\n\r\nNo sense of fear influenced her decision, for fear is seldom known\r\nto the children of Mars.  It was rather a sense of the responsibility\r\nthat she, the daughter of their jeddak, felt for the welfare of\r\nher father's people.\r\n\r\n\"I called you, Padwar,\" she said to the lieutenant of the guard,\r\n\"to protect the person of your princess, and to keep the peace\r\nthat must not be violated within the royal gardens of the jeddak.\r\nThat is all.  You will escort me to the palace, and the Prince of\r\nHelium will accompany me.\"\r\n\r\nWithout another glance in the direction of Astok she turned, and\r\ntaking Carthoris' proffered hand, moved slowly toward the massive\r\nmarble pile that housed the ruler of Ptarth and his glittering\r\ncourt.  On either side marched a file of guardsmen.  Thus Thuvia\r\nof Ptarth found a way out of a dilemma, escaping the necessity\r\nof placing her father's royal guest under forcible restraint, and\r\nat the same time separating the two princes, who otherwise would\r\nhave been at each other's throat the moment she and the guard had\r\ndeparted.\r\n\r\nBeside the pimalia stood Astok, his dark eyes narrowed to mere slits\r\nof hate beneath his lowering brows as he watched the retreating\r\nforms of the woman who had aroused the fiercest passions of his\r\nnature and the man whom he now believed to be the one who stood\r\nbetween his love and its consummation.\r\n\r\nAs they disappeared within the structure Astok shrugged his shoulders,\r\nand with a murmured oath crossed the gardens toward another wing\r\nof the building where he and his retinue were housed.\r\n\r\nThat night he took formal leave of Thuvan Dihn, and though no\r\nmention was made of the happening within the garden, it was plain\r\nto see through the cold mask of the jeddak's courtesy that only\r\nthe customs of royal hospitality restrained him from voicing the\r\ncontempt he felt for the Prince of Dusar.\r\n\r\nCarthoris was not present at the leave-taking, nor was Thuvia.  The\r\nceremony was as stiff and formal as court etiquette could make it,\r\nand when the last of the Dusarians clambered over the rail of the\r\nbattleship that had brought them upon this fateful visit to the\r\ncourt of Ptarth, and the mighty engine of destruction had risen\r\nslowly from the ways of the landing-stage, a note of relief was\r\napparent in the voice of Thuvan Dihn as he turned to one of his\r\nofficers with a word of comment upon a subject foreign to that\r\nwhich had been uppermost in the minds of all for hours.\r\n\r\nBut, after all, was it so foreign?\r\n\r\n\"Inform Prince Sovan,\" he directed, \"that it is our wish that the\r\nfleet which departed for Kaol this morning be recalled to cruise\r\nto the west of Ptarth.\"\r\n\r\nAs the warship, bearing Astok back to the court of his father,\r\nturned toward the west, Thuvia of Ptarth, sitting upon the same\r\nbench where the Prince of Dusar had affronted her, watched the\r\ntwinkling lights of the craft growing smaller in the distance.\r\nBeside her, in the brilliant light of the nearer moon, sat Carthoris.\r\nHis eyes were not upon the dim bulk of the battleship, but on the\r\nprofile of the girl's upturned face.\r\n\r\n\"Thuvia,\" he whispered.\r\n\r\nThe girl turned her eyes toward his.  His hand stole out to find\r\nhers, but she drew her own gently away.\r\n\r\n\"Thuvia of Ptarth, I love you!\" cried the young warrior.  \"Tell me\r\nthat it does not offend.\"\r\n\r\nShe shook her head sadly.  \"The love of Carthoris of Helium,\" she\r\nsaid simply, \"could be naught but an honour to any woman; but you\r\nmust not speak, my friend, of bestowing upon me that which I may\r\nnot reciprocate.\"\r\n\r\nThe young man got slowly to his feet.  His eyes were wide in\r\nastonishment.  It never had occurred to the Prince of Helium that\r\nThuvia of Ptarth might love another.\r\n\r\n\"But at Kadabra!\" he exclaimed.  \"And later here at your father's\r\ncourt, what did you do, Thuvia of Ptarth, that might have warned\r\nme that you could not return my love?\"\r\n\r\n\"And what did I do, Carthoris of Helium,\" she returned, \"that might\r\nlead you to believe that I DID return it?\"\r\n\r\nHe paused in thought, and then shook his head.  \"Nothing, Thuvia,\r\nthat is true; yet I could have sworn you loved me.  Indeed, you\r\nwell knew how near to worship has been my love for you.\"\r\n\r\n\"And how might I know it, Carthoris?\" she asked innocently.  \"Did\r\nyou ever tell me as much?  Ever before have words of love for me\r\nfallen from your lips?\"\r\n\r\n\"But you MUST have known it!\" he exclaimed.  \"I am like my\r\nfather--witless in matters of the heart, and of a poor way with\r\nwomen; yet the jewels that strew these royal garden paths--the\r\ntrees, the flowers, the sward--all must have read the love that has\r\nfilled my heart since first my eyes were made new by imaging your\r\nperfect face and form; so how could you alone have been blind to\r\nit?\"\r\n\r\n\"Do the maids of Helium pay court to their men?\" asked Thuvia.\r\n\r\n\"You are playing with me!\" exclaimed Carthoris.  \"Say that you are\r\nbut playing, and that after all you love me, Thuvia!\"\r\n\r\n\"I cannot tell you that, Carthoris, for I am promised to another.\"\r\n\r\nHer tone was level, but was there not within it the hint of an\r\ninfinite depth of sadness?  Who may say?\r\n\r\n\"Promised to another?\"  Carthoris scarcely breathed the words.  His\r\nface went almost white, and then his head came up as befitted him\r\nin whose veins flowed the blood of the overlord of a world.\r\n\r\n\"Carthoris of Helium wishes you every happiness with the man of\r\nyour choice,\" he said.  \"With--\" and then he hesitated, waiting\r\nfor her to fill in the name.\r\n\r\n\"Kulan Tith, Jeddak of Kaol,\" she replied.  \"My father's friend\r\nand Ptarth's most puissant ally.\"\r\n\r\nThe young man looked at her intently for a moment before he spoke\r\nagain.\r\n\r\n\"You love him, Thuvia of Ptarth?\" he asked.\r\n\r\n\"I am promised to him,\" she replied simply.\r\n\r\nHe did not press her.  \"He is of Barsoom's noblest blood and mightiest\r\nfighters,\" mused Carthoris.  \"My father's friend and mine--would\r\nthat it might have been another!\" he muttered almost savagely.  What\r\nthe girl thought was hidden by the mask of her expression, which\r\nwas tinged only by a little shadow of sadness that might have been\r\nfor Carthoris, herself, or for them both.\r\n\r\nCarthoris of Helium did not ask, though he noted it, for his\r\nloyalty to Kulan Tith was the loyalty of the blood of John Carter\r\nof Virginia for a friend, greater than which could be no loyalty.\r\n\r\nHe raised a jewel-encrusted bit of the girl's magnificent trappings\r\nto his lips.\r\n\r\n\"To the honour and happiness of Kulan Tith and the priceless jewel\r\nthat has been bestowed upon him,\" he said, and though his voice\r\nwas husky there was the true ring of sincerity in it.  \"I told you\r\nthat I loved you, Thuvia, before I knew that you were promised to\r\nanother.  I may not tell you it again, but I am glad that you know\r\nit, for there is no dishonour in it either to you or to Kulan Tith\r\nor to myself.  My love is such that it may embrace as well Kulan\r\nTith--if you love him.\"  There was almost a question in the statement.\r\n\r\n\"I am promised to him,\" she replied.\r\n\r\nCarthoris backed slowly away.  He laid one hand upon his heart,\r\nthe other upon the pommel of his long-sword.\r\n\r\n\"These are yours--always,\" he said.  A moment later he had entered\r\nthe palace, and was gone from the girl's sight.\r\n\r\nHad he returned at once he would have found her prone upon the\r\nersite bench, her face buried in her arms.  Was she weeping?  There\r\nwas none to see.\r\n\r\n\r\nCarthoris of Helium had come all unannounced to the court of his\r\nfather's friend that day.  He had come alone in a small flier, sure\r\nof the same welcome that always awaited him at Ptarth.  As there\r\nhad been no formality in his coming there was no need of formality\r\nin his going.\r\n\r\nTo Thuvan Dihn he explained that he had been but testing an invention\r\nof his own with which his flier was equipped--a clever improvement\r\nof the ordinary Martian air compass, which, when set for a certain\r\ndestination, will remain constantly fixed thereon, making it only\r\nnecessary to keep a vessel's prow always in the direction of the\r\ncompass needle to reach any given point upon Barsoom by the shortest\r\nroute.\r\n\r\nCarthoris' improvement upon this consisted of an auxiliary device\r\nwhich steered the craft mechanically in the direction of the\r\ncompass, and upon arrival directly over the point for which the\r\ncompass was set, brought the craft to a standstill and lowered it,\r\nalso automatically, to the ground.\r\n\r\n\"You readily discern the advantages of this invention,\" he was saying\r\nto Thuvan Dihn, who had accompanied him to the landing-stage upon\r\nthe palace roof to inspect the compass and bid his young friend\r\nfarewell.\r\n\r\nA dozen officers of the court with several body servants were\r\ngrouped behind the jeddak and his guest, eager listeners to the\r\nconversation--so eager on the part of one of the servants that he\r\nwas twice rebuked by a noble for his forwardness in pushing himself\r\nahead of his betters to view the intricate mechanism of the wonderful\r\n\"controlling destination compass,\" as the thing was called.\r\n\r\n\"For example,\" continued Carthoris, \"I have an all-night trip before\r\nme, as to-night.  I set the pointer here upon the right-hand dial\r\nwhich represents the eastern hemisphere of Barsoom, so that the\r\npoint rests upon the exact latitude and longitude of Helium.  Then\r\nI start the engine, roll up in my sleeping silks and furs, and with\r\nlights burning, race through the air toward Helium, confident that\r\nat the appointed hour I shall drop gently toward the landing-stage\r\nupon my own palace, whether I am still asleep or no.\"\r\n\r\n\"Provided,\" suggested Thuvan Dihn, \"you do not chance to collide\r\nwith some other night wanderer in the meanwhile.\"\r\n\r\nCarthoris smiled.  \"No danger of that,\" he replied.  \"See here,\"\r\nand he indicated a device at the right of the destination compass.\r\n\"This is my 'obstruction evader,' as I call it.  This visible device\r\nis the switch which throws the mechanism on or off.  The instrument\r\nitself is below deck, geared both to the steering apparatus and\r\nthe control levers.\r\n\r\n\"It is quite simple, being nothing more than a radium generator\r\ndiffusing radio-activity in all directions to a distance of a\r\nhundred yards or so from the flier.  Should this enveloping force\r\nbe interrupted in any direction a delicate instrument immediately\r\napprehends the irregularity, at the same time imparting an impulse\r\nto a magnetic device which in turn actuates the steering mechanism,\r\ndiverting the bow of the flier away from the obstacle until the craft's\r\nradio-activity sphere is no longer in contact with the obstruction,\r\nthen she falls once more into her normal course.  Should the\r\ndisturbance approach from the rear, as in case of a faster-moving\r\ncraft overhauling me, the mechanism actuates the speed control as\r\nwell as the steering gear, and the flier shoots ahead and either\r\nup or down, as the oncoming vessel is upon a lower or higher plane\r\nthan herself.\r\n\r\n\"In aggravated cases, that is when the obstructions are many, or\r\nof such a nature as to deflect the bow more than forty-five degrees\r\nin any direction, or when the craft has reached its destination\r\nand dropped to within a hundred yards of the ground, the mechanism\r\nbrings her to a full stop, at the same time sounding a loud alarm\r\nwhich will instantly awaken the pilot.  You see I have anticipated\r\nalmost every contingency.\"\r\n\r\nThuvan Dihn smiled his appreciation of the marvellous device.  The\r\nforward servant pushed almost to the flier's side.  His eyes were\r\nnarrowed to slits.\r\n\r\n\"All but one,\" he said.\r\n\r\nThe nobles looked at him in astonishment, and one of them grasped\r\nthe fellow none too gently by the shoulder to push him back to his\r\nproper place.  Carthoris raised his hand.\r\n\r\n\"Wait,\" he urged.  \"Let us hear what the man has to say--no creation\r\nof mortal mind is perfect.  Perchance he has detected a weakness\r\nthat it will be well to know at once.  Come, my good fellow, and\r\nwhat may be the one contingency I have overlooked?\"\r\n\r\nAs he spoke Carthoris observed the servant closely for the first\r\ntime.  He saw a man of giant stature and handsome, as are all those\r\nof the race of Martian red men; but the fellow's lips were thin\r\nand cruel, and across one cheek was the faint, white line of a\r\nsword-cut from the right temple to the corner of the mouth.\r\n\r\n\"Come,\" urged the Prince of Helium.  \"Speak!\"\r\n\r\nThe man hesitated.  It was evident that he regretted the temerity\r\nthat had made him the centre of interested observation.  But at\r\nlast, seeing no alternative, he spoke.\r\n\r\n\"It might be tampered with,\" he said, \"by an enemy.\"\r\n\r\nCarthoris drew a small key from his leathern pocket-pouch.\r\n\r\n\"Look at this,\" he said, handing it to the man.  \"If you know aught\r\nof locks, you will know that the mechanism which this unlooses is\r\nbeyond the cunning of a picker of locks.  It guards the vitals of\r\nthe instrument from crafty tampering.  Without it an enemy must\r\nhalf wreck the device to reach its heart, leaving his handiwork\r\napparent to the most casual observer.\"\r\n\r\nThe servant took the key, glanced at it shrewdly, and then as he\r\nmade to return it to Carthoris dropped it upon the marble flagging.\r\nTurning to look for it he planted the sole of his sandal full upon\r\nthe glittering object.  For an instant he bore all his weight upon\r\nthe foot that covered the key, then he stepped back and with an\r\nexclamation as of pleasure that he had found it, stooped, recovered\r\nit, and returned it to the Heliumite.  Then he dropped back to his\r\nstation behind the nobles and was forgotten.\r\n\r\nA moment later Carthoris had made his adieux to Thuvan Dihn and\r\nhis nobles, and with lights twinkling had risen into the star-shot\r\nvoid of the Martian night.\r\n\r\n\r\n\r\n\r\nCHAPTER II\r\n\r\nSLAVERY\r\n\r\n\r\nAs the ruler of Ptarth, followed by his courtiers, descended from\r\nthe landing-stage above the palace, the servants dropped into their\r\nplaces in the rear of their royal or noble masters, and behind the\r\nothers one lingered to the last.  Then quickly stooping he snatched\r\nthe sandal from his right foot, slipping it into his pocket-pouch.\r\n\r\nWhen the party had come to the lower levels, and the jeddak had\r\ndispersed them by a sign, none noticed that the forward fellow who\r\nhad drawn so much attention to himself before the Prince of Helium\r\ndeparted, was no longer among the other servants.\r\n\r\nTo whose retinue he had been attached none had thought to inquire,\r\nfor the followers of a Martian noble are many, coming and going\r\nat the whim of their master, so that a new face is scarcely ever\r\nquestioned, as the fact that a man has passed within the palace\r\nwalls is considered proof positive that his loyalty to the jeddak\r\nis beyond question, so rigid is the examination of each who seeks\r\nservice with the nobles of the court.\r\n\r\nA good rule that, and only relaxed by courtesy in favour of the\r\nretinue of visiting royalty from a friendly foreign power.\r\n\r\nIt was late in the morning of the next day that a giant serving man\r\nin the harness of the house of a great Ptarth noble passed out into\r\nthe city from the palace gates.  Along one broad avenue and then\r\nanother he strode briskly until he had passed beyond the district\r\nof the nobles and had come to the place of shops.  Here he sought\r\na pretentious building that rose spire-like toward the heavens,\r\nits outer walls elaborately wrought with delicate carvings and\r\nintricate mosaics.\r\n\r\nIt was the Palace of Peace in which were housed the representatives\r\nof the foreign powers, or rather in which were located their\r\nembassies; for the ministers themselves dwelt in gorgeous palaces\r\nwithin the district occupied by the nobles.\r\n\r\nHere the man sought the embassy of Dusar.  A clerk arose questioningly\r\nas he entered, and at his request to have a word with the minister\r\nasked his credentials.  The visitor slipped a plain metal armlet\r\nfrom above his elbow, and pointing to an inscription upon its inner\r\nsurface, whispered a word or two to the clerk.\r\n\r\nThe latter's eyes went wide, and his attitude turned at once to\r\none of deference.  He bowed the stranger to a seat, and hastened\r\nto an inner room with the armlet in his hand.  A moment later\r\nhe reappeared and conducted the caller into the presence of the\r\nminister.\r\n\r\nFor a long time the two were closeted together, and when at last\r\nthe giant serving man emerged from the inner office his expression\r\nwas cast in a smile of sinister satisfaction.  From the Palace of\r\nPeace he hurried directly to the palace of the Dusarian minister.\r\n\r\nThat night two swift fliers left the same palace top.  One sped\r\nits rapid course toward Helium; the other--\r\n\r\n\r\nThuvia of Ptarth strolled in the gardens of her father's palace, as\r\nwas her nightly custom before retiring.  Her silks and furs were\r\ndrawn about her, for the air of Mars is chill after the sun has\r\ntaken his quick plunge beneath the planet's western verge.\r\n\r\nThe girl's thoughts wandered from her impending nuptials, that\r\nwould make her empress of Kaol, to the person of the trim young\r\nHeliumite who had laid his heart at her feet the preceding day.\r\n\r\nWhether it was pity or regret that saddened her expression as she\r\ngazed toward the southern heavens where she had watched the lights\r\nof his flier disappear the previous night, it would be difficult\r\nto say.\r\n\r\nSo, too, is it impossible to conjecture just what her emotions may\r\nhave been as she discerned the lights of a flier speeding rapidly\r\nout of the distance from that very direction, as though impelled\r\ntoward her garden by the very intensity of the princess' thoughts.\r\n\r\nShe saw it circle lower above the palace until she was positive\r\nthat it but hovered in preparation for a landing.\r\n\r\nPresently the powerful rays of its searchlight shot downward from\r\nthe bow.  They fell upon the landing-stage for a brief instant,\r\nrevealing the figures of the Ptarthian guard, picking into brilliant\r\npoints of fire the gems upon their gorgeous harnesses.\r\n\r\nThen the blazing eye swept onward across the burnished domes and\r\ngraceful minarets, down into court and park and garden to pause at\r\nlast upon the ersite bench and the girl standing there beside it,\r\nher face upturned full toward the flier.\r\n\r\nFor but an instant the searchlight halted upon Thuvia of Ptarth,\r\nthen it was extinguished as suddenly as it had come to life.  The\r\nflier passed on above her to disappear beyond a grove of lofty\r\nskeel trees that grew within the palace grounds.\r\n\r\nThe girl stood for some time as it had left her, except that her\r\nhead was bent and her eyes downcast in thought.\r\n\r\nWho but Carthoris could it have been?  She tried to feel anger\r\nthat he should have returned thus, spying upon her; but she found\r\nit difficult to be angry with the young prince of Helium.\r\n\r\nWhat mad caprice could have induced him so to transgress the\r\netiquette of nations?  For lesser things great powers had gone to\r\nwar.\r\n\r\nThe princess in her was shocked and angered--but what of the girl!\r\n\r\nAnd the guard--what of them?  Evidently they, too, had been so much\r\nsurprised by the unprecedented action of the stranger that they\r\nhad not even challenged; but that they had no thought to let the\r\nthing go unnoticed was quickly evidenced by the skirring of motors\r\nupon the landing-stage and the quick shooting airward of a long-lined\r\npatrol boat.\r\n\r\nThuvia watched it dart swiftly eastward.  So, too, did other eyes\r\nwatch.\r\n\r\nWithin the dense shadows of the skeel grove, in a wide avenue\r\nbeneath o'erspreading foliage, a flier hung a dozen feet above the\r\nground.  From its deck keen eyes watched the far-fanning searchlight\r\nof the patrol boat.  No light shone from the enshadowed craft.  Upon\r\nits deck was the silence of the tomb.  Its crew of a half-dozen\r\nred warriors watched the lights of the patrol boat diminishing in\r\nthe distance.\r\n\r\n\"The intellects of our ancestors are with us to-night,\" said one\r\nin a low tone.\r\n\r\n\"No plan ever carried better,\" returned another.  \"They did precisely\r\nas the prince foretold.\"\r\n\r\nHe who had first spoken turned toward the man who squatted before\r\nthe control board.\r\n\r\n\"Now!\" he whispered.  There was no other order given.  Every man\r\nupon the craft had evidently been well schooled in each detail\r\nof that night's work.  Silently the dark hull crept beneath the\r\ncathedral arches of the dark and silent grove.\r\n\r\nThuvia of Ptarth, gazing toward the east, saw the blacker blot\r\nagainst the blackness of the trees as the craft topped the buttressed\r\ngarden wall.  She saw the dim bulk incline gently downward toward\r\nthe scarlet sward of the garden.\r\n\r\nShe knew that men came not thus with honourable intent.  Yet she\r\ndid not cry aloud to alarm the near-by guardsmen, nor did she flee\r\nto the safety of the palace.\r\n\r\nWhy?\r\n\r\nI can see her shrug her shapely shoulders in reply as she voices\r\nthe age-old, universal answer of the woman:  Because!\r\n\r\nScarce had the flier touched the ground when four men leaped from\r\nits deck.  They ran forward toward the girl.\r\n\r\nStill she made no sign of alarm, standing as though hypnotized.\r\nOr could it have been as one who awaited a welcome visitor?\r\n\r\nNot until they were quite close to her did she move.  Then the\r\nnearer moon, rising above the surrounding foliage, touched their\r\nfaces, lighting all with the brilliancy of her silver rays.\r\n\r\nThuvia of Ptarth saw only strangers--warriors in the harness of\r\nDusar.  Now she took fright, but too late!\r\n\r\nBefore she could voice but a single cry, rough hands seized her.\r\nA heavy silken scarf was wound about her head.  She was lifted\r\nin strong arms and borne to the deck of the flier.  There was the\r\nsudden whirl of propellers, the rushing of air against her body,\r\nand, from far beneath the shouting and the challenge from the guard.\r\n\r\nRacing toward the south another flier sped toward Helium.  In its\r\ncabin a tall red man bent over the soft sole of an upturned sandal.\r\nWith delicate instruments he measured the faint imprint of a small\r\nobject which appeared there.  Upon a pad beside him was the outline\r\nof a key, and here he noted the results of his measurements.\r\n\r\nA smile played upon his lips as he completed his task and turned\r\nto one who waited at the opposite side of the table.\r\n\r\n\"The man is a genius,\" he remarked.\r\n\r\n\"Only a genius could have evolved such a lock as this is designed\r\nto spring.  Here, take the sketch, Larok, and give all thine own\r\ngenius full and unfettered freedom in reproducing it in metal.\"\r\n\r\nThe warrior-artificer bowed.  \"Man builds naught,\" he said, \"that\r\nman may not destroy.\"  Then he left the cabin with the sketch.\r\n\r\nAs dawn broke upon the lofty towers which mark the twin cities\r\nof Helium--the scarlet tower of one and the yellow tower of its\r\nsister--a flier floated lazily out of the north.\r\n\r\nUpon its bow was emblazoned the signia of a lesser noble of a\r\nfar city of the empire of Helium.  Its leisurely approach and the\r\nevident confidence with which it moved across the city aroused no\r\nsuspicion in the minds of the sleepy guard.  Their round of duty\r\nnearly done, they had little thought beyond the coming of those\r\nwho were to relieve them.\r\n\r\nPeace reigned throughout Helium.  Stagnant, emasculating peace.\r\nHelium had no enemies.  There was naught to fear.\r\n\r\nWithout haste the nearest air patrol swung sluggishly about and\r\napproached the stranger.  At easy speaking distance the officer\r\nupon her deck hailed the incoming craft.\r\n\r\nThe cheery \"Kaor!\" and the plausible explanation that the owner had\r\ncome from distant parts for a few days of pleasure in gay Helium\r\nsufficed.  The air-patrol boat sheered off, passing again upon its\r\nway.  The stranger continued toward a public landing-stage, where\r\nshe dropped into the ways and came to rest.\r\n\r\nAt about the same time a warrior entered her cabin.\r\n\r\n\"It is done, Vas Kor,\" he said, handing a small metal key to the\r\ntall noble who had just risen from his sleeping silks and furs.\r\n\r\n\"Good!\" exclaimed the latter.  \"You must have worked upon it all\r\nduring the night, Larok.\"\r\n\r\nThe warrior nodded.\r\n\r\n\"Now fetch me the Heliumetic metal you wrought some days since,\"\r\ncommanded Vas Kor.\r\n\r\nThis done, the warrior assisted his master to replace the handsome\r\njewelled metal of his harness with the plainer ornaments of an\r\nordinary fighting man of Helium, and with the insignia of the same\r\nhouse that appeared upon the bow of the flier.\r\n\r\nVas Kor breakfasted on board.  Then he emerged upon the aerial dock,\r\nentered an elevator, and was borne quickly to the street below,\r\nwhere he was soon engulfed by the early morning throng of workers\r\nhastening to their daily duties.\r\n\r\nAmong them his warrior trappings were no more remarkable than is\r\na pair of trousers upon Broadway.  All Martian men are warriors,\r\nsave those physically unable to bear arms.  The tradesman and\r\nhis clerk clank with their martial trappings as they pursue their\r\nvocations.  The schoolboy, coming into the world, as he does, almost\r\nadult from the snowy shell that has encompassed his development\r\nfor five long years, knows so little of life without a sword at\r\nhis hip that he would feel the same discomfiture at going abroad\r\nunarmed that an Earth boy would experience in walking the streets\r\nknicker-bockerless.\r\n\r\nVas Kor's destination lay in Greater Helium, which lies some\r\nseventy-five miles across the level plain from Lesser Helium.  He\r\nhad landed at the latter city because the air patrol is less\r\nsuspicious and alert than that above the larger metropolis where\r\nlies the palace of the jeddak.\r\n\r\nAs he moved with the throng in the parklike canyon of the thoroughfare\r\nthe life of an awakening Martian city was in evidence about him.\r\nHouses, raised high upon their slender metal columns for the night\r\nwere dropping gently toward the ground.  Among the flowers upon the\r\nscarlet sward which lies about the buildings children were already\r\nplaying, and comely women laughing and chatting with their neighbours\r\nas they culled gorgeous blossoms for the vases within doors.\r\n\r\nThe pleasant \"kaor\" of the Barsoomian greeting fell continually\r\nupon the ears of the stranger as friends and neighbours took up\r\nthe duties of a new day.\r\n\r\nThe district in which he had landed was residential--a district of\r\nmerchants of the more prosperous sort.  Everywhere were evidences\r\nof luxury and wealth.  Slaves appeared upon every housetop with\r\ngorgeous silks and costly furs, laying them in the sun for airing.\r\nJewel-encrusted women lolled even thus early upon the carven\r\nbalconies before their sleeping apartments.  Later in the day they\r\nwould repair to the roofs when the slaves had arranged couches and\r\npitched silken canopies to shade them from the sun.\r\n\r\nStrains of inspiring music broke pleasantly from open windows,\r\nfor the Martians have solved the problem of attuning the nerves\r\npleasantly to the sudden transition from sleep to waking that proves\r\nso difficult a thing for most Earth folk.\r\n\r\nAbove him raced the long, light passenger fliers, plying, each in\r\nits proper plane, between the numerous landing-stages for internal\r\npassenger traffic.  Landing-stages that tower high into the heavens\r\nare for the great international passenger liners.  Freighters have\r\nother landing-stages at various lower levels, to within a couple\r\nof hundred feet of the ground; nor dare any flier rise or drop from\r\none plane to another except in certain restricted districts where\r\nhorizontal traffic is forbidden.\r\n\r\nAlong the close-cropped sward which paves the avenue ground fliers\r\nwere moving in continuous lines in opposite directions.  For the\r\ngreater part they skimmed along the surface of the sward, soaring\r\ngracefully into the air at times to pass over a slower-going driver\r\nahead, or at intersections, where the north and south traffic has\r\nthe right of way and the east and west must rise above it.\r\n\r\nFrom private hangars upon many a roof top fliers were darting into\r\nthe line of traffic.  Gay farewells and parting admonitions mingled\r\nwith the whirring of motors and the subdued noises of the city.\r\n\r\nYet with all the swift movement and the countless thousands rushing\r\nhither and thither, the predominant suggestion was that of luxurious\r\nease and soft noiselessness.\r\n\r\nMartians dislike harsh, discordant clamour.  The only loud noises\r\nthey can abide are the martial sounds of war, the clash of arms,\r\nthe collision of two mighty dreadnoughts of the air.  To them there\r\nis no sweeter music than this.\r\n\r\nAt the intersection of two broad avenues Vas Kor descended from the\r\nstreet level to one of the great pneumatic stations of the city.\r\nHere he paid before a little wicket the fare to his destination\r\nwith a couple of the dull, oval coins of Helium.\r\n\r\nBeyond the gatekeeper he came to a slowly moving line of what to\r\nEarthly eyes would have appeared to be conical-nosed, eight-foot\r\nprojectiles for some giant gun.  In slow procession the things\r\nmoved in single file along a grooved track.  A half dozen attendants\r\nassisted passengers to enter, or directed these carriers to their\r\nproper destination.\r\n\r\nVas Kor approached one that was empty.  Upon its nose was a dial\r\nand a pointer.  He set the pointer for a certain station in Greater\r\nHelium, raised the arched lid of the thing, stepped in and lay down\r\nupon the upholstered bottom.  An attendant closed the lid, which\r\nlocked with a little click, and the carrier continued its slow way.\r\n\r\nPresently it switched itself automatically to another track, to\r\nenter, a moment later, one of the series of dark-mouthed tubes.\r\n\r\nThe instant that its entire length was within the black aperture\r\nit sprang forward with the speed of a rifle ball.  There was an\r\ninstant of whizzing--a soft, though sudden, stop, and slowly the\r\ncarrier emerged upon another platform, another attendant raised\r\nthe lid and Vas Kor stepped out at the station beneath the centre\r\nof Greater Helium, seventy-five miles from the point at which he\r\nhad embarked.\r\n\r\nHere he sought the street level, stepping immediately into a waiting\r\nground flier.  He spoke no word to the slave sitting in the driver's\r\nseat.  It was evident that he had been expected, and that the fellow\r\nhad received his instructions before his coming.\r\n\r\nScarcely had Vas Kor taken his seat when the flier went quickly\r\ninto the fast-moving procession, turning presently from the broad\r\nand crowded avenue into a less congested street.  Presently it left\r\nthe thronged district behind to enter a section of small shops,\r\nwhere it stopped before the entrance to one which bore the sign of\r\na dealer in foreign silks.\r\n\r\nVas Kor entered the low-ceiling room.  A man at the far end\r\nmotioned him toward an inner apartment, giving no further sign of\r\nrecognition until he had passed in after the caller and closed the\r\ndoor.\r\n\r\nThen he faced his visitor, saluting deferentially.\r\n\r\n\"Most noble--\" he commenced, but Vas Kor silenced him with a gesture.\r\n\r\n\"No formalities,\" he said.  \"We must forget that I am aught other\r\nthan your slave.  If all has been as carefully carried out as it\r\nhas been planned, we have no time to waste.  Instead we should be\r\nupon our way to the slave market.  Are you ready?\"\r\n\r\nThe merchant nodded, and, turning to a great chest, produced\r\nthe unemblazoned trappings of a slave.  These Vas Kor immediately\r\ndonned.  Then the two passed from the shop through a rear door,\r\ntraversed a winding alley to an avenue beyond, where they entered\r\na flier which awaited them.\r\n\r\nFive minutes later the merchant was leading his slave to the public\r\nmarket, where a great concourse of people filled the great open\r\nspace in the centre of which stood the slave block.\r\n\r\nThe crowds were enormous to-day, for Carthoris, Prince of Helium,\r\nwas to be the principal bidder.\r\n\r\nOne by one the masters mounted the rostrum beside the slave block\r\nupon which stood their chattels.  Briefly and clearly each recounted\r\nthe virtues of his particular offering.\r\n\r\nWhen all were done, the major-domo of the Prince of Helium recalled\r\nto the block such as had favourably impressed him.  For such he\r\nhad made a fair offer.\r\n\r\nThere was little haggling as to price, and none at all when Vas\r\nKor was placed upon the block.  His merchant-master accepted the\r\nfirst offer that was made for him, and thus a Dusarian noble entered\r\nthe household of Carthoris.\r\n\r\n\r\n\r\n\r\nCHAPTER III\r\n\r\nTREACHERY\r\n\r\n\r\nThe day following the coming of Vas Kor to the palace of the Prince\r\nof Helium great excitement reigned throughout the twin cities,\r\nreaching its climax in the palace of Carthoris.  Word had come of\r\nthe abduction of Thuvia of Ptarth from her father's court, and with\r\nit the veiled hint that the Prince of Helium might be suspected\r\nof considerable knowledge of the act and the whereabouts of the\r\nprincess.\r\n\r\nIn the council chamber of John Carter, Warlord of Mars, was Tardos\r\nMors, Jeddak of Helium; Mors Kajak, his son, Jed of Lesser Helium;\r\nCarthoris, and a score of the great nobles of the empire.\r\n\r\n\"There must be no war between Ptarth and Helium, my son,\" said John\r\nCarter.  \"That you are innocent of the charge that has been placed\r\nagainst you by insinuation, we well know; but Thuvan Dihn must know\r\nit well, too.\r\n\r\n\"There is but one who may convince him, and that one be you.  You\r\nmust hasten at once to the court of Ptarth, and by your presence\r\nthere as well as by your words assure him that his suspicions are\r\ngroundless.  Bear with you the authority of the Warlord of Barsoom,\r\nand of the Jeddak of Helium to offer every resource of the allied\r\npowers to assist Thuvan Dihn to recover his daughter and punish\r\nher abductors, whomsoever they may be.\r\n\r\n\"Go!  I know that I do not need to urge upon you the necessity for\r\nhaste.\"\r\n\r\nCarthoris left the council chamber, and hastened to his palace.\r\n\r\nHere slaves were busy in a moment setting things to rights for the\r\ndeparture of their master.  Several worked about the swift flier\r\nthat would bear the Prince of Helium rapidly toward Ptarth.\r\n\r\nAt last all was done.  But two armed slaves remained on guard.\r\nThe setting sun hung low above the horizon.  In a moment darkness\r\nwould envelop all.\r\n\r\nOne of the guardsmen, a giant of a fellow across whose right cheek\r\nthere ran a thin scar from temple to mouth, approached his companion.\r\nHis gaze was directed beyond and above his comrade.  When he had\r\ncome quite close he spoke.\r\n\r\n\"What strange craft is that?\" he asked.\r\n\r\nThe other turned about quickly to gaze heavenward.  Scarce was his\r\nback turned toward the giant than the short-sword of the latter\r\nwas plunged beneath his left shoulder blade, straight through his\r\nheart.\r\n\r\nVoiceless, the soldier sank in his tracks--stone dead.  Quickly\r\nthe murderer dragged the corpse into the black shadows within the\r\nhangar.  Then he returned to the flier.\r\n\r\nDrawing a cunningly wrought key from his pocket-pouch, he removed\r\nthe cover of the right-hand dial of the controlling destination\r\ncompass.  For a moment he studied the construction of the mechanism\r\nbeneath.  Then he returned the dial to its place, set the pointer,\r\nand removed it again to note the resultant change in the position\r\nof the parts affected by the act.\r\n\r\nA smile crossed his lips.  With a pair of cutters he snipped off\r\nthe projection which extended through the dial from the external\r\npointer--now the latter might be moved to any point upon the dial\r\nwithout affecting the mechanism below.  In other words, the eastern\r\nhemisphere dial was useless.\r\n\r\nNow he turned his attention to the western dial.  This he set upon\r\na certain point.  Afterward he removed the cover of this dial also,\r\nand with keen tool cut the steel finger from the under side of the\r\npointer.\r\n\r\nAs quickly as possible he replaced the second dial cover, and resumed\r\nhis place on guard.  To all intents and purposes the compass was\r\nas efficient as before; but, as a matter of fact, the moving of the\r\npointers upon the dials resulted now in no corresponding shift of\r\nthe mechanism beneath--and the device was set, immovably, upon a\r\ndestination of the slave's own choosing.\r\n\r\nPresently came Carthoris, accompanied by but a handful of his\r\ngentlemen.  He cast but a casual glance upon the single slave who\r\nstood guard.  The fellow's thin, cruel lips, and the sword-cut that\r\nran from temple to mouth aroused the suggestion of an unpleasant\r\nmemory within him.  He wondered where Saran Tal had found the man--\r\nthen the matter faded from his thoughts, and in another moment the\r\nPrince of Helium was laughing and chatting with his companions,\r\nthough below the surface his heart was cold with dread, for what\r\ncontingencies confronted Thuvia of Ptarth he could not even guess.\r\n\r\nFirst to his mind, naturally, had sprung the thought that Astok\r\nof Dusar had stolen the fair Ptarthian; but almost simultaneously\r\nwith the report of the abduction had come news of the great fetes\r\nat Dusar in honour of the return of the jeddak's son to the court\r\nof his father.\r\n\r\nIt could not have been he, thought Carthoris, for on the very night\r\nthat Thuvia was taken Astok had been in Dusar, and yet--\r\n\r\nHe entered the flier, exchanging casual remarks with his companions\r\nas he unlocked the mechanism of the compass and set the pointer\r\nupon the capital city of Ptarth.\r\n\r\nWith a word of farewell he touched the button which controlled the\r\nrepulsive rays, and as the flier rose lightly into the air, the\r\nengine purred in answer to the touch of his finger upon a second\r\nbutton, the propellers whirred as his hand drew back the speed\r\nlever, and Carthoris, Prince of Helium, was off into the gorgeous\r\nMartian night beneath the hurtling moons and the million stars.\r\n\r\nScarce had the flier found its speed ere the man, wrapping his\r\nsleeping silks and furs about him, stretched at full length upon\r\nthe narrow deck to sleep.\r\n\r\nBut sleep did not come at once at his bidding.\r\n\r\nInstead, his thoughts ran riot in his brain, driving sleep away.\r\nHe recalled the words of Thuvia of Ptarth, words that had half\r\nassured him that she loved him; for when he had asked her if she\r\nloved Kulan Tith, she had answered only that she was promised to\r\nhim.\r\n\r\nNow he saw that her reply was open to more than a single construction.\r\nIt might, of course, mean that she did not love Kulan Tith; and\r\nso, by inference, be taken to mean that she loved another.\r\n\r\nBut what assurance was there that the other was Carthoris of Helium?\r\n\r\nThe more he thought upon it the more positive he became that not\r\nonly was there no assurance in her words that she loved him, but\r\nnone either in any act of hers.  No, the fact was, she did not love\r\nhim.  She loved another.  She had not been abducted--she had fled\r\nwillingly with her lover.\r\n\r\nWith such pleasant thoughts filling him alternately with despair\r\nand rage, Carthoris at last dropped into the sleep of utter mental\r\nexhaustion.\r\n\r\nThe breaking of the sudden dawn found him still asleep.  His flier\r\nwas rushing swiftly above a barren, ochre plain--the world-old\r\nbottom of a long-dead Martian sea.\r\n\r\nIn the distance rose low hills.  Toward these the craft was headed.\r\nAs it approached them, a great promontory might have been seen from\r\nits deck, stretching out into what had once been a mighty ocean,\r\nand circling back once more to enclose the forgotten harbour of a\r\nforgotten city, which still stretched back from its deserted quays,\r\nan imposing pile of wondrous architecture of a long-dead past.\r\n\r\nThe countless dismal windows, vacant and forlorn, stared, sightless,\r\nfrom their marble walls; the whole sad city taking on the semblance\r\nof scattered mounds of dead men's sun-bleached skulls--the casements\r\nhaving the appearance of eyeless sockets, the portals, grinning\r\njaws.\r\n\r\nCloser came the flier, but now its speed was diminishing--yet this\r\nwas not Ptarth.\r\n\r\nAbove the central plaza it stopped, slowly settling Marsward.\r\nWithin a hundred yards of the ground it came to rest, floating\r\ngently in the light air, and at the same instant an alarm sounded\r\nat the sleeper's ear.\r\n\r\nCarthoris sprang to his feet.  Below him he looked to see the\r\nteeming metropolis of Ptarth.  Beside him, already, there should\r\nhave been an air patrol.\r\n\r\nHe gazed about in bewildered astonishment.  There indeed was a\r\ngreat city, but it was not Ptarth.  No multitudes surged through\r\nits broad avenues.  No signs of life broke the dead monotony of\r\nits deserted roof tops.  No gorgeous silks, no priceless furs lent\r\nlife and colour to the cold marble and the gleaming ersite.\r\n\r\nNo patrol boat lay ready with its familiar challenge.  Silent and\r\nempty lay the great city--empty and silent the surrounding air.\r\n\r\nWhat had happened?\r\n\r\nCarthoris examined the dial of his compass.  The pointer was set\r\nupon Ptarth.  Could the creature of his genius have thus betrayed\r\nhim?  He would not believe it.\r\n\r\nQuickly he unlocked the cover, turning it back upon its hinge.  A\r\nsingle glance showed him the truth, or at least a part of it--the\r\nsteel projection that communicated the movement of the pointer upon\r\nthe dial to the heart of the mechanism beneath had been severed.\r\n\r\nWho could have done the thing--and why?\r\n\r\nCarthoris could not hazard even a faint guess.  But the thing now\r\nwas to learn in what portion of the world he was, and then take up\r\nhis interrupted journey once more.\r\n\r\nIf it had been the purpose of some enemy to delay him, he had\r\nsucceeded well, thought Carthoris, as he unlocked the cover of the\r\nsecond dial the first having shown that its pointer had not been\r\nset at all.\r\n\r\nBeneath the second dial he found the steel pin severed as in the\r\nother, but the controlling mechanism had first been set for a point\r\nupon the western hemisphere.\r\n\r\nHe had just time to judge his location roughly at some place\r\nsouth-west of Helium, and at a considerable distance from the twin\r\ncities, when he was startled by a woman's scream beneath him.\r\n\r\nLeaning over the side of the flier, he saw what appeared to be a red\r\nwoman being dragged across the plaza by a huge green warrior--one\r\nof those fierce, cruel denizens of the dead sea-bottoms and deserted\r\ncities of dying Mars.\r\n\r\nCarthoris waited to see no more.  Reaching for the control board,\r\nhe sent his craft racing plummet-like toward the ground.\r\n\r\nThe green man was hurrying his captive toward a huge thoat that\r\nbrowsed upon the ochre vegetation of the once scarlet-gorgeous\r\nplaza.  At the same instant a dozen red warriors leaped from the\r\nentrance of a nearby ersite palace, pursuing the abductor with\r\nnaked swords and shouts of rageful warning.\r\n\r\nOnce the woman turned her face upward toward the falling flier,\r\nand in the single swift glance Carthoris saw that it was Thuvia of\r\nPtarth!\r\n\r\n\r\n\r\n\r\nCHAPTER IV\r\n\r\nA GREEN MAN'S CAPTIVE\r\n\r\n\r\nWhen the light of day broke upon the little craft to whose deck\r\nthe Princess of Ptarth had been snatched from her father's garden,\r\nThuvia saw that the night had wrought a change in her abductors.\r\n\r\nNo longer did their trappings gleam with the metal of Dusar, but\r\ninstead there was emblazoned there the insignia of the Prince of\r\nHelium.\r\n\r\nThe girl felt renewed hope, for she could not believe that in the\r\nheart of Carthoris could lie intent to harm her.\r\n\r\nShe spoke to the warrior squatting before the control board.\r\n\r\n\"Last night you wore the trappings of a Dusarian,\" she said.  \"Now\r\nyour metal is that of Helium.  What means it?\"\r\n\r\nThe man looked at her with a grin.\r\n\r\n\"The Prince of Helium is no fool,\" he said.\r\n\r\nJust then an officer emerged from the tiny cabin.  He reprimanded\r\nthe warrior for conversing with the prisoner, nor would he himself\r\nreply to any of her inquiries.\r\n\r\nNo harm was offered her during the journey, and so they came at last\r\nto their destination with the girl no wiser as to her abductors or\r\ntheir purpose than at first.\r\n\r\nHere the flier settled slowly into the plaza of one of those mute\r\nmonuments of Mars' dead and forgotten past--the deserted cities\r\nthat fringe the sad ochre sea-bottoms where once rolled the mighty\r\nfloods upon whose bosoms moved the maritime commerce of the peoples\r\nthat are gone for ever.\r\n\r\nThuvia of Ptarth was no stranger to such places.  During her\r\nwanderings in search of the River Iss, that time she had set out\r\nupon what, for countless ages, had been the last, long pilgrimage\r\nof Martians, toward the Valley Dor, where lies the Lost Sea of\r\nKorus, she had encountered several of these sad reminders of the\r\ngreatness and the glory of ancient Barsoom.\r\n\r\nAnd again, during her flight from the temples of the Holy Therns\r\nwith Tars Tarkas, Jeddak of Thark, she had seen them, with their\r\nweird and ghostly inmates, the great white apes of Barsoom.\r\n\r\nShe knew, too, that many of them were used now by the nomadic tribes\r\nof green men, but that among them all was no city that the red\r\nmen did not shun, for without exception they stood amidst vast,\r\nwaterless tracts, unsuited for the continued sustenance of the\r\ndominant race of Martians.\r\n\r\nWhy, then, should they be bringing her to such a place?  There was\r\nbut a single answer.  Such was the nature of their work that they\r\nmust needs seek the seclusion that a dead city afforded.  The girl\r\ntrembled at thought of her plight.\r\n\r\nFor two days her captors kept her within a huge palace that even in\r\ndecay reflected the splendour of the age which its youth had known.\r\n\r\nJust before dawn on the third day she had been aroused by the voices\r\nof two of her abductors.\r\n\r\n\"He should be here by dawn,\" one was saying.  \"Have her in readiness\r\nupon the plaza--else he will never land.  The moment he finds that\r\nhe is in a strange country he will turn about--methinks the prince's\r\nplan is weak in this one spot.\"\r\n\r\n\"There was no other way,\" replied the other.  \"It is wondrous work\r\nto get them both here at all, and even if we do not succeed in\r\nluring him to the ground, we shall have accomplished much.\"\r\n\r\nJust then the speaker caught the eyes of Thuvia upon him, revealed\r\nby the quick-moving patch of light cast by Thuria in her mad race\r\nthrough the heavens.\r\n\r\nWith a quick sign to the other, he ceased speaking, and advancing\r\ntoward the girl, motioned her to rise.  Then he led her out into\r\nthe night toward the centre of the great plaza.\r\n\r\n\"Stand here,\" he commanded, \"until we come for you.  We shall\r\nbe watching, and should you attempt to escape it will go ill with\r\nyou--much worse than death.  Such are the prince's orders.\"\r\n\r\nThen he turned and retraced his steps toward the palace, leaving\r\nher alone in the midst of the unseen terrors of the haunted city,\r\nfor in truth these places are haunted in the belief of many Martians\r\nwho still cling to an ancient superstition which teaches that the\r\nspirits of Holy Therns who die before their allotted one thousand\r\nyears, pass, on occasions, into the bodies of the great white apes.\r\n\r\nTo Thuvia, however, the real danger of attack by one of these\r\nferocious, manlike beasts was quite sufficient.  She no longer\r\nbelieved in the weird soul transmigration that the therns had taught\r\nher before she was rescued from their clutches by John Carter; but\r\nshe well knew the horrid fate that awaited her should one of the\r\nterrible beasts chance to spy her during its nocturnal prowlings.\r\n\r\nWhat was that?\r\n\r\nSurely she could not be mistaken.  Something had moved, stealthily,\r\nin the shadow of one of the great monoliths that line the avenue\r\nwhere it entered the plaza opposite her!\r\n\r\nThar Ban, jed among the hordes of Torquas, rode swiftly across the\r\nochre vegetation of the dead sea-bottom toward the ruins of ancient\r\nAaanthor.\r\n\r\nHe had ridden far that night, and fast, for he had but come from\r\nthe despoiling of the incubator of a neighbouring green horde with\r\nwhich the hordes of Torquas were perpetually warring.\r\n\r\nHis giant thoat was far from jaded, yet it would be well, thought\r\nThar Ban, to permit him to graze upon the ochre moss which grows to\r\ngreater height within the protected courtyards of deserted cities,\r\nwhere the soil is richer than on the sea-bottoms, and the plants\r\npartly shaded from the sun during the cloudless Martian day.\r\n\r\nWithin the tiny stems of this dry-seeming plant is sufficient\r\nmoisture for the needs of the huge bodies of the mighty thoats,\r\nwhich can exist for months without water, and for days without even\r\nthe slight moisture which the ochre moss contains.\r\n\r\nAs Thar Ban rode noiselessly up the broad avenue which leads from\r\nthe quays of Aaanthor to the great central plaza, he and his mount\r\nmight have been mistaken for spectres from a world of dreams, so\r\ngrotesque the man and beast, so soundless the great thoat's padded,\r\nnailless feet upon the moss-grown flagging of the ancient pavement.\r\n\r\nThe man was a splendid specimen of his race.  Fully fifteen feet\r\ntowered his great height from sole to pate.  The moonlight glistened\r\nagainst his glossy green hide, sparkling the jewels of his heavy\r\nharness and the ornaments that weighted his four muscular arms,\r\nwhile the upcurving tusks that protruded from his lower jaw gleamed\r\nwhite and terrible.\r\n\r\nAt the side of his thoat were slung his long radium rifle and his\r\ngreat, forty-foot, metal-shod spear, while from his own harness\r\ndepended his long-sword and his short-sword, as well as his lesser\r\nweapons.\r\n\r\nHis protruding eyes and antennae-like ears were turning constantly\r\nhither and thither, for Thar Ban was yet in the country of the\r\nenemy, and, too, there was always the menace of the great white\r\napes, which, John Carter was wont to say, are the only creatures\r\nthat can arouse in the breasts of these fierce denizens of the dead\r\nsea-bottoms even the remotest semblance of fear.\r\n\r\nAs the rider neared the plaza, he reined suddenly in.  His slender,\r\ntubular ears pointed rigidly forward.  An unwonted sound had reached\r\nthem.  Voices!  And where there were voices, outside of Torquas,\r\nthere, too, were enemies.  All the world of wide Barsoom contained\r\nnaught but enemies for the fierce Torquasians.\r\n\r\nThar Ban dismounted.  Keeping in the shadows of the great monoliths\r\nthat line the Avenue of Quays of sleeping Aaanthor, he approached\r\nthe plaza.  Directly behind him, as a hound at heel, came the\r\nslate-grey thoat, his white belly shadowed by his barrel, his vivid\r\nyellow feet merging into the yellow of the moss beneath them.\r\n\r\nIn the centre of the plaza Thar Ban saw the figure of a red woman.\r\nA red warrior was conversing with her.  Now the man turned and\r\nretraced his steps toward the palace at the opposite side of the\r\nplaza.\r\n\r\nThar Ban watched until he had disappeared within the yawning\r\nportal.  Here was a captive worth having!  Seldom did a female of\r\ntheir hereditary enemies fall to the lot of a green man.  Thar Ban\r\nlicked his thin lips.\r\n\r\nThuvia of Ptarth watched the shadow behind the monolith at the\r\nopening to the avenue opposite her.  She hoped that it might be\r\nbut the figment of an overwrought imagination.\r\n\r\nBut no!  Now, clearly and distinctly, she saw it move.  It came\r\nfrom behind the screening shelter of the ersite shaft.\r\n\r\nThe sudden light of the rising sun fell upon it.  The girl trembled.\r\nThe THING was a huge green warrior!\r\n\r\nSwiftly it sprang toward her.  She screamed and tried to flee;\r\nbut she had scarce turned toward the palace when a giant hand fell\r\nupon her arm, she was whirled about, and half dragged, half carried\r\ntoward a huge thoat that was slowly grazing out of the avenue's\r\nmouth on to the ochre moss of the plaza.\r\n\r\nAt the same instant she turned her face upward toward the whirring\r\nsound of something above her, and there she saw a swift flier\r\ndropping toward her, the head and shoulders of a man leaning far\r\nover the side; but the man's features were deeply shadowed, so that\r\nshe did not recognize them.\r\n\r\nNow from behind her came the shouts of her red abductors.  They\r\nwere racing madly after him who dared to steal what they already\r\nhad stolen.\r\n\r\nAs Thar Ban reached the side of his mount he snatched his long\r\nradium rifle from its boot, and, wheeling, poured three shots into\r\nthe oncoming red men.\r\n\r\nSuch is the uncanny marksmanship of these Martian savages that three\r\nred warriors dropped in their tracks as three projectiles exploded\r\nin their vitals.\r\n\r\nThe others halted, nor did they dare return the fire for fear of\r\nwounding the girl.\r\n\r\nThen Thar Ban vaulted to the back of his thoat, Thuvia of Ptarth\r\nstill in his arms, and with a savage cry of triumph disappeared\r\ndown the black canyon of the Avenue of Quays between the sullen\r\npalaces of forgotten Aaanthor.\r\n\r\nCarthoris' flier had not touched the ground before he had sprung\r\nfrom its deck to race after the swift thoat, whose eight long legs\r\nwere sending it down the avenue at the rate of an express train;\r\nbut the men of Dusar who still remained alive had no mind to permit\r\nso valuable a capture to escape them.\r\n\r\nThey had lost the girl.  That would be a difficult thing to explain\r\nto Astok; but some leniency might be expected could they carry the\r\nPrince of Helium to their master instead.\r\n\r\nSo the three who remained set upon Carthoris with their long-swords,\r\ncrying to him to surrender; but they might as successfully have cried\r\naloud to Thuria to cease her mad hurtling through the Barsoomian\r\nsky, for Carthoris of Helium was a true son of the Warlord of Mars\r\nand his incomparable Dejah Thoris.\r\n\r\nCarthoris' long-sword had been already in his hand as he leaped from\r\nthe deck of the flier, so the instant that he realized the menace\r\nof the three red warriors, he wheeled to face them, meeting their\r\nonslaught as only John Carter himself might have done.\r\n\r\nSo swift his sword, so mighty and agile his half-earthly muscles,\r\nthat one of his opponents was down, crimsoning the ochre moss with\r\nhis life-blood, when he had scarce made a single pass at Carthoris.\r\n\r\nNow the two remaining Dusarians rushed simultaneously upon the\r\nHeliumite.  Three long-swords clashed and sparkled in the moonlight,\r\nuntil the great white apes, roused from their slumbers, crept\r\nto the lowering windows of the dead city to view the bloody scene\r\nbeneath them.\r\n\r\nThrice was Carthoris touched, so that the red blood ran down his\r\nface, blinding him and dyeing his broad chest.  With his free hand\r\nhe wiped the gore from his eyes, and with the fighting smile of his\r\nfather touching his lips, leaped upon his antagonists with renewed\r\nfury.\r\n\r\nA single cut of his heavy sword severed the head of one of them, and\r\nthen the other, backing away clear of that point of death, turned\r\nand fled toward the palace at his back.\r\n\r\nCarthoris made no step to pursue.  He had other concern than the\r\nmeting of even well-deserved punishment to strange men who masqueraded\r\nin the metal of his own house, for he had seen that these men were\r\ntricked out in the insignia that marked his personal followers.\r\n\r\nTurning quickly toward his flier, he was soon rising from the plaza\r\nin pursuit of Thar Ban.\r\n\r\nThe red warrior whom he had put to flight turned in the entrance\r\nto the palace, and, seeing Carthoris' intent, snatched a rifle from\r\nthose that he and his fellows had left leaning against the wall\r\nas they had rushed out with drawn swords to prevent the theft of\r\ntheir prisoner.\r\n\r\nFew red men are good shots, for the sword is their chosen weapon;\r\nso now as the Dusarian drew bead upon the rising flier, and touched\r\nthe button upon his rifle's stock, it was more to chance than\r\nproficiency that he owed the partial success of his aim.\r\n\r\nThe projectile grazed the flier's side, the opaque coating breaking\r\nsufficiently to permit daylight to strike in upon the powder phial\r\nwithin the bullet's nose.  There was a sharp explosion.  Carthoris\r\nfelt his craft reel drunkenly beneath him, and the engine stopped.\r\n\r\nThe momentum the air boat had gained carried her on over the city\r\ntoward the sea-bottom beyond.\r\n\r\nThe red warrior in the plaza fired several more shots, none of\r\nwhich scored.  Then a lofty minaret shut the drifting quarry from\r\nhis view.\r\n\r\nIn the distance before him Carthoris could see the green warrior\r\nbearing Thuvia of Ptarth away upon his mighty thoat.  The direction\r\nof his flight was toward the north-west of Aaanthor, where lay a\r\nmountainous country little known to red men.\r\n\r\nThe Heliumite now gave his attention to his injured craft.  A close\r\nexamination revealed the fact that one of the buoyancy tanks had\r\nbeen punctured, but the engine itself was uninjured.\r\n\r\nA splinter from the projectile had damaged one of the control levers\r\nbeyond the possibility of repair outside a machine shop; but after\r\nconsiderable tinkering, Carthoris was able to propel his wounded\r\nflier at low speed, a rate which could not approach the rapid gait\r\nof the thoat, whose eight long, powerful legs carried it over the\r\nochre vegetation of the dead sea-bottom at terrific speed.\r\n\r\nThe Prince of Helium chafed and fretted at the slowness of his\r\npursuit, yet he was thankful that the damage was no worse, for now\r\nhe could at least move more rapidly than on foot.\r\n\r\nBut even this meagre satisfaction was soon to be denied him, for\r\npresently the flier commenced to sag toward the port and by the bow.\r\nThe damage to the buoyancy tanks had evidently been more grievous\r\nthan he had at first believed.\r\n\r\nAll the balance of that long day Carthoris crawled erratically through\r\nthe still air, the bow of the flier sinking lower and lower, and\r\nthe list to port becoming more and more alarming, until at last,\r\nnear dark, he was floating almost bowdown, his harness buckled to\r\na heavy deck ring to keep him from being precipitated to the ground\r\nbelow.\r\n\r\nHis forward movement was now confined to a slow drifting with the\r\ngentle breeze that blew out of the south-east, and when this died\r\ndown with the setting of the sun, he let the flier sink gently to\r\nthe mossy carpet beneath.\r\n\r\nFar before him loomed the mountains toward which the green man had\r\nbeen fleeing when last he had seen him, and with dogged resolution\r\nthe son of John Carter, endowed with the indomitable will of his\r\nmighty sire, took up the pursuit on foot.\r\n\r\nAll that night he forged ahead until, with the dawning of a new\r\nday, he entered the low foothills that guard the approach to the\r\nfastness of the mountains of Torquas.\r\n\r\nRugged, granitic walls towered before him.  Nowhere could he discern\r\nan opening through the formidable barrier; yet somewhere into this\r\ninhospitable world of stone the green warrior had borne the woman\r\nof the red man's heart's desire.\r\n\r\nAcross the yielding moss of the sea-bottom there had been no spoor\r\nto follow, for the soft pads of the thoat but pressed down in his\r\nswift passage the resilient vegetation which sprang up again behind\r\nhis fleeting feet, leaving no sign.\r\n\r\nBut here in the hills, where loose rock occasionally strewed the\r\nway; where black loam and wild flowers partially replaced the sombre\r\nmonotony of the waste places of the lowlands, Carthoris hoped to\r\nfind some sign that would lead him in the right direction.\r\n\r\nYet, search as he would, the baffling mystery of the trail seemed\r\nlikely to remain for ever unsolved.\r\n\r\nIt was drawing toward the day's close once more when the keen eyes\r\nof the Heliumite discerned the tawny yellow of a sleek hide moving\r\namong the boulders several hundred yards to his left.\r\n\r\nCrouching quickly behind a large rock, Carthoris watched the thing\r\nbefore him.  It was a huge banth, one of those savage Barsoomian\r\nlions that roam the desolate hills of the dying planet.\r\n\r\nThe creature's nose was close to the ground.  It was evident that\r\nhe was following the spoor of meat by scent.\r\n\r\nAs Carthoris watched him, a great hope leaped into the man's heart.\r\nHere, possibly, might lie the solution to the mystery he had been\r\nendeavouring to solve.  This hungry carnivore, keen always for the\r\nflesh of man, might even now be trailing the two whom Carthoris\r\nsought.\r\n\r\nCautiously the youth crept out upon the trail of the man-eater.\r\nAlong the foot of the perpendicular cliff the creature moved,\r\nsniffing at the invisible spoor, and now and then emitting the low\r\nmoan of the hunting banth.\r\n\r\nCarthoris had followed the creature for but a few minutes when it\r\ndisappeared as suddenly and mysteriously as though dissolved into\r\nthin air.\r\n\r\nThe man leaped to his feet.  Not again was he to be cheated as the\r\nman had cheated him.  He sprang forward at a reckless pace to the\r\nspot at which he last had seen the great, skulking brute.\r\n\r\nBefore him loomed the sheer cliff, its face unbroken by any aperture\r\ninto which the huge banth might have wormed its great carcass.\r\nBeside him was a small, flat boulder, not larger than the deck of\r\na ten-man flier, nor standing to a greater height than twice his\r\nown stature.\r\n\r\nPerhaps the banth was in hiding behind this?  The brute might have\r\ndiscovered the man upon his trail, and even now be lying in wait\r\nfor his easy prey.\r\n\r\nCautiously, with drawn long-sword, Carthoris crept around the\r\ncorner of the rock.  There was no banth there, but something which\r\nsurprised him infinitely more than would the presence of twenty\r\nbanths.\r\n\r\nBefore him yawned the mouth of a dark cave leading downward into\r\nthe ground.  Through this the banth must have disappeared.  Was\r\nit his lair?  Within its dark and forbidding interior might there\r\nnot lurk not one but many of the fearsome creatures?\r\n\r\nCarthoris did not know, nor, with the thought that had been spurring\r\nhim onward upon the trail of the creature uppermost in his mind,\r\ndid he much care; for into this gloomy cavern he was sure the banth\r\nhad trailed the green man and his captive, and into it he, too,\r\nwould follow, content to give his life in the service of the woman\r\nhe loved.\r\n\r\nNot an instant did he hesitate, nor yet did he advance rashly; but\r\nwith ready sword and cautious steps, for the way was dark, he stole\r\non.  As he advanced, the obscurity became impenetrable blackness.\r\n\r\n\r\n\r\n\r\nCHAPTER V\r\n\r\nTHE FAIR RACE\r\n\r\n\r\nDownward along a smooth, broad floor led the strange tunnel, for\r\nsuch Carthoris was now convinced was the nature of the shaft he at\r\nfirst had thought but a cave.\r\n\r\nBefore him he could hear the occasional low moans of the banth, and\r\npresently from behind came a similar uncanny note.  Another banth\r\nhad entered the passageway on HIS trail!\r\n\r\nHis position was anything but pleasant.  His eyes could not penetrate\r\nthe darkness even to the distinguishing of his hand before his face,\r\nwhile the banths, he knew, could see quite well, though absence of\r\nlight were utter.\r\n\r\nNo other sounds came to his ears than the dismal, bloodthirsty\r\nmoanings of the beast ahead and the beast behind.\r\n\r\nThe tunnel had led straight, from where he had entered it beneath\r\nthe side of the rock furthest from the unscaleable cliffs, toward\r\nthe mighty barrier that had baffled him so long.\r\n\r\nNow it was running almost level, and presently he noted a gradual\r\nascent.\r\n\r\nThe beast behind him was gaining upon him, crowding him perilously\r\nclose upon the heels of the beast in front.  Presently he should\r\nhave to do battle with one, or both.  More firmly he gripped his\r\nweapon.\r\n\r\nNow he could hear the breathing of the banth at his heels.  Not\r\nfor much longer could he delay the encounter.\r\n\r\nLong since he had become assured that the tunnel led beneath the\r\ncliffs to the opposite side of the barrier, and he had hoped that\r\nhe might reach the moonlit open before being compelled to grapple\r\nwith either of the monsters.\r\n\r\nThe sun had been setting as he entered the tunnel, and the way\r\nhad been sufficiently long to assure him that darkness now reigned\r\nupon the world without.  He glanced behind him.  Blazing out of\r\nthe darkness, seemingly not ten paces behind, glared two flaming\r\npoints of fire.  As the savage eyes met his, the beast emitted a\r\nfrightful roar and then he charged.\r\n\r\nTo face that savage mountain of onrushing ferocity, to stand unshaken\r\nbefore the hideous fangs that he knew were bared in slavering\r\nblood-thirstiness, though he could not see them, required nerves\r\nof steel; but of such were the nerves of Carthoris of Helium.\r\n\r\nHe had the brute's eyes to guide his point, and, as true as the\r\nsword hand of his mighty sire, his guided the keen point to one of\r\nthose blazing orbs, even as he leaped lightly to one side.\r\n\r\nWith a hideous scream of pain and rage, the wounded banth hurtled,\r\nclawing, past him.  Then it turned to charge once more; but this\r\ntime Carthoris saw but a single gleaming point of fiery hate directed\r\nupon him.\r\n\r\nAgain the needle point met its flashing target.  Again the horrid\r\ncry of the stricken beast reverberated through the rocky tunnel,\r\nshocking in its torture-laden shrillness, deafening in its terrific\r\nvolume.\r\n\r\nBut now, as it turned to charge again, the man had no guide whereby\r\nto direct his point.  He heard the scraping of the padded feet upon\r\nthe rocky floor.  He knew the thing was charging down upon him once\r\nagain, but he could see nothing.\r\n\r\nYet, if he could not see his antagonist, neither could his antagonist\r\nnow see him.\r\n\r\nLeaping, as he thought, to the exact centre of the tunnel, he held\r\nhis sword point ready on a line with the beast's chest.  It was\r\nall that he could do, hoping that chance might send the point into\r\nthe savage heart as he went down beneath the great body.\r\n\r\nSo quickly was the thing over that Carthoris could scarce believe\r\nhis senses as the mighty body rushed madly past him.  Either he\r\nhad not placed himself in the centre of the tunnel, or else the\r\nblinded banth had erred in its calculations.\r\n\r\nHowever, the huge body missed him by a foot, and the creature\r\ncontinued on down the tunnel as though in pursuit of the prey that\r\nhad eluded him.\r\n\r\nCarthoris, too, followed the same direction, nor was it long before\r\nhis heart was gladdened by the sight of the moonlit exit from the\r\nlong, dark passage.\r\n\r\nBefore him lay a deep hollow, entirely surrounded by gigantic\r\ncliffs.  The surface of the valley was dotted with enormous trees,\r\na strange sight so far from a Martian waterway.  The ground itself\r\nwas clothed in brilliant scarlet sward, picked out with innumerable\r\npatches of gorgeous wild flowers.\r\n\r\nBeneath the glorious effulgence of the two moons the scene was one\r\nof indescribable loveliness, tinged with the weirdness of strange\r\nenchantment.\r\n\r\nFor only an instant, however, did his gaze rest upon the natural\r\nbeauties outspread before him.  Almost immediately they were riveted\r\nupon the figure of a great banth standing across the carcass of a\r\nnew-killed thoat.\r\n\r\nThe huge beast, his tawny mane bristling around his hideous head,\r\nkept his eyes fixed upon another banth that charged erratically\r\nhither and thither, with shrill screams of pain, and horrid roars\r\nof hate and rage.\r\n\r\nCarthoris quickly guessed that the second brute was the one he had\r\nblinded during the fight in the tunnel, but it was the dead thoat\r\nthat centred his interest more than either of the savage carnivores.\r\n\r\nThe harness was still upon the body of the huge Martian mount, and\r\nCarthoris could not doubt but that this was the very animal upon\r\nwhich the green warrior had borne away Thuvia of Ptarth.\r\n\r\nBut where were the rider and his prisoner?  The Prince of Helium\r\nshuddered as he thought upon the probability of the fate that had\r\novertaken them.\r\n\r\nHuman flesh is the food most craved by the fierce Barsoomian lion,\r\nwhose great carcass and giant thews require enormous quantities of\r\nmeat to sustain them.\r\n\r\nTwo human bodies would have but whetted the creature's appetite,\r\nand that he had killed and eaten the green man and the red girl\r\nseemed only too likely to Carthoris.  He had left the carcass\r\nof the mighty thoat to be devoured after having consumed the more\r\ntooth-some portion of his banquet.\r\n\r\nNow the sightless banth, in its savage, aimless charging and\r\ncounter-charging, had passed beyond the kill of its fellow, and\r\nthere the light breeze that was blowing wafted the scent of new\r\nblood to its nostrils.\r\n\r\nNo longer were its movements erratic.  With outstretched tail and\r\nfoaming jaws it charged straight as an arrow, for the body of the\r\nthoat and the mighty creature of destruction that stood with forepaws\r\nupon the slate-grey side, waiting to defend its meat.\r\n\r\nWhen the charging banth was twenty paces from the dead thoat the\r\nkiller gave vent to its hideous challenge, and with a mighty spring\r\nleaped forward to meet it.\r\n\r\nThe battle that ensued awed even the warlike Barsoomian.  The\r\nmad rending, the hideous and deafening roaring, the implacable\r\nsavagery of the blood-stained beasts held him in the paralysis\r\nof fascination, and when it was over and the two creatures, their\r\nheads and shoulders torn to ribbons, lay with their dead jaws\r\nstill buried in each other's bodies, Carthoris tore himself from\r\nthe spell only by an effort of the will.\r\n\r\nHurrying to the side of the dead thoat, he searched for traces of\r\nthe girl he feared had shared the thoat's fate, but nowhere could\r\nhe discover anything to confirm his fears.\r\n\r\nWith slightly lightened heart he started out to explore the valley,\r\nbut scarce a dozen steps had he taken when the glistening of a\r\njewelled bauble lying on the sward caught his eye.\r\n\r\nAs he picked it up his first glance showed him that it was a\r\nwoman's hair ornament, and emblazoned upon it was the insignia of\r\nthe royal house of Ptarth.\r\n\r\nBut, sinister discovery, blood, still wet, splotched the magnificent\r\njewels of the setting.\r\n\r\nCarthoris half choked as the dire possibilities which the thing\r\nsuggested presented themselves to his imagination.  Yet he could\r\nnot, would not believe it.\r\n\r\nIt was impossible that that radiant creature could have met so\r\nhideous an end.  It was incredible that the glorious Thuvia should\r\never cease to be.\r\n\r\nUpon his already jewel-encrusted harness, to the strap that crossed\r\nhis great chest beneath which beat his loyal heart, Carthoris,\r\nPrince of Helium, fastened the gleaming thing that Thuvia of Ptarth\r\nhad worn, and wearing, had made holy to the Heliumite.\r\n\r\nThen he proceeded upon his way into the heart of the unknown valley.\r\n\r\nFor the most part the giant trees shut off his view to any but the\r\nmost limited distances.  Occasionally he caught glimpses of the\r\ntowering hills that bounded the valley upon every side, and though\r\nthey stood out clear beneath the light of the two moons, he knew that\r\nthey were far off, and that the extent of the valley was immense.\r\n\r\nFor half the night he continued his search, until presently he was\r\nbrought to a sudden halt by the distant sound of squealing thoats.\r\n\r\nGuided by the noise of these habitually angry beasts, he stole\r\nforward through the trees until at last he came upon a level,\r\ntreeless plain, in the centre of which a mighty city reared its\r\nburnished domes and vividly coloured towers.\r\n\r\nAbout the walled city the red man saw a huge encampment of the\r\ngreen warriors of the dead sea-bottoms, and as he let his eyes\r\nrove carefully over the city he realized that here was no deserted\r\nmetropolis of a dead past.\r\n\r\nBut what city could it be?  His studies had taught him that in this\r\nlittle-explored portion of Barsoom the fierce tribe of Torquasian\r\ngreen men ruled supreme, and that as yet no red man had succeeded\r\nin piercing to the heart of their domain to return again to the\r\nworld of civilization.\r\n\r\nThe men of Torquas had perfected huge guns with which their uncanny\r\nmarksmanship had permitted them to repulse the few determined\r\nefforts that near-by red nations had made to explore their country\r\nby means of battle fleets of airships.\r\n\r\nThat he was within the boundary of Torquas, Carthoris was sure, but\r\nthat there existed there such a wondrous city he never had dreamed,\r\nnor had the chronicles of the past even hinted at such a possibility,\r\nfor the Torquasians were known to live, as did the other green men\r\nof Mars, within the deserted cities that dotted the dying planet,\r\nnor ever had any green horde built so much as a single edifice,\r\nother than the low-walled incubators where their young are hatched\r\nby the sun's heat.\r\n\r\nThe encircling camp of green warriors lay about five hundred yards\r\nfrom the city's walls.  Between it and the city was no semblance\r\nof breastwork or other protection against rifle or cannon fire;\r\nyet distinctly now in the light of the rising sun Carthoris could\r\nsee many figures moving along the summit of the high wall, and upon\r\nthe roof tops beyond.\r\n\r\nThat they were beings like himself he was sure, though they were at\r\ntoo great distance from him for him to be positive that they were\r\nred men.\r\n\r\nAlmost immediately after sunrise the green warriors commenced firing\r\nupon the little figures upon the wall.  To Carthoris' surprise\r\nthe fire was not returned, but presently the last of the city's\r\ninhabitants had sought shelter from the weird marksmanship of the\r\ngreen men, and no further sign of life was visible beyond the wall.\r\n\r\nThen Carthoris, keeping within the shelter of the trees that fringed\r\nthe plain, began circling the rear of the besiegers' line, hoping\r\nagainst hope that somewhere he would obtain sight of Thuvia of\r\nPtarth, for even now he could not believe that she was dead.\r\n\r\nThat he was not discovered was a miracle, for mounted warriors were\r\nconstantly riding back and forth from the camp into the forest; but\r\nthe long day wore on and still he continued his seemingly fruitless\r\nquest, until, near sunset, he came opposite a mighty gate in the\r\ncity's western wall.\r\n\r\nHere seemed to be the principal force of the attacking horde.\r\nHere a great platform had been erected whereon Carthoris could see\r\nsquatting a huge green warrior, surrounded by others of his kind.\r\n\r\nThis, then, must be the notorious Hortan Gur, Jeddak of Torquas,\r\nthe fierce old ogre of the south-western hemisphere, as only for\r\na jeddak are platforms raised in temporary camps or upon the march\r\nby the green hordes of Barsoom.\r\n\r\nAs the Heliumite watched he saw another green warrior push his way\r\nforward toward the rostrum.  Beside him he dragged a captive, and\r\nas the surrounding warriors parted to let the two pass, Carthoris\r\ncaught a fleeting glimpse of the prisoner.\r\n\r\nHis heart leaped in rejoicing.  Thuvia of Ptarth still lived!\r\n\r\nIt was with difficulty that Carthoris restrained the impulse to\r\nrush forward to the side of the Ptarthian princess; but in the end\r\nhis better judgment prevailed, for in the face of such odds he knew\r\nthat he should have been but throwing away, uselessly, any future\r\nopportunity he might have to succour her.\r\n\r\nHe saw her dragged to the foot of the rostrum.  He saw Hortan Gur\r\naddress her.  He could not hear the creature's words, nor Thuvia's\r\nreply; but it must have angered the green monster, for Carthoris\r\nsaw him leap toward the prisoner, striking her a cruel blow across\r\nthe face with his metal-banded arm.\r\n\r\nThen the son of John Carter, Jeddak of Jeddaks, Warlord of Barsoom,\r\nwent mad.  The old, blood-red haze through which his sire had glared\r\nat countless foes, floated before his eyes.\r\n\r\nHis half-Earthly muscles, responding quickly to his will, sent\r\nhim in enormous leaps and bounds toward the green monster that had\r\nstruck the woman he loved.\r\n\r\nThe Torquasians were not looking in the direction of the forest.\r\nAll eyes had been upon the figures of the girl and their jeddak,\r\nand loud was the hideous laughter that rang out in appreciation of\r\nthe wit of the green emperor's reply to his prisoner's appeal for\r\nliberty.\r\n\r\nCarthoris had covered about half the distance between the forest\r\nand the green warriors, when a new factor succeeded in still further\r\ndirecting the attention of the latter from him.\r\n\r\nUpon a high tower within the beleaguered city a man appeared.  From\r\nhis upturned mouth there issued a series of frightful shrieks;\r\nuncanny shrieks that swept, shrill and terrifying, across the city's\r\nwalls, over the heads of the besiegers, and out across the forest\r\nto the uttermost confines of the valley.\r\n\r\nOnce, twice, thrice the fearsome sound smote upon the ears of the\r\nlistening green men and then far, far off across the broad woods\r\ncame sharp and clear from the distance an answering shriek.\r\n\r\nIt was but the first.  From every point rose similar savage cries,\r\nuntil the world seemed to tremble to their reverberations.\r\n\r\nThe green warriors looked nervously this way and that.  They knew\r\nnot fear, as Earth men may know it; but in the face of the unusual\r\ntheir wonted self-assurance deserted them.\r\n\r\nAnd then the great gate in the city wall opposite the platform of\r\nHortan Gur swung suddenly wide.  From it issued as strange a sight\r\nas Carthoris ever had witnessed, though at the moment he had time\r\nto cast but a single fleeting glance at the tall bowmen emerging\r\nthrough the portal behind their long, oval shields; to note their\r\nflowing auburn hair; and to realize that the growling things at\r\ntheir side were fierce Barsoomian lions.\r\n\r\nThen he was in the midst of the astonished Torquasians.  With\r\ndrawn long-sword he was among them, and to Thuvia of Ptarth, whose\r\nstartled eyes were the first to fall upon him, it seemed that she\r\nwas looking upon John Carter himself, so strangely similar to the\r\nfighting of the father was that of the son.\r\n\r\nEven to the famous fighting smile of the Virginian was the resemblance\r\ntrue.  And the sword arm!  Ah, the subtleness of it, and the speed!\r\n\r\nAll about was turmoil and confusion.  Green warriors were leaping\r\nto the backs of their restive, squealing thoats.  Calots were\r\ngrowling out their savage gutturals, whining to be at the throats\r\nof the oncoming foemen.\r\n\r\nThar Ban and another by the side of the rostrum had been the first\r\nto note the coming of Carthoris, and it was with them he battled\r\nfor possession of the red girl, while the others hastened to meet\r\nthe host advancing from the beleaguered city.\r\n\r\nCarthoris sought both to defend Thuvia of Ptarth and reach the\r\nside of the hideous Hortan Gur that he might avenge the blow the\r\ncreature had struck the girl.\r\n\r\nHe succeeded in reaching the rostrum, over the dead bodies of\r\ntwo warriors who had turned to join Thar Ban and his companion in\r\nrepulsing this adventurous red man, just as Hortan Gur was about\r\nto leap from it to the back of his thoat.\r\n\r\nThe attention of the green warriors turned principally upon\r\nthe bowmen advancing upon them from the city, and upon the savage\r\nbanths that paced beside them--cruel beasts of war, infinitely more\r\nterrible than their own savage calots.\r\n\r\nAs Carthoris leaped to the rostrum he drew Thuvia up beside him,\r\nand then he turned upon the departing jeddak with an angry challenge\r\nand a sword thrust.\r\n\r\nAs the Heliumite's point pricked his green hide, Hortan Gur turned\r\nupon his adversary with a snarl, but at the same instant two\r\nof his chieftains called to him to hasten, for the charge of the\r\nfair-skinned inhabitants of the city was developing into a more\r\nserious matter than the Torquasians had anticipated.\r\n\r\nInstead of remaining to battle with the red man, Hortan Gur promised\r\nhim his attention after he had disposed of the presumptuous citizens\r\nof the walled city, and, leaping astride his thoat, galloped off\r\nto meet the rapidly advancing bowmen.\r\n\r\nThe other warriors quickly followed their jeddak, leaving Thuvia\r\nand Carthoris alone upon the platform.\r\n\r\nBetween them and the city raged a terrific battle.  The fair-skinned\r\nwarriors, armed only with their long bows and a kind of short-handled\r\nwar-axe, were almost helpless beneath the savage mounted green men\r\nat close quarters; but at a distance their sharp arrows did fully\r\nas much execution as the radium projectiles of the green men.\r\n\r\nBut if the warriors themselves were outclassed, not so their savage\r\ncompanions, the fierce banths.  Scarce had the two lines come\r\ntogether when hundreds of these appalling creatures had leaped\r\namong the Torquasians, dragging warriors from their thoats--dragging\r\ndown the huge thoats themselves, and bringing consternation to all\r\nbefore them.\r\n\r\nThe numbers of the citizenry, too, was to their advantage, for\r\nit seemed that scarce a warrior fell but his place was taken by a\r\nscore more, in such a constant stream did they pour from the city's\r\ngreat gate.\r\n\r\nAnd so it came, what with the ferocity of the banths and the\r\nnumbers of the bowmen, that at last the Torquasians fell back,\r\nuntil presently the platform upon which stood Carthoris and Thuvia\r\nlay directly in the centre of the fight.\r\n\r\nThat neither was struck by a bullet or an arrow seemed a miracle\r\nto both; but at last the tide had rolled completely past them, so\r\nthat they were alone between the fighters and the city, except for\r\nthe dying and the dead, and a score or so of growling banths, less\r\nwell trained than their fellows, who prowled among the corpses\r\nseeking meat.\r\n\r\nTo Carthoris the strangest part of the battle had been the terrific\r\ntoll taken by the bowmen with their relatively puny weapons.  Nowhere\r\nthat he could see was there a single wounded green man, but the\r\ncorpses of their dead lay thick upon the field of battle.\r\n\r\nDeath seemed to follow instantly the slightest pinprick of a bowman's\r\narrow, nor apparently did one ever miss its goal.  There could be\r\nbut one explanation: the missiles were poison-tipped.\r\n\r\nPresently the sounds of conflict died in the distant forest.\r\nQuiet reigned, broken only by the growling of the devouring banths.\r\nCarthoris turned toward Thuvia of Ptarth.  As yet neither had\r\nspoken.\r\n\r\n\"Where are we, Thuvia?\" he asked.\r\n\r\nThe girl looked at him questioningly.  His very presence had seemed\r\nto proclaim a guilty knowledge of her abduction.  How else might\r\nhe have known the destination of the flier that brought her!\r\n\r\n\"Who should know better than the Prince of Helium?\" she asked in\r\nreturn.  \"Did he not come hither of his own free will?\"\r\n\r\n\"From Aaanthor I came voluntarily upon the trail of the green man\r\nwho had stolen you, Thuvia,\" he replied; \"but from the time I left\r\nHelium until I awoke above Aaanthor I thought myself bound for\r\nPtarth.\r\n\r\n\"It had been intimated that I had guilty knowledge of your abduction,\"\r\nhe explained simply, \"and I was hastening to the jeddak, your\r\nfather, to convince him of the falsity of the charge, and to give my\r\nservice to your recovery.  Before I left Helium some one tampered\r\nwith my compass, so that it bore me to Aaanthor instead of to\r\nPtarth.  That is all.  You believe me?\"\r\n\r\n\"But the warriors who stole me from the garden!\" she exclaimed.\r\n\"After we arrived at Aaanthor they wore the metal of the Prince of\r\nHelium.  When they took me they were trapped in Dusarian harness.\r\nThere seemed but a single explanation.  Whoever dared the outrage\r\nwished to put the onus upon another, should he be detected in the\r\nact; but once safely away from Ptarth he felt safe in having his\r\nminions return to their own harness.\"\r\n\r\n\"You believe that I did this thing, Thuvia?\" he asked.\r\n\r\n\"Ah, Carthoris,\" she replied sadly, \"I did not wish to believe it;\r\nbut when everything pointed to you--even then I would not believe\r\nit.\"\r\n\r\n\"I did not do it, Thuvia,\" he said.  \"But let me be entirely honest\r\nwith you.  As much as I love your father, as much as I respect Kulan\r\nTith, to whom you are betrothed, as well as I know the frightful\r\nconsequences that must have followed such an act of mine, hurling\r\ninto war, as it would, three of the greatest nations of Barsoom--yet,\r\nnotwithstanding all this, I should not have hesitated to take you\r\nthus, Thuvia of Ptarth, had you even hinted that it would not have\r\ndispleased YOU.\r\n\r\n\"But you did nothing of the kind, and so I am here, not in my own\r\nservice, but in yours, and in the service of the man to whom you\r\nare promised, to save you for him, if it lies within the power of\r\nman to do so,\" he concluded, almost bitterly.\r\n\r\nThuvia of Ptarth looked into his face for several moments.  Her\r\nbreast was rising and falling as though to some resistless emotion.\r\nShe half took a step toward him.  Her lips parted as though to\r\nspeak--swiftly and impetuously.\r\n\r\nAnd then she conquered whatever had moved her.\r\n\r\n\"The future acts of the Prince of Helium,\" she said coldly, \"must\r\nconstitute the proof of his past honesty of purpose.\"\r\n\r\nCarthoris was hurt by the girl's tone, as much as by the doubt as\r\nto his integrity which her words implied.\r\n\r\nHe had half hoped that she might hint that his love would be\r\nacceptable--certainly there was due him at least a little gratitude\r\nfor his recent acts in her behalf; but the best he received was\r\ncold skepticism.\r\n\r\nThe Prince of Helium shrugged his broad shoulders.  The girl noted\r\nit, and the little smile that touched his lips, so that it became\r\nher turn to be hurt.\r\n\r\nOf course she had not meant to hurt him.  He might have known that\r\nafter what he had said she could not do anything to encourage him!\r\nBut he need not have made his indifference quite so palpable.  The\r\nmen of Helium were noted for their gallantry--not for boorishness.\r\nPossibly it was the Earth blood that flowed in his veins.\r\n\r\nHow could she know that the shrug was but Carthoris' way of\r\nattempting, by physical effort, to cast blighting sorrow from his\r\nheart, or that the smile upon his lips was the fighting smile of his\r\nfather with which the son gave outward evidence of the determination\r\nhe had reached to submerge his own great love in his efforts to\r\nsave Thuvia of Ptarth for another, because he believed that she\r\nloved this other!\r\n\r\nHe reverted to his original question.\r\n\r\n\"Where are we?\" he asked.  \"I do not know.\"\r\n\r\n\"Nor I,\" replied the girl.  \"Those who stole me from Ptarth spoke\r\namong themselves of Aaanthor, so that I thought it possible that\r\nthe ancient city to which they took me was that famous ruin; but\r\nwhere we may be now I have no idea.\"\r\n\r\n\"When the bowmen return we shall doubtless learn all that there is\r\nto know,\" said Carthoris.  \"Let us hope that they prove friendly.\r\nWhat race may they be?  Only in the most ancient of our legends\r\nand in the mural paintings of the deserted cities of the dead\r\nsea-bottoms are depicted such a race of auburn-haired, fair-skinned\r\npeople.  Can it be that we have stumbled upon a surviving city of\r\nthe past which all Barsoom believes buried beneath the ages?\"\r\n\r\nThuvia was looking toward the forest into which the green men and\r\nthe pursuing bowmen had disappeared.  From a great distance came\r\nthe hideous cries of banths, and an occasional shot.\r\n\r\n\"It is strange that they do not return,\" said the girl.\r\n\r\n\"One would expect to see the wounded limping or being carried back\r\nto the city,\" replied Carthoris, with a puzzled frown.  \"But how\r\nabout the wounded nearer the city?  Have they carried them within?\"\r\n\r\nBoth turned their eyes toward the field between them and the walled\r\ncity, where the fighting had been most furious.\r\n\r\nThere were the banths, still growling about their hideous feast.\r\n\r\nCarthoris looked at Thuvia in astonishment.  Then he pointed toward\r\nthe field.\r\n\r\n\"Where are they?\" he whispered.  \"WHAT HAS BECOME OF THEIR DEAD\r\nAND WOUNDED?\"\r\n\r\n\r\n\r\n\r\nCHAPTER VI\r\n\r\nTHE JEDDAK OF LOTHAR\r\n\r\n\r\nThe girl looked her incredulity.\r\n\r\n\"They lay in piles,\" she murmured.  \"There were thousands of them\r\nbut a minute ago.\"\r\n\r\n\"And now,\" continued Carthoris, \"there remain but the banths and\r\nthe carcasses of the green men.\"\r\n\r\n\"They must have sent forth and carried the dead bowmen away while\r\nwe were talking,\" said the girl.\r\n\r\n\"It is impossible!\" replied Carthoris.  \"Thousands of dead lay\r\nthere upon the field but a moment since.  It would have required\r\nmany hours to have removed them.  The thing is uncanny.\"\r\n\r\n\"I had hoped,\" said Thuvia, \"that we might find an asylum with\r\nthese fair-skinned people.  Notwithstanding their valour upon the\r\nfield of battle, they did not strike me as a ferocious or warlike\r\npeople.  I had been about to suggest that we seek entrance to the\r\ncity, but now I scarce know if I care to venture among people whose\r\ndead vanish into thin air.\"\r\n\r\n\"Let us chance it,\" replied Carthoris.  \"We can be no worse off within\r\ntheir walls than without.  Here we may fall prey to the banths or\r\nthe no less fierce Torquasians.  There, at least, we shall find\r\nbeings moulded after our own images.\r\n\r\n\"All that causes me to hesitate,\" he added, \"is the danger of taking\r\nyou past so many banths.  A single sword would scarce prevail were\r\neven a couple of them to charge simultaneously.\"\r\n\r\n\"Do not fear on that score,\" replied the girl, smiling.  \"The banths\r\nwill not harm us.\"\r\n\r\nAs she spoke she descended from the platform, and with Carthoris\r\nat her side stepped fearlessly out upon the bloody field in the\r\ndirection of the walled city of mystery.\r\n\r\nThey had advanced but a short distance when a banth, looking up\r\nfrom its gory feast, descried them.  With an angry roar the beast\r\nwalked quickly in their direction, and at the sound of its voice\r\na score of others followed its example.\r\n\r\nCarthoris drew his long-sword.  The girl stole a quick glance\r\nat his face.  She saw the smile upon his lips, and it was as wine\r\nto sick nerves; for even upon warlike Barsoom where all men are\r\nbrave, woman reacts quickly to quiet indifference to danger--to\r\ndare-deviltry that is without bombast.\r\n\r\n\"You may return your sword,\" she said.  \"I told you that the banths\r\nwould not harm us.  Look!\" and as she spoke she stepped quickly\r\ntoward the nearest animal.\r\n\r\nCarthoris would have leaped after her to protect her, but with a\r\ngesture she motioned him back.  He heard her calling to the banths\r\nin a low, singsong voice that was half purr.\r\n\r\nInstantly the great heads went up and all the wicked eyes\r\nwere riveted upon the figure of the girl.  Then, stealthily, they\r\ncommenced moving toward her.  She had stopped now and was standing\r\nwaiting them.\r\n\r\nOne, closer to her than the others, hesitated.  She spoke to him\r\nimperiously, as a master might speak to a refractory hound.\r\n\r\nThe great carnivore let its head droop, and with tail between its\r\nlegs came slinking to the girl's feet, and after it came the others\r\nuntil she was entirely surrounded by the savage maneaters.\r\n\r\nTurning she led them to where Carthoris stood.  They growled a little\r\nas they neared the man, but a few sharp words of command put them\r\nin their places.\r\n\r\n\"How do you do it?\" exclaimed Carthoris.\r\n\r\n\"Your father once asked me that same question in the galleries of\r\nthe Golden Cliffs within the Otz Mountains, beneath the temples of\r\nthe therns.  I could not answer him, nor can I answer you.  I do\r\nnot know whence comes my power over them, but ever since the day\r\nthat Sator Throg threw me among them in the banth pit of the Holy\r\nTherns, and the great creatures fawned upon instead of devouring\r\nme, I ever have had the same strange power over them.  They come\r\nat my call and do my bidding, even as the faithful Woola does the\r\nbidding of your mighty sire.\"\r\n\r\nWith a word the girl dispersed the fierce pack.  Roaring, they\r\nreturned to their interrupted feast, while Carthoris and Thuvia\r\npassed among them toward the walled city.\r\n\r\nAs they advanced the man looked with wonder upon the dead bodies\r\nof those of the green men that had not been devoured or mauled by\r\nthe banths.\r\n\r\nHe called the girl's attention to them.  No arrows protruded from\r\nthe great carcasses.  Nowhere upon any of them was the sign of\r\nmortal wound, nor even slightest scratch or abrasion.\r\n\r\nBefore the bowmen's dead had disappeared the corpses of the Torquasians\r\nhad bristled with the deadly arrows of their foes.  Where had the\r\nslender messengers of death departed?  What unseen hand had plucked\r\nthem from the bodies of the slain?\r\n\r\nDespite himself Carthoris could scarce repress a shudder of\r\napprehension as he glanced toward the silent city before them.  No\r\nlonger was sign of life visible upon wall or roof top.  All was\r\nquiet--brooding, ominous quiet.\r\n\r\nYet he was sure that eyes watched them from somewhere behind that\r\nblank wall.\r\n\r\nHe glanced at Thuvia.  She was advancing with wide eyes fixed upon\r\nthe city gate.  He looked in the direction of her gaze, but saw\r\nnothing.\r\n\r\nHis gaze upon her seemed to arouse her as from a lethargy.  She\r\nglanced up at him, a quick, brave smile touching her lips, and then,\r\nas though the act was involuntary, she came close to his side and\r\nplaced one of her hands in his.\r\n\r\nHe guessed that something within her that was beyond her conscious\r\ncontrol was appealing to him for protection.  He threw an arm about\r\nher, and thus they crossed the field.  She did not draw away from\r\nhim.  It is doubtful that she realized that his arm was there, so\r\nengrossed was she in the mystery of the strange city before them.\r\n\r\nThey stopped before the gate.  It was a mighty thing.  From its\r\nconstruction Carthoris could but dimly speculate upon its unthinkable\r\nantiquity.\r\n\r\nIt was circular, closing a circular aperture, and the Heliumite knew\r\nfrom his study of ancient Barsoomian architecture that it rolled\r\nto one side, like a huge wheel, into an aperture in the wall.\r\n\r\nEven such world-old cities as ancient Aaanthor were as yet undreamed\r\nof when the races lived that built such gates as these.\r\n\r\nAs he stood speculating upon the identity of this forgotten city,\r\na voice spoke to them from above.  Both looked up.  There, leaning\r\nover the edge of the high wall, was a man.\r\n\r\nHis hair was auburn, his skin fair--fairer even than that of John\r\nCarter, the Virginian.  His forehead was high, his eyes large and\r\nintelligent.\r\n\r\nThe language that he used was intelligible to the two below,\r\nyet there was a marked difference between it and their Barsoomian\r\ntongue.\r\n\r\n\"Who are you?\" he asked.  \"And what do you here before the gate of\r\nLothar?\"\r\n\r\n\"We are friends,\" replied Carthoris.  \"This be the princess,\r\nThuvia of Ptarth, who was captured by the Torquasian horde.  I am\r\nCarthoris of Helium, Prince of the house of Tardos Mors, Jeddak of\r\nHelium, and son of John Carter, Warlord of Mars, and of his wife,\r\nDejah Thoris.\"\r\n\r\n\"'Ptarth'?\" repeated the man.  \"'Helium'?\"  He shook his head.  \"I\r\nnever have heard of these places, nor did I know that there dwelt\r\nupon Barsoom a race of thy strange colour.  Where may these cities\r\nlie, of which you speak?  From our loftiest tower we have never\r\nseen another city than Lothar.\"\r\n\r\nCarthoris pointed toward the north-east.\r\n\r\n\"In that direction lie Helium and Ptarth,\" he said.  \"Helium is over\r\neight thousand haads from Lothar, while Ptarth lies nine thousand\r\nfive hundred haads north-east of Helium.\"[1]\r\n\r\n\r\n[1]On Barsoom the AD is the basis of linear measurement.  It is\r\nthe equivalent of an Earthly foot, measuring about 11.694 Earth\r\ninches.  As has been my custom in the past, I have generally\r\ntranslated Barsoomian symbols of time, distance, etc., into their\r\nEarthly equivalent, as being more easily understood by Earth readers.\r\nFor those of a more studious turn of mind it may be interesting\r\nto know the Martian table of linear measurement, and so I give it\r\nhere:\r\n\r\n     10 sofads = 1 ad\r\n    200 ads    = 1 haad\r\n    100 haads  = 1 karad\r\n    360 karads = 1 circumference of Mars at equator.\r\n\r\nA haad, or Barsoomian mile, contains about 2,339 Earth feet.  A\r\nkarad is one degree.  A sofad about 1.17 Earth inches.\r\n\r\n\r\nStill the man shook his head.\r\n\r\n\"I know of nothing beyond the Lotharian hills,\" he said.  \"Naught\r\nmay live there beside the hideous green hordes of Torquas.  They\r\nhave conquered all Barsoom except this single valley and the city\r\nof Lothar.  Here we have defied them for countless ages, though\r\nperiodically they renew their attempts to destroy us.  From whence\r\nyou come I cannot guess unless you be descended from the slaves\r\nthe Torquasians captured in early times when they reduced the outer\r\nworld to their vassalage; but we had heard that they destroyed all\r\nother races but their own.\"\r\n\r\nCarthoris tried to explain that the Torquasians ruled but a\r\nrelatively tiny part of the surface of Barsoom, and even this only\r\nbecause their domain held nothing to attract the red race; but the\r\nLotharian could not seem to conceive of anything beyond the valley\r\nof Lothar other than a trackless waste peopled by the ferocious\r\ngreen hordes of Torquas.\r\n\r\nAfter considerable parleying he consented to admit them to the\r\ncity, and a moment later the wheel-like gate rolled back within\r\nits niche, and Thuvia and Carthoris entered the city of Lothar.\r\n\r\nAll about them were evidences of fabulous wealth.  The facades of\r\nthe buildings fronting upon the avenue within the wall were richly\r\ncarven, and about the windows and doors were ofttimes set foot-wide\r\nborders of precious stones, intricate mosaics, or tablets of beaten\r\ngold bearing bas-reliefs depicting what may have been bits of the\r\nhistory of this forgotten people.\r\n\r\nHe with whom they had conversed across the wall was in the avenue\r\nto receive them.  About him were a hundred or more men of the same\r\nrace.  All were clothed in flowing robes and all were beardless.\r\n\r\nTheir attitude was more of fearful suspicion than antagonism.  They\r\nfollowed the new-comers with their eyes; but spoke no word to them.\r\n\r\nCarthoris could not but notice the fact that though the city had\r\nbeen but a short time before surrounded by a horde of bloodthirsty\r\ndemons yet none of the citizens appeared to be armed, nor was there\r\nsign of soldiery about.\r\n\r\nHe wondered if all the fighting men had sallied forth in one supreme\r\neffort to rout the foe, leaving the city all unguarded.  He asked\r\ntheir host.\r\n\r\nThe man smiled.\r\n\r\n\"No creature other than a score or so of our sacred banths has left\r\nLothar to-day,\" he replied.\r\n\r\n\"But the soldiers--the bowmen!\" exclaimed Carthoris.  \"We saw\r\nthousands emerge from this very gate, overwhelming the hordes of\r\nTorquas and putting them to rout with their deadly arrows and their\r\nfierce banths.\"\r\n\r\nStill the man smiled his knowing smile.\r\n\r\n\"Look!\" he cried, and pointed down a broad avenue before him.\r\n\r\nCarthoris and Thuvia followed the direction indicated, and there,\r\nmarching bravely in the sunlight, they saw advancing toward them\r\na great army of bowmen.\r\n\r\n\"Ah!\" exclaimed Thuvia.  \"They have returned through another gate,\r\nor perchance these be the troops that remained to defend the city?\"\r\n\r\nAgain the fellow smiled his uncanny smile.\r\n\r\n\"There are no soldiers in Lothar,\" he said.  \"Look!\"\r\n\r\nBoth Carthoris and Thuvia had turned toward him while he spoke,\r\nand now as they turned back again toward the advancing regiments\r\ntheir eyes went wide in astonishment, for the broad avenue before\r\nthem was as deserted as the tomb.\r\n\r\n\"And those who marched out upon the hordes to-day?\" whispered\r\nCarthoris.  \"They, too, were unreal?\"\r\n\r\nThe man nodded.\r\n\r\n\"But their arrows slew the green warriors,\" insisted Thuvia.\r\n\r\n\"Let us go before Tario,\" replied the Lotharian.  \"He will tell you\r\nthat which he deems it best you know.  I might tell you too much.\"\r\n\r\n\"Who is Tario?\" asked Carthoris.\r\n\r\n\"Jeddak of Lothar,\" replied the guide, leading them up the broad\r\navenue down which they had but a moment since seen the phantom army\r\nmarching.\r\n\r\nFor half an hour they walked along lovely avenues between the most\r\ngorgeous buildings that the two had ever seen.  Few people were in\r\nevidence.  Carthoris could not but note the deserted appearance of\r\nthe mighty city.\r\n\r\nAt last they came to the royal palace.  Carthoris saw it from a\r\ndistance, and guessing the nature of the magnificent pile wondered\r\nthat even here there should be so little sign of activity and life.\r\n\r\nNot even a single guard was visible before the great entrance gate,\r\nnor in the gardens beyond, into which he could see, was there sign\r\nof the myriad life that pulses within the precincts of the royal\r\nestates of the red jeddaks.\r\n\r\n\"Here,\" said their guide, \"is the palace of Tario.\"\r\n\r\nAs he spoke Carthoris again let his gaze rest upon the wondrous\r\npalace.  With a startled exclamation he rubbed his eyes and looked\r\nagain.  No!  He could not be mistaken.  Before the massive gate\r\nstood a score of sentries.  Within, the avenue leading to the main\r\nbuilding was lined on either side by ranks of bowmen.  The gardens\r\nwere dotted with officers and soldiers moving quickly to and fro,\r\nas though bent upon the duties of the minute.\r\n\r\nWhat manner of people were these who could conjure an army out\r\nof thin air?  He glanced toward Thuvia.  She, too, evidently had\r\nwitnessed the transformation.\r\n\r\nWith a little shudder she pressed more closely toward him.\r\n\r\n\"What do you make of it?\" she whispered.  \"It is most uncanny.\"\r\n\r\n\"I cannot account for it,\" replied Carthoris, \"unless we have gone\r\nmad.\"\r\n\r\nCarthoris turned quickly toward the Lotharian.  The fellow was\r\nsmiling broadly.\r\n\r\n\"I thought that you just said that there were no soldiers in\r\nLothar,\" said the Heliumite, with a gesture toward the guardsmen.\r\n\"What are these?\"\r\n\r\n\"Ask Tario,\" replied the other.  \"We shall soon be before him.\"\r\n\r\nNor was it long before they entered a lofty chamber at one end of\r\nwhich a man reclined upon a rich couch that stood upon a high dais.\r\n\r\nAs the trio approached, the man turned dreamy eyes sleepily upon\r\nthem.  Twenty feet from the dais their conductor halted, and,\r\nwhispering to Thuvia and Carthoris to follow his example, threw\r\nhimself headlong to the floor.  Then rising to hands and knees,\r\nhe commenced crawling toward the foot of the throne, swinging his\r\nhead to and fro and wiggling his body as you have seen a hound do\r\nwhen approaching its master.\r\n\r\nThuvia glanced quickly toward Carthoris.  He was standing erect,\r\nwith high-held head and arms folded across his broad chest.  A\r\nhaughty smile curved his lips.\r\n\r\nThe man upon the dais was eyeing him intently, and Carthoris of\r\nHelium was looking straight in the other's face.\r\n\r\n\"Who be these, Jav?\" asked the man of him who crawled upon his\r\nbelly along the floor.\r\n\r\n\"O Tario, most glorious Jeddak,\" replied Jav, \"these be strangers\r\nwho came with the hordes of Torquas to our gates, saying that they\r\nwere prisoners of the green men.  They tell strange tales of cities\r\nfar beyond Lothar.\"\r\n\r\n\"Arise, Jav,\" commanded Tario, \"and ask these two why they show\r\nnot to Tario the respect that is his due.\"\r\n\r\nJav arose and faced the strangers.  At sight of their erect positions\r\nhis face went livid.  He leaped toward them.\r\n\r\n\"Creatures!\" he screamed.  \"Down!  Down upon your bellies before\r\nthe last of the jeddaks of Barsoom!\"\r\n\r\n\r\n\r\n\r\nCHAPTER VII\r\n\r\nTHE PHANTOM BOWMEN\r\n\r\n\r\nAs Jav leaped toward him Carthoris laid his hand upon the hilt of\r\nhis long-sword.  The Lotharian halted.  The great apartment was\r\nempty save for the four at the dais, yet as Jav stepped back from\r\nthe menace of the Heliumite's threatening attitude the latter found\r\nhimself surrounded by a score of bowmen.\r\n\r\nFrom whence had they sprung?  Both Carthoris and Thuvia looked\r\ntheir astonishment.\r\n\r\nNow the former's sword leaped from its scabbard, and at the same\r\ninstant the bowmen drew back their slim shafts.\r\n\r\nTario had half raised himself upon one elbow.  For the first time\r\nhe saw the full figure of Thuvia, who had been concealed behind\r\nthe person of Carthoris.\r\n\r\n\"Enough!\" cried the jeddak, raising a protesting hand, but at\r\nthat very instant the sword of the Heliumite cut viciously at its\r\nnearest antagonist.\r\n\r\nAs the keen edge reached its goal Carthoris let the point fall to\r\nthe floor, as with wide eyes he stepped backward in consternation,\r\nthrowing the back of his left hand across his brow.  His steel\r\nhad cut but empty air--his antagonist had vanished--there were no\r\nbowmen in the room!\r\n\r\n\"It is evident that these are strangers,\" said Tario to Jav.  \"Let\r\nus first determine that they knowingly affronted us before we take\r\nmeasures for punishment.\"\r\n\r\nThen he turned to Carthoris, but ever his gaze wandered to the\r\nperfect lines of Thuvia's glorious figure, which the harness of a\r\nBarsoomian princess accentuated rather than concealed.\r\n\r\n\"Who are you,\" he asked, \"who knows not the etiquette of the court\r\nof the last of jeddaks?\"\r\n\r\n\"I am Carthoris, Prince of Helium,\" replied the Heliumite.  \"And\r\nthis is Thuvia, Princess of Ptarth.  In the courts of our fathers\r\nmen do not prostrate themselves before royalty.  Not since the First\r\nBorn tore their immortal goddess limb from limb have men crawled\r\nupon their bellies to any throne upon Barsoom.  Now think you that\r\nthe daughter of one mighty jeddak and the son of another would so\r\nhumiliate themselves?\"\r\n\r\nTario looked at Carthoris for a long time.  At last he spoke.\r\n\r\n\"There is no other jeddak upon Barsoom than Tario,\" he said.  \"There\r\nis no other race than that of Lothar, unless the hordes of Torquas\r\nmay be dignified by such an appellation.  Lotharians are white;\r\nyour skins are red.  There are no women left upon Barsoom.  Your\r\ncompanion is a woman.\"\r\n\r\nHe half rose from the couch, leaning far forward and pointing an\r\naccusing finger at Carthoris.\r\n\r\n\"You are a lie!\" he shrieked.  \"You are both lies, and you dare to\r\ncome before Tario, last and mightiest of the jeddaks of Barsoom,\r\nand assert your reality.  Some one shall pay well for this, Jav,\r\nand unless I mistake it is yourself who has dared thus flippantly\r\nto trifle with the good nature of your jeddak.\r\n\r\n\"Remove the man.  Leave the woman.  We shall see if both be lies.\r\nAnd later, Jav, you shall suffer for your temerity.  There be few\r\nof us left, but--Komal must be fed.  Go!\"\r\n\r\nCarthoris could see that Jav trembled as he prostrated himself once\r\nmore before his ruler, and then, rising, turned toward the Prince\r\nof Helium.\r\n\r\n\"Come!\" he said.\r\n\r\n\"And leave the Princess of Ptarth here alone?\" cried Carthoris.\r\n\r\nJav brushed closely past him, whispering:\r\n\r\n\"Follow me--he cannot harm her, except to kill; and that he can do\r\nwhether you remain or not.  We had best go now--trust me.\"\r\n\r\nCarthoris did not understand, but something in the urgency of the\r\nother's tone assured him, and so he turned away, but not without a\r\nglance toward Thuvia in which he attempted to make her understand\r\nthat it was in her own interest that he left her.\r\n\r\nFor answer she turned her back full upon him, but not without first\r\nthrowing him such a look of contempt that brought the scarlet to\r\nhis cheek.\r\n\r\nThen he hesitated, but Jav seized him by the wrist.\r\n\r\n\"Come!\" he whispered.  \"Or he will have the bowmen upon you, and\r\nthis time there will be no escape.  Did you not see how futile is\r\nyour steel against thin air!\"\r\n\r\nCarthoris turned unwillingly to follow.  As the two left the room\r\nhe turned to his companion.\r\n\r\n\"If I may not kill thin air,\" he asked, \"how, then, shall I fear\r\nthat thin air may kill me?\"\r\n\r\n\"You saw the Torquasians fall before the bowmen?\" asked Jav.\r\n\r\nCarthoris nodded.\r\n\r\n\"So would you fall before them, and without one single chance for\r\nself-defence or revenge.\"\r\n\r\nAs they talked Jav led Carthoris to a small room in one of the\r\nnumerous towers of the palace.  Here were couches, and Jav bid the\r\nHeliumite be seated.\r\n\r\nFor several minutes the Lotharian eyed his prisoner, for such\r\nCarthoris now realized himself to be.\r\n\r\n\"I am half convinced that you are real,\" he said at last.\r\n\r\nCarthoris laughed.\r\n\r\n\"Of course I am real,\" he said.  \"What caused you to doubt it?  Can\r\nyou not see me, feel me?\"\r\n\r\n\"So may I see and feel the bowmen,\" replied Jav, \"and yet we all\r\nknow that they, at least, are not real.\"\r\n\r\nCarthoris showed by the expression of his face his puzzlement at\r\neach new reference to the mysterious bowmen--the vanishing soldiery\r\nof Lothar.\r\n\r\n\"What, then, may they be?\" he asked.\r\n\r\n\"You really do not know?\" asked Jav.\r\n\r\nCarthoris shook his head negatively.\r\n\r\n\"I can almost believe that you have told us the truth and that you\r\nare really from another part of Barsoom, or from another world.  But\r\ntell me, in your own country have you no bowmen to strike terror\r\nto the hearts of the green hordesmen as they slay in company with\r\nthe fierce banths of war?\"\r\n\r\n\"We have soldiers,\" replied Carthoris.  \"We of the red race are\r\nall soldiers, but we have no bowmen to defend us, such as yours.\r\nWe defend ourselves.\"\r\n\r\n\"You go out and get killed by your enemies!\" cried Jav incredulously.\r\n\r\n\"Certainly,\" replied Carthoris.  \"How do the Lotharians?\"\r\n\r\n\"You have seen,\" replied the other.  \"We send out our deathless\r\narchers--deathless because they are lifeless, existing only in the\r\nimaginations of our enemies.  It is really our giant minds that\r\ndefend us, sending out legions of imaginary warriors to materialize\r\nbefore the mind's eye of the foe.\r\n\r\n\"They see them--they see their bows drawn back--they see their\r\nslender arrows speed with unerring precision toward their hearts.\r\nAnd they die--killed by the power of suggestion.\"\r\n\r\n\"But the archers that are slain?\" exclaimed Carthoris.  \"You call\r\nthem deathless, and yet I saw their dead bodies piled high upon\r\nthe battlefield.  How may that be?\"\r\n\r\n\"It is but to lend reality to the scene,\" replied Jav.  \"We picture\r\nmany of our own defenders killed that the Torquasians may not guess\r\nthat there are really no flesh and blood creatures opposing them.\r\n\r\n\"Once that truth became implanted in their minds, it is the theory\r\nof many of us, no longer would they fall prey to the suggestion\r\nof the deadly arrows, for greater would be the suggestion of the\r\ntruth, and the more powerful suggestion would prevail--it is law.\"\r\n\r\n\"And the banths?\" questioned Carthoris.  \"They, too, were but\r\ncreatures of suggestion?\"\r\n\r\n\"Some of them were real,\" replied Jav.  \"Those that accompanied\r\nthe archers in pursuit of the Torquasians were unreal.  Like the\r\narchers, they never returned, but, having served their purpose,\r\nvanished with the bowmen when the rout of the enemy was assured.\r\n\r\n\"Those that remained about the field were real.  Those we loosed\r\nas scavengers to devour the bodies of the dead of Torquas.  This\r\nthing is demanded by the realists among us.  I am a realist.  Tario\r\nis an etherealist.\r\n\r\n\"The etherealists maintain that there is no such thing as\r\nmatter--that all is mind.  They say that none of us exists, except\r\nin the imagination of his fellows, other than as an intangible,\r\ninvisible mentality.\r\n\r\n\"According to Tario, it is but necessary that we all unite in\r\nimagining that there are no dead Torquasians beneath our walls,\r\nand there will be none, nor any need of scavenging banths.\"\r\n\r\n\"You, then, do not hold Tario's beliefs?\" asked Carthoris.\r\n\r\n\"In part only,\" replied the Lotharian.  \"I believe, in fact I know,\r\nthat there are some truly ethereal creatures.  Tario is one, I am\r\nconvinced.  He has no existence except in the imaginations of his\r\npeople.\r\n\r\n\"Of course, it is the contention of all us realists that all\r\netherealists are but figments of the imagination.  They contend\r\nthat no food is necessary, nor do they eat; but any one of the most\r\nrudimentary intelligence must realize that food is a necessity to\r\ncreatures having actual existence.\"\r\n\r\n\"Yes,\" agreed Carthoris, \"not having eaten to-day I can readily\r\nagree with you.\"\r\n\r\n\"Ah, pardon me,\" exclaimed Jav.  \"Pray be seated and satisfy your\r\nhunger,\" and with a wave of his hand he indicated a bountifully\r\nladen table that had not been there an instant before he spoke.  Of\r\nthat Carthoris was positive, for he had searched the room diligently\r\nwith his eyes several times.\r\n\r\n\"It is well,\" continued Jav, \"that you did not fall into the hands\r\nof an etherealist.  Then, indeed, would you have gone hungry.\"\r\n\r\n\"But,\" exclaimed Carthoris, \"this is not real food--it was not here\r\nan instant since, and real food does not materialize out of thin\r\nair.\"\r\n\r\nJav looked hurt.\r\n\r\n\"There is no real food or water in Lothar,\" he said; \"nor has there\r\nbeen for countless ages.  Upon such as you now see before you have\r\nwe existed since the dawn of history.  Upon such, then, may you\r\nexist.\"\r\n\r\n\"But I thought you were a realist,\" exclaimed Carthoris.\r\n\r\n\"Indeed,\" cried Jav, \"what more realistic than this bounteous feast?\r\nIt is just here that we differ most from the etherealists.  They\r\nclaim that it is unnecessary to imagine food; but we have found\r\nthat for the maintenance of life we must thrice daily sit down to\r\nhearty meals.\r\n\r\n\"The food that one eats is supposed to undergo certain chemical\r\nchanges during the process of digestion and assimilation, the\r\nresult, of course, being the rebuilding of wasted tissue.\r\n\r\n\"Now we all know that mind is all, though we may differ in the\r\ninterpretation of its various manifestations.  Tario maintains\r\nthat there is no such thing as substance, all being created from\r\nthe substanceless matter of the brain.\r\n\r\n\"We realists, however, know better.  We know that mind has the\r\npower to maintain substance even though it may not be able to create\r\nsubstance--the latter is still an open question.  And so we know\r\nthat in order to maintain our physical bodies we must cause all\r\nour organs properly to function.\r\n\r\n\"This we accomplish by materializing food-thoughts, and by partaking\r\nof the food thus created.  We chew, we swallow, we digest.  All our\r\norgans function precisely as if we had partaken of material food.\r\nAnd what is the result?  What must be the result?  The chemical\r\nchanges take place through both direct and indirect suggestion,\r\nand we live and thrive.\"\r\n\r\nCarthoris eyed the food before him.  It seemed real enough.  He\r\nlifted a morsel to his lips.  There was substance indeed.  And\r\nflavour as well.  Yes, even his palate was deceived.\r\n\r\nJav watched him, smiling, as he ate.\r\n\r\n\"Is it not entirely satisfying?\" he asked.\r\n\r\n\"I must admit that it is,\" replied Carthoris.  \"But tell me, how\r\ndoes Tario live, and the other etherealists who maintain that food\r\nis unnecessary?\"\r\n\r\nJav scratched his head.\r\n\r\n\"That is a question we often discuss,\" he replied.  \"It is the\r\nstrongest evidence we have of the non-existence of the etherealists;\r\nbut who may know other than Komal?\"\r\n\r\n\"Who is Komal?\" asked Carthoris.  \"I heard your jeddak speak of\r\nhim.\"\r\n\r\nJav bent low toward the ear of the Heliumite, looking fearfully\r\nabout before he spoke.\r\n\r\n\"Komal is the essence,\" he whispered.  \"Even the etherealists\r\nadmit that mind itself must have substance in order to transmit to\r\nimaginings the appearance of substance.  For if there really was\r\nno such thing as substance it could not be suggested--what never\r\nhas been cannot be imagined.  Do you follow me?\"\r\n\r\n\"I am groping,\" replied Carthoris dryly.\r\n\r\n\"So the essence must be substance,\" continued Jav.  \"Komal is the\r\nessence of the All, as it were.  He is maintained by substance.\r\nHe eats.  He eats the real.  To be explicit, he eats the realists.\r\nThat is Tario's work.\r\n\r\n\"He says that inasmuch as we maintain that we alone are real we\r\nshould, to be consistent, admit that we alone are proper food for\r\nKomal.  Sometimes, as to-day, we find other food for him.  He is\r\nvery fond of Torquasians.\"\r\n\r\n\"And Komal is a man?\" asked Carthoris.\r\n\r\n\"He is All, I told you,\" replied Jav.  \"I know not how to explain\r\nhim in words that you will understand.  He is the beginning and\r\nthe end.  All life emanates from Komal, since the substance which\r\nfeeds the brain with imaginings radiates from the body of Komal.\r\n\r\n\"Should Komal cease to eat, all life upon Barsoom would cease to be.\r\nHe cannot die, but he might cease to eat, and, thus, to radiate.\"\r\n\r\n\"And he feeds upon the men and women of your belief?\" cried Carthoris.\r\n\r\n\"Women!\" exclaimed Jav.  \"There are no women in Lothar.  The last\r\nof the Lotharian females perished ages since, upon that cruel and\r\nterrible journey across the muddy plains that fringed the half-dried\r\nseas, when the green hordes scourged us across the world to this\r\nour last hiding-place--our impregnable fortress of Lothar.\r\n\r\n\"Scarce twenty thousand men of all the countless millions of our\r\nrace lived to reach Lothar.  Among us were no women and no children.\r\nAll these had perished by the way.\r\n\r\n\"As time went on, we, too, were dying and the race fast approaching\r\nextinction, when the Great Truth was revealed to us, that mind is\r\nall.  Many more died before we perfected our powers, but at last\r\nwe were able to defy death when we fully understood that death was\r\nmerely a state of mind.\r\n\r\n\"Then came the creation of mind-people, or rather the materialization\r\nof imaginings.  We first put these to practical use when the\r\nTorquasians discovered our retreat, and fortunate for us it was\r\nthat it required ages of search upon their part before they found\r\nthe single tiny entrance to the valley of Lothar.\r\n\r\n\"That day we threw our first bowmen against them.  The intention\r\nwas purely to frighten them away by the vast numbers of bowmen which\r\nwe could muster upon our walls.  All Lothar bristled with the bows\r\nand arrows of our ethereal host.\r\n\r\n\"But the Torquasians did not frighten.  They are lower than the\r\nbeasts--they know no fear.  They rushed upon our walls, and standing\r\nupon the shoulders of others they built human approaches to the\r\nwall tops, and were on the very point of surging in upon us and\r\noverwhelming us.\r\n\r\n\"Not an arrow had been discharged by our bowmen--we did but cause\r\nthem to run to and fro along the wall top, screaming taunts and\r\nthreats at the enemy.\r\n\r\n\"Presently I thought to attempt the thing--THE GREAT THING.  I centred\r\nall my mighty intellect upon the bowmen of my own creation--each\r\nof us produces and directs as many bowmen as his mentality and\r\nimagination is capable of.\r\n\r\n\"I caused them to fit arrows to their bows for the first time.  I\r\nmade them take aim at the hearts of the green men.  I made the\r\ngreen men see all this, and then I made them see the arrows fly,\r\nand I made them think that the points pierced their hearts.\r\n\r\n\"It was all that was necessary.  By hundreds they toppled from\r\nour walls, and when my fellows saw what I had done they were quick\r\nto follow my example, so that presently the hordes of Torquas had\r\nretreated beyond the range of our arrows.\r\n\r\n\"We might have killed them at any distance, but one rule of war we\r\nhave maintained from the first--the rule of realism.  We do nothing,\r\nor rather we cause our bowmen to do nothing within sight of the\r\nenemy that is beyond the understanding of the foe.  Otherwise they\r\nmight guess the truth, and that would be the end of us.\r\n\r\n\"But after the Torquasians had retreated beyond bowshot, they turned\r\nupon us with their terrible rifles, and by constant popping at us\r\nmade life miserable within our walls.\r\n\r\n\"So then I bethought the scheme to hurl our bowmen through the\r\ngates upon them.  You have seen this day how well it works.  For\r\nages they have come down upon us at intervals, but always with the\r\nsame results.\"\r\n\r\n\"And all this is due to your intellect, Jav?\" asked Carthoris.  \"I\r\nshould think that you would be high in the councils of your people.\"\r\n\r\n\"I am,\" replied Jav, proudly.  \"I am next to Tario.\"\r\n\r\n\"But why, then, your cringing manner of approaching the throne?\"\r\n\r\n\"Tario demands it.  He is jealous of me.  He only awaits the\r\nslightest excuse to feed me to Komal.  He fears that I may some\r\nday usurp his power.\"\r\n\r\nCarthoris suddenly sprang from the table.\r\n\r\n\"Jav!\" he exclaimed.  \"I am a beast!  Here I have been eating my\r\nfill, while the Princess of Ptarth may perchance be still without\r\nfood.  Let us return and find some means of furnishing her with\r\nnourishment.\"\r\n\r\nThe Lotharian shook his head.\r\n\r\n\"Tario would not permit it,\" he said.  \"He will, doubtless, make\r\nan etherealist of her.\"\r\n\r\n\"But I must go to her,\" insisted Carthoris.  \"You say that there\r\nare no women in Lothar.  Then she must be among men, and if this\r\nbe so I intend to be near where I may defend her if the need arises.\"\r\n\r\n\"Tario will have his way,\" insisted Jav.  \"He sent you away and\r\nyou may not return until he sends for you.\"\r\n\r\n\"Then I shall go without waiting to be sent for.\"\r\n\r\n\"Do not forget the bowmen,\" cautioned Jav.\r\n\r\n\"I do not forget them,\" replied Carthoris, but he did not tell\r\nJav that he remembered something else that the Lotharian had let\r\ndrop--something that was but a conjecture, possibly, and yet one\r\nwell worth pinning a forlorn hope to, should necessity arise.\r\n\r\nCarthoris started to leave the room.  Jav stepped before him,\r\nbarring his way.\r\n\r\n\"I have learned to like you, red man,\" he said; \"but do not forget\r\nthat Tario is still my jeddak, and that Tario has commanded that\r\nyou remain here.\"\r\n\r\nCarthoris was about to reply, when there came faintly to the ears\r\nof both a woman's cry for help.\r\n\r\nWith a sweep of his arm the Prince of Helium brushed the Lotharian\r\naside, and with drawn sword sprang into the corridor without.\r\n\r\n\r\n\r\n\r\nCHAPTER VIII\r\n\r\nTHE HALL OF DOOM\r\n\r\n\r\nAs Thuvia of Ptarth saw Carthoris depart from the presence of Tario,\r\nleaving her alone with the man, a sudden qualm of terror seized\r\nher.\r\n\r\nThere was an air of mystery pervading the stately chamber.  Its\r\nfurnishings and appointments bespoke wealth and culture, and\r\ncarried the suggestion that the room was often the scene of royal\r\nfunctions which filled it to its capacity.\r\n\r\nAnd yet nowhere about her, in antechamber or corridor, was there\r\nsign of any other being than herself and the recumbent figure of\r\nTario, the jeddak, who watched her through half-closed eyes from\r\nthe gorgeous trappings of his regal couch.\r\n\r\nFor a time after the departure of Jav and Carthoris the man eyed\r\nher intently.  Then he spoke.\r\n\r\n\"Come nearer,\" he said, and, as she approached: \"Whose creature\r\nare you?  Who has dared materialize his imaginings of woman?  It is\r\ncontrary to the customs and the royal edicts of Lothar.  Tell me,\r\nwoman, from whose brain have you sprung?  Jav's?  No, do not deny\r\nit.  I know that it could be no other than that envious realist.  He\r\nseeks to tempt me.  He would see me fall beneath the spell of your\r\ncharms, and then he, your master, would direct my destiny and--my\r\nend.  I see it all!  I see it all!\"\r\n\r\nThe blood of indignation and anger had been rising to Thuvia's\r\nface.  Her chin was up, a haughty curve upon her perfect lips.\r\n\r\n\"I know naught,\" she cried, \"of what you are prating!  I am Thuvia,\r\nPrincess of Ptarth.  I am no man's 'creature.'  Never before to-day\r\ndid I lay eyes upon him you call Jav, nor upon your ridiculous city,\r\nof which even the greatest nations of Barsoom have never dreamed.\r\n\r\n\"My charms are not for you, nor such as you.  They are not for\r\nsale or barter, even though the price were a real throne.  And as\r\nfor using them to win your worse than futile power--\"  She ended\r\nher sentence with a shrug of her shapely shoulders, and a little\r\nscornful laugh.\r\n\r\nWhen she had finished Tario was sitting upon the edge of his\r\ncouch, his feet upon the floor.  He was leaning forward with eyes\r\nno longer half closed, but wide with a startled expression in them.\r\n\r\nHe did not seem to note the LESE MAJESTE of her words and manner.\r\nThere was evidently something more startling and compelling about\r\nher speech than that.\r\n\r\nSlowly he came to his feet.\r\n\r\n\"By the fangs of Komal!\" he muttered.  \"But you are REAL!  A REAL\r\nwoman!  No dream!  No vain and foolish figment of the mind!\"\r\n\r\nHe took a step toward her, with hands outstretched.\r\n\r\n\"Come!\" he whispered.  \"Come, woman!  For countless ages have I\r\ndreamed that some day you would come.  And now that you are here\r\nI can scarce believe the testimony of my eyes.  Even now, knowing\r\nthat you are real, I still half dread that you may be a lie.\"\r\n\r\nThuvia shrank back.  She thought the man mad.  Her hand stole to\r\nthe jewelled hilt of her dagger.  The man saw the move, and stopped.\r\nA cunning expression entered his eyes.  Then they became at once\r\ndreamy and penetrating as they fairly bored into the girl's brain.\r\n\r\nThuvia suddenly felt a change coming over her.  What the cause of\r\nit she did not guess; but somehow the man before her began to assume\r\na new relationship within her heart.\r\n\r\nNo longer was he a strange and mysterious enemy, but an old and\r\ntrusted friend.  Her hand slipped from the dagger's hilt.  Tario\r\ncame closer.  He spoke gentle, friendly words, and she answered\r\nhim in a voice that seemed hers and yet another's.\r\n\r\nHe was beside her now.  His hand was up her shoulder.  His eyes\r\nwere down-bent toward hers.  She looked up into his face.  His\r\ngaze seemed to bore straight through her to some hidden spring of\r\nsentiment within her.\r\n\r\nHer lips parted in sudden awe and wonder at the strange revealment\r\nof her inner self that was being laid bare before her consciousness.\r\nShe had known Tario for ever.  He was more than friend to her.\r\nShe moved a little closer to him.  In one swift flood of light she\r\nknew the truth.  She loved Tario, Jeddak of Lothar!  She had always\r\nloved him.\r\n\r\nThe man, seeing the success of his strategy, could not restrain a\r\nfaint smile of satisfaction.  Whether there was something in the\r\nexpression of his face, or whether from Carthoris of Helium in a\r\nfar chamber of the palace came a more powerful suggestion, who may\r\nsay?  But something there was that suddenly dispelled the strange,\r\nhypnotic influence of the man.\r\n\r\nAs though a mask had been torn from her eyes, Thuvia suddenly saw\r\nTario as she had formerly seen him, and, accustomed as she was to\r\nthe strange manifestations of highly developed mentality which are\r\ncommon upon Barsoom, she quickly guessed enough of the truth to\r\nknow that she was in grave danger.\r\n\r\nQuickly she took a step backward, tearing herself from his grasp.\r\nBut the momentary contact had aroused within Tario all the long-buried\r\npassions of his loveless existence.\r\n\r\nWith a muffled cry he sprang upon her, throwing his arms about her\r\nand attempting to drag her lips to his.\r\n\r\n\"Woman!\" he cried.  \"Lovely woman!  Tario would make you queen of\r\nLothar.  Listen to me!  Listen to the love of the last of the\r\njeddaks of Barsoom.\"\r\n\r\nThuvia struggled to free herself from his embrace.\r\n\r\n\"Stop, creature!\" she cried.  \"Stop!  I do not love you.  Stop, or\r\nI shall scream for help!\"\r\n\r\nTario laughed in her face.\r\n\r\n\"'Scream for help,'\" he mimicked.  \"And who within the halls of\r\nLothar is there who might come in answer to your call?  Who would\r\ndare enter the presence of Tario, unsummoned?\"\r\n\r\n\"There is one,\" she replied, \"who would come, and, coming, dare\r\nto cut you down upon your own throne, if he thought that you had\r\noffered affront to Thuvia of Ptarth!\"\r\n\r\n\"Who, Jav?\" asked Tario.\r\n\r\n\"Not Jav, nor any other soft-skinned Lotharian,\" she replied; \"but\r\na real man, a real warrior--Carthoris of Helium!\"\r\n\r\nAgain the man laughed at her.\r\n\r\n\"You forget the bowmen,\" he reminded her.  \"What could your red\r\nwarrior accomplish against my fearless legions?\"\r\n\r\nAgain he caught her roughly to him, dragging her towards his couch.\r\n\r\n\"If you will not be my queen,\" he said, \"you shall be my slave.\"\r\n\r\n\"Neither!\" cried the girl.\r\n\r\nAs she spoke the single word there was a quick move of her right\r\nhand; Tario, releasing her, staggered back, both hands pressed to\r\nhis side.  At the same instant the room filled with bowmen, and\r\nthen the jeddak of Lothar sank senseless to the marble floor.\r\n\r\nAt the instant that he lost consciousness the bowmen were about to\r\nrelease their arrows into Thuvia's heart.  Involuntarily she gave\r\na single cry for help, though she knew that not even Carthoris of\r\nHelium could save her now.\r\n\r\nThen she closed her eyes and waited for the end.  No slender shafts\r\npierced her tender side.  She raised her lids to see what stayed\r\nthe hand of her executioners.\r\n\r\nThe room was empty save for herself and the still form of the jeddak\r\nof Lothar lying at her feet, a little pool of crimson staining the\r\nwhite marble of the floor beside him.  Tario was unconscious.\r\n\r\nThuvia was amazed.  Where were the bowmen?  Why had they not loosed\r\ntheir shafts?  What could it all mean?\r\n\r\nAn instant before the room had been mysteriously filled with\r\narmed men, evidently called to protect their jeddak; yet now, with\r\nthe evidence of her deed plain before them, they had vanished as\r\nmysteriously as they had come, leaving her alone with the body of\r\ntheir ruler, into whose side she had slipped her long, keen blade.\r\n\r\nThe girl glanced apprehensively about, first for signs of the return\r\nof the bowmen, and then for some means of escape.\r\n\r\nThe wall behind the dais was pierced by two small doorways, hidden\r\nby heavy hangings.  Thuvia was running quickly towards one of\r\nthese when she heard the clank of a warrior's metal at the end of\r\nthe apartment behind her.\r\n\r\nAh, if she had but an instant more of time she could have reached\r\nthat screening arras and, perchance, have found some avenue of\r\nescape behind it; but now it was too late--she had been discovered!\r\n\r\nWith a feeling that was akin to apathy she turned to meet her fate,\r\nand there, before her, running swiftly across the broad chamber to\r\nher side, was Carthoris, his naked long-sword gleaming in his hand.\r\n\r\nFor days she had doubted the intentions of the Heliumite.  She\r\nhad thought him a party to her abduction.  Since Fate had thrown\r\nthem together she had scarce favoured him with more than the most\r\nperfunctory replies to his remarks, unless at such times as the\r\nweird and uncanny happenings at Lothar had surprised her out of\r\nher reserve.\r\n\r\nShe knew that Carthoris of Helium would fight for her; but whether\r\nto save her for himself or another, she was in doubt.\r\n\r\nHe knew that she was promised to Kulan Tith, Jeddak of Kaol, but\r\nif he had been instrumental in her abduction, his motives could\r\nnot be prompted by loyalty to his friend, or regard for her honour.\r\n\r\nAnd yet, as she saw him coming across the marble floor of the audience\r\nchamber of Tario of Lothar, his fine eyes filled with apprehension\r\nfor her safety, his splendid figure personifying all that is finest\r\nin the fighting men of martial Mars, she could not believe that\r\nany faintest trace of perfidy lurked beneath so glorious an exterior.\r\n\r\nNever, she thought, in all her life had the sight of any man been\r\nso welcome to her.  It was with difficulty that she refrained from\r\nrushing forward to meet him.\r\n\r\nShe knew that he loved her; but, in time, she recalled that she was\r\npromised to Kulan Tith.  Not even might she trust herself to show\r\ntoo great gratitude to the Heliumite, lest he misunderstand.\r\n\r\nCarthoris was by her side now.  His quick glance had taken in the\r\nscene within the room--the still figure of the jeddak sprawled upon\r\nthe floor--the girl hastening toward a shrouded exit.\r\n\r\n\"Did he harm you, Thuvia?\" he asked.\r\n\r\nShe held up her crimsoned blade that he might see it.\r\n\r\n\"No,\" she said, \"he did not harm me.\"\r\n\r\nA grim smile lighted Carthoris' face.\r\n\r\n\"Praised be our first ancestor!\" he murmured.  \"And now let us see\r\nif we may not make good our escape from this accursed city before\r\nthe Lotharians discover that their jeddak is no more.\"\r\n\r\nWith the firm authority that sat so well upon him in whose veins\r\nflowed the blood of John Carter of Virginia and Dejah Thoris\r\nof Helium, he grasped her hand and, turning back across the hall,\r\nstrode toward the great doorway through which Jav had brought them\r\ninto the presence of the jeddak earlier in the day.\r\n\r\nThey had almost reached the threshold when a figure sprang into the\r\napartment through another entrance.  It was Jav.  He, too, took in\r\nthe scene within at a glance.\r\n\r\nCarthoris turned to face him, his sword ready in his hand, and his\r\ngreat body shielding the slender figure of the girl.\r\n\r\n\"Come, Jav of Lothar!\" he cried.  \"Let us face the issue at once,\r\nfor only one of us may leave this chamber alive with Thuvia of\r\nPtarth.\"  Then, seeing that the man wore no sword, he exclaimed:\r\n\"Bring on your bowmen, then, or come with us as my prisoner until\r\nwe have safely passed the outer portals of thy ghostly city.\"\r\n\r\n\"You have killed Tario!\" exclaimed Jav, ignoring the other's\r\nchallenge.  \"You have killed Tario!  I see his blood upon the\r\nfloor--real blood--real death.  Tario was, after all, as real as I.\r\nYet he was an etherealist.  He would not materialize his sustenance.\r\nCan it be that they are right?  Well, we, too, are right.  And all\r\nthese ages we have been quarrelling--each saying that the other\r\nwas wrong!\r\n\r\n\"However, he is dead now.  Of that I am glad.  Now shall Jav come\r\ninto his own.  Now shall Jav be Jeddak of Lothar!\"\r\n\r\nAs he finished, Tario opened his eyes and then quickly sat up.\r\n\r\n\"Traitor!  Assassin!\" he screamed, and then:  \"Kadar!  Kadar!\"\r\nwhich is the Barsoomian for guard.\r\n\r\nJav went sickly white.  He fell upon his belly, wriggling toward\r\nTario.\r\n\r\n\"Oh, my Jeddak, my Jeddak!\" he whimpered.  \"Jav had no hand in\r\nthis.  Jav, your faithful Jav, but just this instant entered the\r\napartment to find you lying prone upon the floor and these two\r\nstrangers about to leave. How it happened I know not.  Believe me,\r\nmost glorious Jeddak!\"\r\n\r\n\"Cease, knave!\" cried Tario.  \"I heard your words: 'However, he\r\nis dead now.  Of that I am glad.  Now shall Jav come into his own.\r\nNow shall Jav be Jeddak of Lothar.'\r\n\r\n\"At last, traitor, I have found you out.  Your own words have\r\ncondemned you as surely as the acts of these red creatures have\r\nsealed their fates--unless--\" He paused.  \"Unless the woman--\"\r\n\r\nBut he got no further.  Carthoris guessed what he would have said,\r\nand before the words could be uttered he had sprung forward and\r\nstruck the man across the mouth with his open palm.\r\n\r\nTario frothed in rage and mortification.\r\n\r\n\"And should you again affront the Princess of Ptarth,\" warned the\r\nHeliumite, \"I shall forget that you wear no sword--not for ever\r\nmay I control my itching sword hand.\"\r\n\r\nTario shrank back toward the little doorways behind the dais.  He\r\nwas trying to speak, but so hideously were the muscles of his face\r\nworking that he could utter no word for several minutes.  At last\r\nhe managed to articulate intelligibly.\r\n\r\n\"Die!\" he shrieked.  \"Die!\" and then he turned toward the exit at\r\nhis back.\r\n\r\nJav leaped forward, screaming in terror.\r\n\r\n\"Have pity, Tario!  Have pity!  Remember the long ages that I have\r\nserved you faithfully.  Remember all that I have done for Lothar.\r\nDo not condemn me now to the death hideous.  Save me!  Save me!\"\r\n\r\nBut Tario only laughed a mocking laugh and continued to back toward\r\nthe hangings that hid the little doorway.\r\n\r\nJav turned toward Carthoris.\r\n\r\n\"Stop him!\" he screamed.  \"Stop him!  If you love life, let him\r\nnot leave this room,\" and as he spoke he leaped in pursuit of his\r\njeddak.\r\n\r\nCarthoris followed Jav's example, but the \"last of the jeddaks\r\nof Barsoom\" was too quick for them.  By the time they reached the\r\narras behind which he had disappeared, they found a heavy stone\r\ndoor blocking their further progress.\r\n\r\nJav sank to the floor in a spasm of terror.\r\n\r\n\"Come, man!\" cried Carthoris.  \"We are not dead yet.  Let us\r\nhasten to the avenues and make an attempt to leave the city.  We\r\nare still alive, and while we live we may yet endeavour to direct\r\nour own destinies.  Of what avail, to sink spineless to the floor?\r\nCome, be a man!\"\r\n\r\nJav but shook his head.\r\n\r\n\"Did you not hear him call the guards?\" he moaned.  \"Ah, if we\r\ncould have but intercepted him!  Then there might have been hope;\r\nbut, alas, he was too quick for us.\"\r\n\r\n\"Well, well,\" exclaimed Carthoris impatiently.  \"What if he did\r\ncall the guards?  There will be time enough to worry about that\r\nafter they come--at present I see no indication that they have any\r\nidea of over-exerting themselves to obey their jeddak's summons.\"\r\n\r\nJav shook his head mournfully.\r\n\r\n\"You do not understand,\" he said.  \"The guards have already\r\ncome--and gone.  They have done their work and we are lost.  Look\r\nto the various exits.\"\r\n\r\nCarthoris and Thuvia turned their eyes in the direction of the\r\nseveral doorways which pierced the walls of the great chamber.\r\nEach was tightly closed by huge stone doors.\r\n\r\n\"Well?\" asked Carthoris.\r\n\r\n\"We are to die the death,\" whispered Jav faintly.\r\n\r\nFurther than that he would not say.  He just sat upon the edge of\r\nthe jeddak's couch and waited.\r\n\r\nCarthoris moved to Thuvia's side, and, standing there with naked\r\nsword, he let his brave eyes roam ceaselessly about the great\r\nchamber, that no foe might spring upon them unseen.\r\n\r\nFor what seemed hours no sound broke the silence of their living\r\ntomb.  No sign gave their executioners of the time or manner of\r\ntheir death.  The suspense was terrible.  Even Carthoris of Helium\r\nbegan to feel the terrible strain upon his nerves.  If he could\r\nbut know how and whence the hand of death was to strike, he could\r\nmeet it unafraid, but to suffer longer the hideous tension of this\r\nblighting ignorance of the plans of their assassins was telling\r\nupon him grievously.\r\n\r\nThuvia of Ptarth drew quite close to him.  She felt safer with the\r\nfeel of his arm against hers, and with the contact of her the man\r\ntook a new grip upon himself.  With his old-time smile he turned\r\ntoward her.\r\n\r\n\"It would seem that they are trying to frighten us to death,\" he\r\nsaid, laughing; \"and, shame be upon me that I should confess it,\r\nI think they were close to accomplishing their designs upon me.\"\r\n\r\nShe was about to make some reply when a fearful shriek broke from\r\nthe lips of the Lotharian.\r\n\r\n\"The end is coming!\" he cried.  \"The end is coming!  The floor!\r\nThe floor!  Oh, Komal, be merciful!\"\r\n\r\nThuvia and Carthoris did not need to look at the floor to be aware\r\nof the strange movement that was taking place.\r\n\r\nSlowly the marble flagging was sinking in all directions toward\r\nthe centre.  At first the movement, being gradual, was scarce\r\nnoticeable; but presently the angle of the floor became such that\r\none might stand easily only by bending one knee considerably.\r\n\r\nJav was shrieking still, and clawing at the royal couch that had\r\nalready commenced to slide toward the centre of the room, where both\r\nThuvia and Carthoris suddenly noted a small orifice which grew in\r\ndiameter as the floor assumed more closely a funnel-like contour.\r\n\r\nNow it became more and more difficult to cling to the dizzy\r\ninclination of the smooth and polished marble.\r\n\r\nCarthoris tried to support Thuvia, but himself commenced to slide\r\nand slip toward the ever-enlarging aperture.\r\n\r\nBetter to cling to the smooth stone he kicked off his sandals\r\nof zitidar hide and with his bare feet braced himself against the\r\nsickening tilt, at the same time throwing his arms supportingly\r\nabout the girl.\r\n\r\nIn her terror her own hands clasped about the man's neck.  Her\r\ncheek was close to his.  Death, unseen and of unknown form, seemed\r\nclose upon them, and because unseen and unknowable infinitely more\r\nterrifying.\r\n\r\n\"Courage, my princess,\" he whispered.\r\n\r\nShe looked up into his face to see smiling lips above hers and\r\nbrave eyes, untouched by terror, drinking deeply of her own.\r\n\r\nThen the floor sagged and tilted more swiftly.  There was a sudden\r\nslipping rush as they were precipitated toward the aperture.\r\n\r\nJav's screams rose weird and horrible in their ears, and then the\r\nthree found themselves piled upon the royal couch of Tario, which\r\nhad stuck within the aperture at the base of the marble funnel.\r\n\r\nFor a moment they breathed more freely, but presently they discovered\r\nthat the aperture was continuing to enlarge.  The couch slipped\r\ndownward.  Jav shrieked again.  There was a sickening sensation as\r\nthey felt all let go beneath them, as they fell through darkness\r\nto an unknown death.\r\n\r\n\r\n\r\n\r\nCHAPTER IX\r\n\r\nTHE BATTLE IN THE PLAIN\r\n\r\n\r\nThe distance from the bottom of the funnel to the floor of the\r\nchamber beneath it could not have been great, for all three of the\r\nvictims of Tario's wrath alighted unscathed.\r\n\r\nCarthoris, still clasping Thuvia tightly to his breast, came to\r\nthe ground catlike, upon his feet, breaking the shock for the girl.\r\nScarce had his feet touched the rough stone flagging of this new\r\nchamber than his sword flashed out ready for instant use.  But\r\nthough the room was lighted, there was no sign of enemy about.\r\n\r\nCarthoris looked toward Jav.  The man was pasty white with fear.\r\n\r\n\"What is to be our fate?\" asked the Heliumite.  \"Tell me, man!\r\nShake off your terror long enough to tell me, so I may be prepared\r\nto sell my life and that of the Princess of Ptarth as dearly as\r\npossible.\"\r\n\r\n\"Komal!\" whispered Jav.  \"We are to be devoured by Komal!\"\r\n\r\n\"Your deity?\" asked Carthoris.\r\n\r\nThe Lotharian nodded his head.  Then he pointed toward a low doorway\r\nat one end of the chamber.\r\n\r\n\"From thence will he come upon us.  Lay aside your puny sword, fool.\r\nIt will but enrage him the more and make our sufferings the worse.\"\r\n\r\nCarthoris smiled, gripping his long-sword the more firmly.\r\n\r\nPresently Jav gave a horrified moan, at the same time pointing\r\ntoward the door.\r\n\r\n\"He has come,\" he whimpered.\r\n\r\nCarthoris and Thuvia looked in the direction the Lotharian had\r\nindicated, expecting to see some strange and fearful creature in\r\nhuman form; but to their astonishment they saw the broad head and\r\ngreat-maned shoulders of a huge banth, the largest that either ever\r\nhad seen.\r\n\r\nSlowly and with dignity the mighty beast advanced into the room.\r\nJav had fallen to the floor, and was wriggling his body in the same\r\nservile manner that he had adopted toward Tario.  He spoke to the\r\nfierce beast as he would have spoken to a human being, pleading\r\nwith it for mercy.\r\n\r\nCarthoris stepped between Thuvia and the banth, his sword ready to\r\ncontest the beast's victory over them.  Thuvia turned toward Jav.\r\n\r\n\"Is this Komal, your god?\" she asked.\r\n\r\nJav nodded affirmatively.  The girl smiled, and then, brushing past\r\nCarthoris, she stepped swiftly toward the growling carnivore.\r\n\r\nIn low, firm tones she spoke to it as she had spoken to the banths\r\nof the Golden Cliffs and the scavengers before the walls of Lothar.\r\n\r\nThe beast ceased its growling.  With lowered head and catlike purr,\r\nit came slinking to the girl's feet.  Thuvia turned toward Carthoris.\r\n\r\n\"It is but a banth,\" she said.  \"We have nothing to fear from it.\"\r\n\r\nCarthoris smiled.\r\n\r\n\"I did not fear it,\" he replied, \"for I, too, believed it to be\r\nonly a banth, and I have my long-sword.\"\r\n\r\nJav sat up and gazed at the spectacle before him--the slender girl\r\nweaving her fingers in the tawny mane of the huge creature that he\r\nhad thought divine, while Komal rubbed his hideous snout against\r\nher side.\r\n\r\n\"So this is your god!\" laughed Thuvia.\r\n\r\nJav looked bewildered.  He scarce knew whether he dare chance\r\noffending Komal or not, for so strong is the power of superstition\r\nthat even though we know that we have been reverencing a sham, yet\r\nstill we hesitate to admit the validity of our new-found convictions.\r\n\r\n\"Yes,\" he said, \"this is Komal.  For ages the enemies of Tario have\r\nbeen hurled to this pit to fill his maw, for Komal must be fed.\"\r\n\r\n\"Is there any way out of this chamber to the avenues of the city?\"\r\nasked Carthoris.\r\n\r\nJav shrugged.\r\n\r\n\"I do not know,\" he replied.  \"Never have I been here before, nor\r\never have I cared to do so.\"\r\n\r\n\"Come,\" suggested Thuvia, \"let us explore.  There must be a way\r\nout.\"\r\n\r\nTogether the three approached the doorway through which Komal had\r\nentered the apartment that was to have witnessed their deaths.\r\nBeyond was a low-roofed lair, with a small door at the far end.\r\n\r\nThis, to their delight, opened to the lifting of an ordinary latch,\r\nletting them into a circular arena, surrounded by tiers of seats.\r\n\r\n\"Here is where Komal is fed in public,\" explained Jav.  \"Had Tario\r\ndared it would have been here that our fates had been sealed; but\r\nhe feared too much thy keen blade, red man, and so he hurled us\r\nall downward to the pit.  I did not know how closely connected were\r\nthe two chambers.  Now we may easily reach the avenues and the city\r\ngates.  Only the bowmen may dispute the right of way, and, knowing\r\ntheir secret, I doubt that they have power to harm us.\"\r\n\r\nAnother door led to a flight of steps that rose from the arena\r\nlevel upward through the seats to an exit at the back of the hall.\r\nBeyond this was a straight, broad corridor, running directly through\r\nthe palace to the gardens at the side.\r\n\r\nNo one appeared to question them as they advanced, mighty Komal\r\npacing by the girl's side.\r\n\r\n\"Where are the people of the palace--the jeddak's retinue?\" asked\r\nCarthoris.  \"Even in the city streets as we came through I scarce\r\nsaw sign of a human being, yet all about are evidences of a mighty\r\npopulation.\"\r\n\r\nJav sighed.\r\n\r\n\"Poor Lothar,\" he said.  \"It is indeed a city of ghosts.  There are\r\nscarce a thousand of us left, who once were numbered in the millions.\r\nOur great city is peopled by the creatures of our own imaginings.\r\nFor our own needs we do not take the trouble to materialize these\r\npeoples of our brain, yet they are apparent to us.\r\n\r\n\"Even now I see great throngs lining the avenue, hastening to and\r\nfro in the round of their duties.  I see women and children laughing\r\non the balconies--these we are forbidden to materialize; but yet\r\nI see them--they are here. . . .  But why not?\" he mused.  \"No\r\nlonger need I fear Tario--he has done his worst, and failed.  Why\r\nnot indeed?\r\n\r\n\"Stay, friends,\" he continued.  \"Would you see Lothar in all her\r\nglory?\"\r\n\r\nCarthoris and Thuvia nodded their assent, more out of courtesy than\r\nbecause they fully grasped the import of his mutterings.\r\n\r\nJav gazed at them penetratingly for an instant, then, with a wave\r\nof his hand, cried:  \"Look!\"\r\n\r\nThe sight that met them was awe-inspiring.  Where before there\r\nhad been naught but deserted pavements and scarlet swards, yawning\r\nwindows and tenantless doors, now swarmed a countless multitude of\r\nhappy, laughing people.\r\n\r\n\"It is the past,\" said Jav in a low voice.  \"They do not see us--they\r\nbut live the old dead past of ancient Lothar--the dead and crumbled\r\nLothar of antiquity, which stood upon the shore of Throxus, mightiest\r\nof the five oceans.\r\n\r\n\"See those fine, upstanding men swinging along the broad avenue?\r\nSee the young girls and the women smile upon them?  See the men\r\ngreet them with love and respect?  Those be seafarers coming up\r\nfrom their ships which lie at the quays at the city's edge.\r\n\r\n\"Brave men, they--ah, but the glory of Lothar has faded!  See their\r\nweapons.  They alone bore arms, for they crossed the five seas to\r\nstrange places where dangers were.  With their passing passed the\r\nmartial spirit of the Lotharians, leaving, as the ages rolled by,\r\na race of spineless cowards.\r\n\r\n\"We hated war, and so we trained not our youth in warlike ways.\r\nThus followed our undoing, for when the seas dried and the green\r\nhordes encroached upon us we could do naught but flee.  But we\r\nremembered the seafaring bowmen of the days of our glory--it is\r\nthe memory of these which we hurl upon our enemies.\"\r\n\r\nAs Jav ceased speaking, the picture faded, and once more, the three\r\ntook up their way toward the distant gates, along deserted avenues.\r\n\r\nTwice they sighted Lotharians of flesh and blood.  At sight of\r\nthem and the huge banth which they must have recognized as Komal,\r\nthe citizens turned and fled.\r\n\r\n\"They will carry word of our flight to Tario,\" cried Jav, \"and soon\r\nhe will send his bowmen after us.  Let us hope that our theory is\r\ncorrect, and that their shafts are powerless against minds cognizant\r\nof their unreality.  Otherwise we are doomed.\r\n\r\n\"Explain, red man, to the woman the truths that I have explained to\r\nyou, that she may meet the arrows with a stronger counter-suggestion\r\nof immunity.\"\r\n\r\nCarthoris did as Jav bid him; but they came to the great gates\r\nwithout sign of pursuit developing.  Here Jav set in motion the\r\nmechanism that rolled the huge, wheel-like gate aside, and a moment\r\nlater the three, accompanied by the banth, stepped out into the\r\nplain before Lothar.\r\n\r\nScarce had they covered a hundred yards when the sound of many men\r\nshouting arose behind them.  As they turned they saw a company of\r\nbowmen debouching upon the plain from the gate through which they\r\nhad but just passed.\r\n\r\nUpon the wall above the gate were a number of Lotharians, among whom\r\nJav recognized Tario.  The jeddak stood glaring at them, evidently\r\nconcentrating all the forces of his trained mind upon them.  That\r\nhe was making a supreme effort to render his imaginary creatures\r\ndeadly was apparent.\r\n\r\nJav turned white, and commenced to tremble.  At the crucial moment\r\nhe appeared to lose the courage of his conviction.  The great banth\r\nturned back toward the advancing bowmen and growled.  Carthoris\r\nplaced himself between Thuvia and the enemy and, facing them,\r\nawaited the outcome of their charge.\r\n\r\nSuddenly an inspiration came to Carthoris.\r\n\r\n\"Hurl your own bowmen against Tario's!\" he cried to Jav.  \"Let us\r\nsee a materialized battle between two mentalities.\"\r\n\r\nThe suggestion seemed to hearten the Lotharian, and in another\r\nmoment the three stood behind solid ranks of huge bowmen who hurled\r\ntaunts and menaces at the advancing company emerging from the walled\r\ncity.\r\n\r\nJav was a new man the moment his battalions stood between him and\r\nTario.  One could almost have sworn the man believed these creatures\r\nof his strange hypnotic power to be real flesh and blood.\r\n\r\nWith hoarse battle cries they charged the bowmen of Tario.  Barbed\r\nshafts flew thick and fast.  Men fell, and the ground was red with\r\ngore.\r\n\r\nCarthoris and Thuvia had difficulty in reconciling the reality of\r\nit all with their knowledge of the truth.  They saw utan after utan\r\nmarch from the gate in perfect step to reinforce the outnumbered\r\ncompany which Tario had first sent forth to arrest them.\r\n\r\nThey saw Jav's forces grow correspondingly until all about them\r\nrolled a sea of fighting, cursing warriors, and the dead lay in\r\nheaps about the field.\r\n\r\nJav and Tario seemed to have forgotten all else beside the struggling\r\nbowmen that surged to and fro, filling the broad field between the\r\nforest and the city.\r\n\r\nThe wood loomed close behind Thuvia and Carthoris.  The latter cast\r\na glance toward Jav.\r\n\r\n\"Come!\" he whispered to the girl.  \"Let them fight out their empty\r\nbattle--neither, evidently, has power to harm the other.  They are\r\nlike two controversialists hurling words at one another.  While they\r\nare engaged we may as well be devoting our energies to an attempt\r\nto find the passage through the cliffs to the plain beyond.\"\r\n\r\nAs he spoke, Jav, turning from the battle for an instant, caught\r\nhis words.  He saw the girl move to accompany the Heliumite.  A\r\ncunning look leaped to the Lotharian's eyes.\r\n\r\nThe thing that lay beyond that look had been deep in his heart\r\nsince first he had laid eyes upon Thuvia of Ptarth.  He had not\r\nrecognized it, however, until now that she seemed about to pass\r\nout of his existence.\r\n\r\nHe centred his mind upon the Heliumite and the girl for an instant.\r\n\r\nCarthoris saw Thuvia of Ptarth step forward with outstretched\r\nhand.  He was surprised at this sudden softening toward him, and\r\nit was with a full heart that he let his fingers close upon hers,\r\nas together they turned away from forgotten Lothar, into the woods,\r\nand bent their steps toward the distant mountains.\r\n\r\nAs the Lotharian had turned toward them, Thuvia had been surprised\r\nto hear Carthoris suddenly voice a new plan.\r\n\r\n\"Remain here with Jav,\" she had heard him say, \"while I go to search\r\nfor the passage through the cliffs.\"\r\n\r\nShe had dropped back in surprise and disappointment, for she knew\r\nthat there was no reason why she should not have accompanied him.\r\nCertainly she should have been safer with him than left here alone\r\nwith the Lotharian.\r\n\r\nAnd Jav watched the two and smiled his cunning smile.\r\n\r\nWhen Carthoris had disappeared within the wood, Thuvia seated\r\nherself apathetically upon the scarlet sward to watch the seemingly\r\ninterminable struggles of the bowmen.\r\n\r\nThe long afternoon dragged its weary way toward darkness, and still\r\nthe imaginary legions charged and retreated.  The sun was about to\r\nset when Tario commenced to withdraw his troops slowly toward the\r\ncity.\r\n\r\nHis plan for cessation of hostilities through the night evidently\r\nmet with Jav's entire approval, for he caused his forces to form\r\nthemselves in orderly utans and march just within the edge of\r\nthe wood, where they were soon busily engaged in preparing their\r\nevening meal, and spreading down their sleeping silks and furs for\r\nthe night.\r\n\r\nThuvia could scarce repress a smile as she noted the scrupulous\r\ncare with which Jav's imaginary men attended to each tiny detail\r\nof deportment as truly as if they had been real flesh and blood.\r\n\r\nSentries were posted between the camp and the city.  Officers\r\nclanked hither and thither issuing commands and seeing to it that\r\nthey were properly carried out.\r\n\r\nThuvia turned toward Jav.\r\n\r\n\"Why is it,\" she asked, \"that you observe such careful nicety in\r\nthe regulation of your creatures when Tario knows quite as well as\r\nyou that they are but figments of your brain?  Why not permit them\r\nsimply to dissolve into thin air until you again require their\r\nfutile service?\"\r\n\r\n\"You do not understand them,\" replied Jav.  \"While they exist they\r\nare real.  I do but call them into being now, and in a way direct\r\ntheir general actions.  But thereafter, until I dissolve them, they\r\nare as actual as you or I.  Their officers command them, under my\r\nguidance.  I am the general--that is all.  And the psychological\r\neffect upon the enemy is far greater than were I to treat them\r\nmerely as substanceless vagaries.\r\n\r\n\"Then, too,\" continued the Lotharian, \"there is always the hope,\r\nwhich with us is little short of belief, that some day these\r\nmaterializations will merge into the real--that they will remain,\r\nsome of them, after we have dissolved their fellows, and that thus\r\nwe shall have discovered a means for perpetuating our dying race.\r\n\r\n\"Some there are who claim already to have accomplished the thing.\r\nIt is generally supposed that the etherealists have quite a few\r\namong their number who are permanent materializations.  It is even\r\nsaid that such is Tario, but that cannot be, for he existed before\r\nwe had discovered the full possibilities of suggestion.\r\n\r\n\"There are others among us who insist that none of us is real.  That\r\nwe could not have existed all these ages without material food and\r\nwater had we ourselves been material.  Although I am a realist, I\r\nrather incline toward this belief myself.\r\n\r\n\"It seems well and sensibly based upon the belief that our ancient\r\nforbears developed before their extinction such wondrous mentalities\r\nthat some of the stronger minds among them lived after the death\r\nof their bodies--that we are but the deathless minds of individuals\r\nlong dead.\r\n\r\n\"It would appear possible, and yet in so far as I am concerned I\r\nhave all the attributes of corporeal existence.  I eat, I sleep\"--he\r\npaused, casting a meaning look upon the girl--\"I love!\"\r\n\r\nThuvia could not mistake the palpable meaning of his words and\r\nexpression.  She turned away with a little shrug of disgust that\r\nwas not lost upon the Lotharian.\r\n\r\nHe came close to her and seized her arm.\r\n\r\n\"Why not Jav?\" he cried.  \"Who more honourable than the second of\r\nthe world's most ancient race?  Your Heliumite?  He has gone.  He\r\nhas deserted you to your fate to save himself.  Come, be Jav's!\"\r\n\r\nThuvia of Ptarth rose to her full height, her lifted shoulder turned\r\ntoward the man, her haughty chin upraised, a scornful twist to her\r\nlips.\r\n\r\n\"You lie!\" she said quietly, \"the Heliumite knows less of disloyalty\r\nthan he knows of fear, and of fear he is as ignorant as the unhatched\r\nyoung.\"\r\n\r\n\"Then where is he?\" taunted the Lotharian.  \"I tell you he has fled\r\nthe valley.  He has left you to your fate.  But Jav will see that\r\nit is a pleasant one.  To-morrow we shall return into Lothar at the\r\nhead of my victorious army, and I shall be jeddak and you shall be\r\nmy consort.  Come!\" And he attempted to crush her to his breast.\r\n\r\nThe girl struggled to free herself, striking at the man with her\r\nmetal armlets.  Yet still he drew her toward him, until both were\r\nsuddenly startled by a hideous growl that rumbled from the dark\r\nwood close behind them.\r\n\r\n\r\n\r\n\r\nCHAPTER X\r\n\r\nKAR KOMAK, THE BOWMAN\r\n\r\n\r\nAs Carthoris moved through the forest toward the distant cliffs\r\nwith Thuvia's hand still tight pressed in his, he wondered a little\r\nat the girl's continued silence, yet the contact of her cool palm\r\nagainst his was so pleasant that he feared to break the spell of\r\nher new-found reliance in him by speaking.\r\n\r\nOnward through the dim wood they passed until the shadows of the\r\nquick coming Martian night commenced to close down upon them.  Then\r\nit was that Carthoris turned to speak to the girl at his side.\r\n\r\nThey must plan together for the future.  It was his idea to pass\r\nthrough the cliffs at once if they could locate the passage, and\r\nhe was quite positive that they were now close to it; but he wanted\r\nher assent to the proposition.\r\n\r\nAs his eyes rested upon her, he was struck by her strangely ethereal\r\nappearance.  She seemed suddenly to have dissolved into the tenuous\r\nsubstance of a dream, and as he continued to gaze upon her, she\r\nfaded slowly from his sight.\r\n\r\nFor an instant he was dumbfounded, and then the whole truth flashed\r\nsuddenly upon him.  Jav had caused him to believe that Thuvia was\r\naccompanying him through the wood while, as a matter of fact, he\r\nhad detained the girl for himself!\r\n\r\nCarthoris was horrified.  He cursed himself for his stupidity, and\r\nyet he knew that the fiendish power which the Lotharian had invoked\r\nto confuse him might have deceived any.\r\n\r\nScarce had he realized the truth than he had started to retrace\r\nhis steps toward Lothar, but now he moved at a trot, the Earthly\r\nthews that he had inherited from his father carrying him swiftly\r\nover the soft carpet of fallen leaves and rank grass.\r\n\r\nThuria's brilliant light flooded the plain before the walled city\r\nof Lothar as Carthoris broke from the wood opposite the great gate\r\nthat had given the fugitives egress from the city earlier in the\r\nday.\r\n\r\nAt first he saw no indication that there was another than himself\r\nanywhere about.  The plain was deserted.  No myriad bowmen camped\r\nnow beneath the overhanging verdure of the giant trees.  No gory\r\nheaps of tortured dead defaced the beauty of the scarlet sward.\r\nAll was silence. All was peace.\r\n\r\nThe Heliumite, scarce pausing at the forest's verge, pushed\r\non across the plain toward the city, when presently he descried a\r\nhuddled form in the grass at his feet.\r\n\r\nIt was the body of a man, lying prone.  Carthoris turned the figure\r\nover upon its back.  It was Jav, but torn and mangled almost beyond\r\nrecognition.\r\n\r\nThe prince bent low to note if any spark of life remained, and as\r\nhe did so the lids raised and dull, suffering eyes looked up into\r\nhis.\r\n\r\n\"The Princess of Ptarth!\" cried Carthoris.  \"Where is she?  Answer\r\nme, man, or I complete the work that another has so well begun.\"\r\n\r\n\"Komal,\" muttered Jav.  \"He sprang upon me . . . and would have\r\ndevoured me but for the girl.  Then they went away together into\r\nthe wood--the girl and the great banth . . . her fingers twined in\r\nhis tawny mane.\"\r\n\r\n\"Which way went they?\" asked Carthoris.\r\n\r\n\"There,\" replied Jav faintly, \"toward the passage through the\r\ncliffs.\"\r\n\r\nThe Prince of Helium waited to hear no more, but springing to his\r\nfeet, raced back again into the forest.\r\n\r\nIt was dawn when he reached the mouth of the dark tunnel that would\r\nlead him to the other world beyond this valley of ghostly memories\r\nand strange hypnotic influences and menaces.\r\n\r\nWithin the long, dark passages he met with no accident or obstacle,\r\ncoming at last into the light of day beyond the mountains, and\r\nno great distance from the southern verge of the domains of the\r\nTorquasians, not more than one hundred and fifty haad at the most.\r\n\r\nFrom the boundary of Torquas to the city of Aaanthor is a distance\r\nof some two hundred haads, so that the Heliumite had before him a\r\njourney of more than one hundred and fifty Earth miles between him\r\nand Aaanthor.\r\n\r\nHe could at best but hazard a chance guess that toward Aaanthor\r\nThuvia would take her flight.  There lay the nearest water, and\r\nthere might be expected some day a rescuing party from her father's\r\nempire; for Carthoris knew Thuvan Dihn well enough to know that he\r\nwould leave no stone unturned until he had tracked down the truth\r\nas to his daughter's abduction, and learned all that there might\r\nbe to learn of her whereabouts.\r\n\r\nHe realized, of course, that the trick which had laid suspicion\r\nupon him would greatly delay the discovery of the truth, but little\r\ndid he guess to what vast proportions had the results of the villainy\r\nof Astok of Dusar already grown.\r\n\r\nEven as he emerged from the mouth of the passage to look across\r\nthe foothills in the direction of Aaanthor, a Ptarth battle fleet\r\nwas winging its majestic way slowly toward the twin cities of\r\nHelium, while from far distant Kaol raced another mighty armada to\r\njoin forces with its ally.\r\n\r\nHe did not know that in the face of the circumstantial evidence\r\nagainst him even his own people had commenced to entertain suspicions\r\nthat he might have stolen the Ptarthian princess.\r\n\r\nHe did not know of the lengths to which the Dusarians had gone to\r\ndisrupt the friendship and alliance which existed between the three\r\ngreat powers of the eastern hemisphere--Helium, Ptarth and Kaol.\r\n\r\nHow Dusarian emissaries had found employment in important posts in\r\nthe foreign offices of the three great nations, and how, through these\r\nmen, messages from one jeddak to another were altered and garbled\r\nuntil the patience and pride of the three rulers and former friends\r\ncould no longer endure the humiliations and insults contained in\r\nthese falsified papers--not any of this he knew.\r\n\r\nNor did he know how even to the last John Carter, Warlord of Mars,\r\nhad refused to permit the jeddak of Helium to declare war against\r\neither Ptarth or Kaol, because of his implicit belief in his son,\r\nand that eventually all would be satisfactorily explained.\r\n\r\nAnd now two great fleets were moving upon Helium, while the Dusarian\r\nspies at the court of Tardos Mors saw to it that the twin cities\r\nremained in ignorance of their danger.\r\n\r\nWar had been declared by Thuvan Dihn, but the messenger who had\r\nbeen dispatched with the proclamation had been a Dusarian who had\r\nseen to it that no word of warning reached the twin cities of the\r\napproach of a hostile fleet.\r\n\r\nFor several days diplomatic relations had been severed between\r\nHelium and her two most powerful neighbors, and with the departure\r\nof the ministers had come a total cessation of wireless communication\r\nbetween the disputants, as is usual upon Barsoom.\r\n\r\nBut of all this Carthoris was ignorant.  All that interested him\r\nat present was the finding of Thuvia of Ptarth.  Her trail beside\r\nthat of the huge banth had been well marked to the tunnel, and was\r\nonce more visible leading southward into the foothills.\r\n\r\nAs he followed rapidly downward toward the dead sea-bottom, where\r\nhe knew he must lose the spoor in the resilient ochre vegetation,\r\nhe was suddenly surprised to see a naked man approaching him from\r\nthe north-east.\r\n\r\nAs the fellow drew closer, Carthoris halted to await his coming.\r\nHe knew that the man was unarmed, and that he was apparently a\r\nLotharian, for his skin was white and his hair auburn.\r\n\r\nHe approached the Heliumite without sign of fear, and when quite\r\nclose called out the cheery Barsoomian \"kaor\" of greeting.\r\n\r\n\"Who are you?\" asked Carthoris.\r\n\r\n\"I am Kar Komak, odwar of the bowmen,\" replied the other.  \"A\r\nstrange thing has happened to me.  For ages Tario has been bringing\r\nme into existence as he needed the services of the army of his\r\nmind.  Of all the bowmen it has been Kar Komak who has been oftenest\r\nmaterialized.\r\n\r\n\"For a long time Tario has been concentrating his mind upon my\r\npermanent materialization.  It has been an obsession with him that\r\nsome day this thing could be accomplished and the future of Lothar\r\nassured.  He asserted that matter was nonexistent except in the\r\nimagination of man--that all was mental, and so he believed that\r\nby persisting in his suggestion he could eventually make of me a\r\npermanent suggestion in the minds of all creatures.\r\n\r\n\"Yesterday he succeeded, but at such a time!  It must have come all\r\nunknown to him, as it came to me without my knowledge, as, with my\r\nhorde of yelling bowmen, I pursued the fleeing Torquasians back to\r\ntheir ochre plains.\r\n\r\n\"As darkness settled and the time came for us to fade once more\r\ninto thin air, I suddenly found myself alone upon the edge of the\r\ngreat plain which lies yonder at the foot of the low hills.\r\n\r\n\"My men were gone back to the nothingness from which they had\r\nsprung, but I remained--naked and unarmed.\r\n\r\n\"At first I could not understand, but at last came a realization of\r\nwhat had occurred.  Tario's long suggestions had at last prevailed,\r\nand Kar Komak had become a reality in the world of men; but my\r\nharness and my weapons had faded away with my fellows, leaving me\r\nnaked and unarmed in a hostile country far from Lothar.\"\r\n\r\n\"You wish to return to Lothar?\" asked Carthoris.\r\n\r\n\"No!\" replied Kar Komak quickly.  \"I have no love for Tario.  Being\r\na creature of his mind, I know him too well.  He is cruel and\r\ntyrannical--a master I have no desire to serve.  Now that he has\r\nsucceeded in accomplishing my permanent materialization, he will\r\nbe unbearable, and he will go on until he has filled Lothar with\r\nhis creatures.  I wonder if he has succeeded as well with the maid\r\nof Lothar.\"\r\n\r\n\"I thought there were no women there,\" said Carthoris.\r\n\r\n\"In a hidden apartment in the palace of Tario,\" replied Kar Komak,\r\n\"the jeddak has maintained the suggestion of a beautiful girl, hoping\r\nthat some day she would become permanent.  I have seen her there.\r\nShe is wonderful!  But for her sake I hope that Tario succeeds not\r\nso well with her as he has with me.\r\n\r\n\"Now, red man, I have told you of myself--what of you?\"\r\n\r\nCarthoris liked the face and manner of the bowman.  There had been\r\nno sign of doubt or fear in his expression as he had approached\r\nthe heavily-armed Heliumite, and he had spoken directly and to the\r\npoint.\r\n\r\nSo the Prince of Helium told the bowman of Lothar who he was and\r\nwhat adventure had brought him to this far country.\r\n\r\n\"Good!\" exclaimed the other, when he had done.  \"Kar Komak will\r\naccompany you.  Together we shall find the Princess of Ptarth and\r\nwith you Kar Komak will return to the world of men--such a world\r\nas he knew in the long-gone past when the ships of mighty Lothar\r\nploughed angry Throxus, and the roaring surf beat against the\r\nbarrier of these parched and dreary hills.\"\r\n\r\n\"What mean you?\" asked Carthoris.  \"Had you really a former actual\r\nexistence?\"\r\n\r\n\"Most assuredly,\" replied Kar Komak.  \"In my day I commanded the\r\nfleets of Lothar--mightiest of all the fleets that sailed the five\r\nsalt seas.\r\n\r\n\"Wherever men lived upon Barsoom there was the name of Kar Komak\r\nknown and respected.  Peaceful were the land races in those distant\r\ndays--only the seafarers were warriors; but now has the glory of\r\nthe past faded, nor did I think until I met you that there remained\r\nupon Barsoom a single person of our own mould who lived and loved\r\nand fought as did the ancient seafarers of my time.\r\n\r\n\"Ah, but it will seem good to see men once again--real men!  Never\r\nhad I much respect for the landsmen of my day.  They remained in\r\ntheir walled cities wasting their time in play, depending for their\r\nprotection entirely upon the sea race.  And the poor creatures who\r\nremain, the Tarios and Javs of Lothar, are even worse than their\r\nancient forbears.\"\r\n\r\nCarthoris was a trifle skeptical as to the wisdom of permitting\r\nthe stranger to attach himself to him.  There was always the chance\r\nthat he was but the essence of some hypnotic treachery which Tario\r\nor Jav was attempting to exert upon the Heliumite; and yet, so\r\nsincere had been the manner and the words of the bowman, so much\r\nthe fighting man did he seem, but Carthoris could not find it in\r\nhis heart to doubt him.\r\n\r\nThe outcome of the matter was that he gave the naked odwar leave to\r\naccompany him, and together they set out upon the spoor of Thuvia\r\nand Komal.\r\n\r\nDown to the ochre sea-bottom the trail led.  There it disappeared,\r\nas Carthoris had known that it would; but where it entered the plain\r\nits direction had been toward Aaanthor and so toward Aaanthor the\r\ntwo turned their faces.\r\n\r\nIt was a long and tedious journey, fraught with many dangers.  The\r\nbowman could not travel at the pace set by Carthoris, whose muscles\r\ncarried him with great rapidity over the face of the small planet,\r\nthe force of gravity of which exerts so much less retarding power\r\nthan that of the Earth.  Fifty miles a day is a fair average for\r\na Barsoomian, but the son of John Carter might easily have covered\r\na hundred or more miles had he cared to desert his new-found comrade.\r\n\r\nAll the way they were in constant danger of discovery by roving\r\nbands of Torquasians, and especially was this true before they\r\nreached the boundary of Torquas.\r\n\r\nGood fortune was with them, however, and although they sighted two\r\ndetachments of the savage green men, they were not themselves seen.\r\n\r\nAnd so they came, upon the morning of the third day, within sight\r\nof the glistening domes of distant Aaanthor.  Throughout the journey\r\nCarthoris had ever strained his eyes ahead in search of Thuvia and\r\nthe great banth; but not till now had he seen aught to give him\r\nhope.\r\n\r\nThis morning, far ahead, half-way between themselves and Aaanthor,\r\nthe men saw two tiny figures moving toward the city.  For a moment\r\nthey watched them intently.  Then Carthoris, convinced, leaped\r\nforward at a rapid run, Kar Komak following as swiftly as he could.\r\n\r\nThe Heliumite shouted to attract the girl's attention, and presently\r\nhe was rewarded by seeing her turn and stand looking toward him.\r\nAt her side the great banth stood with up-pricked ears, watching\r\nthe approaching man.\r\n\r\nNot yet could Thuvia of Ptarth have recognized Carthoris, though\r\nthat it was he she must have been convinced, for she waited there\r\nfor him without sign of fear.\r\n\r\nPresently he saw her point toward the northwest, beyond him.\r\nWithout slackening his pace, he turned his eyes in the direction\r\nshe indicated.\r\n\r\nRacing silently over the thick vegetation, not half a mile behind,\r\ncame a score of fierce green warriors, charging him upon their\r\nmighty thoats.\r\n\r\nTo their right was Kar Komak, naked and unarmed, yet running\r\nvaliantly toward Carthoris and shouting warning as though he, too,\r\nhad but just discovered the silent, menacing company that moved so\r\nswiftly forward with couched spears and ready long-swords.\r\n\r\nCarthoris shouted to the Lotharian, warning him back, for he knew\r\nthat he could but uselessly sacrifice his life by placing himself,\r\nall unarmed, in the path of the cruel and relentless savages.\r\n\r\nBut Kar Komak never hesitated.  With shouts of encouragement to\r\nhis new friend, he hurried onward toward the Prince of Helium.  The\r\nred man's heart leaped in response to this exhibition of courage\r\nand self-sacrifice.  He regretted now that he had not thought to\r\ngive Kar Komak one of his swords; but it was too late to attempt\r\nit, for should he wait for the Lotharian to overtake him or return\r\nto meet him, the Torquasians would reach Thuvia of Ptarth before\r\nhe could do so.\r\n\r\nEven as it was, it would be nip and tuck as to who came first to\r\nher side.\r\n\r\nAgain he turned his face in her direction, and now, from Aaanthor\r\nway, he saw a new force hastening toward them--two medium-sized\r\nwar craft--and even at the distance they still were from him he\r\ndiscerned the device of Dusar upon their bows.\r\n\r\nNow, indeed, seemed little hope for Thuvia of Ptarth.  With\r\nsavage warriors of the hordes of Torquas charging toward her from\r\none direction, and no less implacable enemies, in the form of the\r\ncreatures of Astok, Prince of Dusar, bearing down upon her from\r\nanother, while only a banth, a red warrior, and an unarmed bowman\r\nwere near to defend her, her plight was quite hopeless and her\r\ncause already lost ere ever it was contested.\r\n\r\nAs Thuvia saw Carthoris approaching, she felt again that unaccountable\r\nsensation of entire relief from responsibility and fear that she\r\nhad experienced upon a former occasion.  Nor could she account for\r\nit while her mind still tried to convince her heart that the Prince\r\nof Helium had been instrumental in her abduction from her father's\r\ncourt.  She only knew that she was glad when he was by her side,\r\nand that with him there all things seemed possible--even such\r\nimpossible things as escape from her present predicament.\r\n\r\nNow had he stopped, panting, before her.  A brave smile of\r\nencouragement lit his face.\r\n\r\n\"Courage, my princess,\" he whispered.\r\n\r\nTo the girl's memory flashed the occasion upon which he had used\r\nthose same words--in the throne-room of Tario of Lothar as they had\r\ncommenced to slip down the sinking marble floor toward an unknown\r\nfate.\r\n\r\nThen she had not chidden him for the use of that familiar salutation,\r\nnor did she chide him now, though she was promised to another.\r\nShe wondered at herself--flushing at her own turpitude; for upon\r\nBarsoom it is a shameful thing for a woman to listen to those two\r\nwords from another than her husband or her betrothed.\r\n\r\nCarthoris saw her flush of mortification, and in an instant regretted\r\nhis words.  There was but a moment before the green warriors would\r\nbe upon them.\r\n\r\n\"Forgive me!\" said the man in a low voice.  \"Let my great love be\r\nmy excuse--that, and the belief that I have but a moment more of\r\nlife,\" and with the words he turned to meet the foremost of the\r\ngreen warriors.\r\n\r\nThe fellow was charging with couched spear, but Carthoris leaped to\r\none side, and as the great thoat and its rider hurtled harmlessly\r\npast him he swung his long-sword in a mighty cut that clove the\r\ngreen carcass in twain.\r\n\r\nAt the same moment Kar Komak leaped with bare hands clawing at the\r\nleg of another of the huge riders; the balance of the horde raced\r\nin to close quarters, dismounting the better to wield their favourite\r\nlong-swords; the Dusarian fliers touched the soft carpet of the\r\nochre-clad sea-bottom, disgorging fifty fighting men from their\r\nbowels; and into the swirling sea of cutting, slashing swords sprang\r\nKomal, the great banth.\r\n\r\n\r\n\r\n\r\nCHAPTER XI\r\n\r\nGREEN MEN AND WHITE APES\r\n\r\n\r\nA Torquasian sword smote a glancing blow across the forehead of\r\nCarthoris.  He had a fleeting vision of soft arms about his neck,\r\nand warm lips close to his before he lost consciousness.\r\n\r\nHow long he lay there senseless he could not guess; but when he\r\nopened his eyes again he was alone, except for the bodies of the\r\ndead green men and Dusarians, and the carcass of a great banth that\r\nlay half across his own.\r\n\r\nThuvia was gone, nor was the body of Kar Komak among the dead.\r\n\r\nWeak from loss of blood, Carthoris made his way slowly toward\r\nAaanthor, reaching its outskirts at dark.\r\n\r\nHe wanted water more than any other thing, and so he kept on up\r\na broad avenue toward the great central plaza, where he knew the\r\nprecious fluid was to be found in a half-ruined building opposite\r\nthe great palace of the ancient jeddak, who once had ruled this\r\nmighty city.\r\n\r\nDisheartened and discouraged by the strange sequence of events\r\nthat seemed fore-ordained to thwart his every attempt to serve\r\nthe Princess of Ptarth, he paid little or no attention to his\r\nsurroundings, moving through the deserted city as though no great\r\nwhite apes lurked in the black shadows of the mystery-haunted piles\r\nthat flanked the broad avenues and the great plaza.\r\n\r\nBut if Carthoris was careless of his surroundings, not so other\r\neyes that watched his entrance into the plaza, and followed his slow\r\nfootsteps toward the marble pile that housed the tiny, half-choked\r\nspring whose water one might gain only by scratching a deep hole\r\nin the red sand that covered it.\r\n\r\nAnd as the Heliumite entered the small building a dozen mighty,\r\ngrotesque figures emerged from the doorway of the palace to speed\r\nnoiselessly across the plaza toward him.\r\n\r\nFor half an hour Carthoris remained in the building, digging for\r\nwater and gaining the few much-needed drops which were the fruits\r\nof his labour.  Then he rose and slowly left the structure.  Scarce\r\nhad he stepped beyond the threshold than twelve Torquasian warriors\r\nleaped upon him.\r\n\r\nNo time then to draw long-sword; but swift from his harness flew\r\nhis long, slim dagger, and as he went down beneath them more than\r\na single green heart ceased beating at the bite of that keen point.\r\n\r\nThen they overpowered him and took his weapons away; but only nine\r\nof the twelve warriors who had crossed the plaza returned with\r\ntheir prize.\r\n\r\nThey dragged their prisoner roughly to the palace pits, where\r\nin utter darkness they chained him with rusty links to the solid\r\nmasonry of the wall.\r\n\r\n\"To-morrow Thar Ban will speak with you,\" they said.  \"Now\r\nhe sleeps.  But great will be his pleasure when he learns who has\r\nwandered amongst us--and great will be the pleasure of Hortan Gur\r\nwhen Thar Ban drags before him the mad fool who dared prick the\r\ngreat jeddak with his sword.\"\r\n\r\nThen they left him to the silence and the darkness.\r\n\r\nFor what seemed hours Carthoris squatted upon the stone floor of\r\nhis prison, his back against the wall in which was sunk the heavy\r\neye-bolt that secured the chain which held him.\r\n\r\nThen, from out of the mysterious blackness before him, there\r\ncame to his ears the sound of naked feet moving stealthily upon\r\nstone--approaching nearer and nearer to where he lay, unarmed and\r\ndefenceless.\r\n\r\nMinutes passed--minutes that seemed hours--during which time\r\nperiods of sepulchral silence would be followed by a repetition of\r\nthe uncanny scraping of naked feet slinking warily upon him.\r\n\r\nAt last he heard a sudden rush of unshod soles across the empty\r\nblackness, and at a little distance a scuffling sound, heavy\r\nbreathing, and once what he thought the muttered imprecation of\r\na man battling against great odds.  Then the clanging of a chain,\r\nand a noise as of the snapping back against stone of a broken link.\r\n\r\nAgain came silence.  But for a moment only.  Now he heard once\r\nmore the soft feet approaching him.  He thought that he discerned\r\nwicked eyes gleaming fearfully at him through the darkness.  He\r\nknew that he could hear the heavy breathing of powerful lungs.\r\n\r\nThen came the rush of many feet toward him, and the THINGS were\r\nupon him.\r\n\r\nHands terminating in manlike fingers clutched at his throat and\r\narms and legs.  Hairy bodies strained and struggled against his\r\nown smooth hide as he battled in grim silence against these horrid\r\nfoemen in the darkness of the pits of ancient Aaanthor.\r\n\r\nThewed like some giant god was Carthoris of Helium, yet in the\r\nclutches of these unseen creatures of the pit's Stygian night he\r\nwas helpless as a frail woman.\r\n\r\nYet he battled on, striking futile blows against great, hispid\r\nbreasts he could not see; feeling thick, squat throats beneath his\r\nfingers; the drool of saliva upon his cheek, and hot, foul breath\r\nin his nostrils.\r\n\r\nFangs, too, mighty fangs, he knew were close, and why they did not\r\nsink into his flesh he could not guess.\r\n\r\nAt last he became aware of the mighty surging of a number of his\r\nantagonists back and forth upon the great chain that held him, and\r\npresently came the same sound that he had heard at a little distance\r\nfrom him a short time before he had been attacked--his chain had\r\nparted and the broken end snapped back against the stone wall.\r\n\r\nNow he was seized upon either side and dragged at a rapid pace through\r\nthe dark corridors--toward what fate he could not even guess.\r\n\r\nAt first he had thought his foes might be of the tribe of Torquas,\r\nbut their hairy bodies belied that belief.  Now he was at last\r\nquite sure of their identity, though why they had not killed and\r\ndevoured him at once he could not imagine.\r\n\r\nAfter half an hour or more of rapid racing through the underground\r\npassages that are a distinguishing feature of all Barsoomian cities,\r\nmodern as well as ancient, his captors suddenly emerged into the\r\nmoonlight of a courtyard, far from the central plaza.\r\n\r\nImmediately Carthoris saw that he was in the power of a tribe of\r\nthe great white apes of Barsoom.  All that had caused him doubt\r\nbefore as to the identity of his attackers was the hairiness of\r\ntheir breasts, for the white apes are entirely hairless except for\r\na great shock bristling from their heads.\r\n\r\nNow he saw the cause of that which had deceived him--across the\r\nchest of each of them were strips of hairy hide, usually of banth,\r\nin imitation of the harness of the green warriors who so often\r\ncamped at their deserted city.\r\n\r\nCarthoris had read of the existence of tribes of apes that seemed\r\nto be progressing slowly toward higher standards of intelligence.\r\nInto the hands of such, he realized, he had fallen; but--what were\r\ntheir intentions toward him?\r\n\r\nAs he glanced about the courtyard, he saw fully fifty of the hideous\r\nbeasts, squatting on their haunches, and at a little distance from\r\nhim another human being, closely guarded.\r\n\r\nAs his eyes met those of his fellow-captive a smile lit the other's\r\nface, and:  \"Kaor, red man!\" burst from his lips.  It was Kar Komak,\r\nthe bowman.\r\n\r\n\"Kaor!\" cried Carthoris, in response.  \"How came you here, and what\r\nbefell the princess?\"\r\n\r\n\"Red men like yourself descended in mighty ships that sailed the\r\nair, even as the great ships of my distant day sailed the five seas,\"\r\nreplied Kar Komak.  \"They fought with the green men of Torquas.\r\nThey slew Komal, god of Lothar.  I thought they were your friends,\r\nand I was glad when finally those of them who survived the battle\r\ncarried the red girl to one of the ships and sailed away with her\r\ninto the safety of the high air.\r\n\r\n\"Then the green men seized me, and carried me to a great, empty\r\ncity, where they chained me to a wall in a black pit.  Afterward\r\ncame these and dragged me hither.  And what of you, red man?\"\r\n\r\nCarthoris related all that had befallen him, and as the two men\r\ntalked the great apes squatted about them watching them intently.\r\n\r\n\"What are we to do now?\" asked the bowman.\r\n\r\n\"Our case looks rather hopeless,\" replied Carthoris ruefully.\r\n\"These creatures are born man-eaters.  Why they have not already\r\ndevoured us I cannot imagine--there!\" he whispered.  \"See?  The\r\nend is coming.\"\r\n\r\nKar Komak looked in the direction Carthoris indicated to see a huge\r\nape advancing with a mighty bludgeon.\r\n\r\n\"It is thus they like best to kill their prey,\" said Carthoris.\r\n\r\n\"Must we die without a struggle?\" asked Kar Komak.\r\n\r\n\"Not I,\" replied Carthoris, \"though I know how futile our best\r\ndefence must be against these mighty brutes!  Oh, for a long-sword!\"\r\n\r\n\"Or a good bow,\" added Kar Komak, \"and a utan of bowmen.\"\r\n\r\nAt the words Carthoris half sprang to his feet, only to be dragged\r\nroughly down by his guard.\r\n\r\n\"Kar Komak!\" he cried.  \"Why cannot you do what Tario and Jav did?\r\nThey had no bowmen other than those of their own creation.  You\r\nmust know the secret of their power.  Call forth your own utan,\r\nKar Komak!\"\r\n\r\nThe Lotharian looked at Carthoris in wide-eyed astonishment as the\r\nfull purport of the suggestion bore in upon his understanding.\r\n\r\n\"Why not?\" he murmured.\r\n\r\nThe savage ape bearing the mighty bludgeon was slinking toward\r\nCarthoris.  The Heliumite's fingers were working as he kept his\r\neyes upon his executioner.  Kar Komak bent his gaze penetratingly\r\nupon the apes.  The effort of his mind was evidenced in the sweat\r\nupon his contracted brows.\r\n\r\nThe creature that was to slay the red man was almost within arm's\r\nreach of his prey when Carthoris heard a hoarse shout from the opposite\r\nside of the courtyard.  In common with the squatting apes and the\r\ndemon with the club he turned in the direction of the sound, to see\r\na company of sturdy bowmen rushing from the doorway of a near-by\r\nbuilding.\r\n\r\nWith screams of rage the apes leaped to their feet to meet the\r\ncharge.  A volley of arrows met them half-way, sending a dozen\r\nrolling lifeless to the ground.  Then the apes closed with their\r\nadversaries.  All their attention was occupied by the attackers--even\r\nthe guard had deserted the prisoners to join in the battle.\r\n\r\n\"Come!\" whispered Kar Komak.  \"Now may we escape while their\r\nattention is diverted from us by my bowmen.\"\r\n\r\n\"And leave those brave fellows leaderless?\" cried Carthoris, whose\r\nloyal nature revolted at the merest suggestion of such a thing.\r\n\r\nKar Komak laughed.\r\n\r\n\"You forget,\" he said, \"that they are but thin air--figments of my\r\nbrain.  They will vanish, unscathed, when we have no further need\r\nfor them.  Praised be your first ancestor, redman, that you thought\r\nof this chance in time!  It would never have occurred to me to imagine\r\nthat I might wield the same power that brought me into existence.\"\r\n\r\n\"You are right,\" said Carthoris.  \"Still, I hate to leave them,\r\nthough there is naught else to do,\" and so the two turned from\r\nthe courtyard, and making their way into one of the broad avenues,\r\ncrept stealthily in the shadows of the building toward the great\r\ncentral plaza upon which were the buildings occupied by the green\r\nwarriors when they visited the deserted city.\r\n\r\nWhen they had come to the plaza's edge Carthoris halted.\r\n\r\n\"Wait here,\" he whispered.  \"I go to fetch thoats, since on foot\r\nwe may never hope to escape the clutches of these green fiends.\"\r\n\r\nTo reach the courtyard where the thoats were kept it was necessary\r\nfor Carthoris to pass through one of the buildings which surrounded\r\nthe square.  Which were occupied and which not he could not even\r\nguess, so he was compelled to take considerable chances to gain\r\nthe enclosure in which he could hear the restless beasts squealing\r\nand quarrelling among themselves.\r\n\r\nChance carried him through a dark doorway into a large chamber in\r\nwhich lay a score or more green warriors wrapped in their sleeping\r\nsilks and furs.  Scarce had Carthoris passed through the short\r\nhallway that connected the door of the building and the great room\r\nbeyond it than he became aware of the presence of something or some\r\none in the hallway through which he had but just passed.\r\n\r\nHe heard a man yawn, and then, behind him, he saw the figure of a\r\nsentry rise from where the fellow had been dozing, and stretching\r\nhimself resume his wakeful watchfulness.\r\n\r\nCarthoris realized that he must have passed within a foot of the\r\nwarrior, doubtless rousing him from his slumber.  To retreat now\r\nwould be impossible.  Yet to cross through that roomful of sleeping\r\nwarriors seemed almost equally beyond the pale of possibility.\r\n\r\nCarthoris shrugged his broad shoulders and chose the lesser evil.\r\nWarily he entered the room.  At his right, against the wall,\r\nleaned several swords and rifles and spears--extra weapons which\r\nthe warriors had stacked here ready to their hands should there\r\nbe a night alarm calling them suddenly from slumber.  Beside each\r\nsleeper lay his weapon--these were never far from their owners from\r\nchildhood to death.\r\n\r\nThe sight of the swords made the young man's palm itch.  He stepped\r\nquickly to them, selecting two short-swords--one for Kar Komak,\r\nthe other for himself; also some trappings for his naked comrade.\r\n\r\nThen he started directly across the centre of the apartment among\r\nthe sleeping Torquasians.\r\n\r\nNot a man of them moved until Carthoris had completed more than half\r\nof the short though dangerous journey.  Then a fellow directly in\r\nhis path turned restlessly upon his sleeping silks and furs.\r\n\r\nThe Heliumite paused above him, one of the short-swords in readiness\r\nshould the warrior awaken.  For what seemed an eternity to the young\r\nprince the green man continued to move uneasily upon his couch,\r\nthen, as though actuated by springs, he leaped to his feet and\r\nfaced the red man.\r\n\r\nInstantly Carthoris struck, but not before a savage grunt escaped\r\nthe other's lips.  In an instant the room was in turmoil.  Warriors\r\nleaped to their feet, grasping their weapons as they rose, and\r\nshouting to one another for an explanation of the disturbance.\r\n\r\nTo Carthoris all within the room was plainly visible in the dim\r\nlight reflected from without, for the further moon stood directly\r\nat zenith; but to the eyes of the newly-awakened green men objects\r\nas yet had not taken on familiar forms--they but saw vaguely the\r\nfigures of warriors moving about their apartment.\r\n\r\nNow one stumbled against the corpse of him whom Carthoris had\r\nslain.  The fellow stooped and his hand came in contact with the\r\ncleft skull.  He saw about him the giant figures of other green\r\nmen, and so he jumped to the only conclusion that was open to him.\r\n\r\n\"The Thurds!\" he cried.  \"The Thurds are upon us!  Rise, warriors\r\nof Torquas, and drive home your swords within the hearts of Torquas'\r\nancient enemies!\"\r\n\r\nInstantly the green men began to fall upon one another with naked\r\nswords.  Their savage lust of battle was aroused.  To fight, to\r\nkill, to die with cold steel buried in their vitals!  Ah, that to\r\nthem was Nirvana.\r\n\r\nCarthoris was quick to guess their error and take advantage of it.\r\nHe knew that in the pleasure of killing they might fight on long\r\nafter they had discovered their mistake, unless their attention\r\nwas distracted by sight of the real cause of the altercation, and\r\nso he lost no time in continuing across the room to the doorway\r\nupon the opposite side, which opened into the inner court, where\r\nthe savage thoats were squealing and fighting among themselves.\r\n\r\nOnce here he had no easy task before him.  To catch and mount one\r\nof these habitually rageful and intractable beasts was no child's\r\nplay under the best of conditions; but now, when silence and time\r\nwere such important considerations, it might well have seemed quite\r\nhopeless to a less resourceful and optimistic man than the son of\r\nthe great warlord.\r\n\r\nFrom his father he had learned much concerning the traits of these\r\nmighty beasts, and from Tars Tarkas, also, when he had visited that\r\ngreat green jeddak among his horde at Thark.  So now he centred\r\nupon the work in hand all that he had ever learned about them from\r\nothers and from his own experience, for he, too, had ridden and\r\nhandled them many times.\r\n\r\nThe temper of the thoats of Torquas appeared even shorter than their\r\nvicious cousins among the Tharks and Warhoons, and for a time it\r\nseemed unlikely that he should escape a savage charge on the part\r\nof a couple of old bulls that circled, squealing, about him; but\r\nat last he managed to get close enough to one of them to touch the\r\nbeast.  With the feel of his hand upon the sleek hide the creature\r\nquieted, and in answer to the telepathic command of the red man\r\nsank to its knees.\r\n\r\nIn a moment Carthoris was upon its back, guiding it toward the\r\ngreat gate that leads from the courtyard through a large building\r\nat one end into an avenue beyond.\r\n\r\nThe other bull, still squealing and enraged, followed after his\r\nfellow.  There was no bridle upon either, for these strange creatures\r\nare controlled entirely by suggestion--when they are controlled at\r\nall.\r\n\r\nEven in the hands of the giant green men bridle reins would be\r\nhopelessly futile against the mad savagery and mastodonic strength\r\nof the thoat, and so they are guided by that strange telepathic\r\npower with which the men of Mars have learned to communicate in a\r\ncrude way with the lower orders of their planet.\r\n\r\nWith difficulty Carthoris urged the two beasts to the gate, where,\r\nleaning down, he raised the latch.  Then the thoat that he was\r\nriding placed his great shoulder to the skeel-wood planking, pushed\r\nthrough, and a moment later the man and the two beasts were swinging\r\nsilently down the avenue to the edge of the plaza, where Kar Komak\r\nhid.\r\n\r\nHere Carthoris found considerable difficulty in subduing the second\r\nthoat, and as Kar Komak had never before ridden one of the beasts,\r\nit seemed a most hopeless job; but at last the bowman managed to\r\nscramble to the sleek back, and again the two beasts fled softly\r\ndown the moss-grown avenues toward the open sea-bottom beyond the\r\ncity.\r\n\r\nAll that night and the following day and the second night they\r\nrode toward the north-east.  No indication of pursuit developed,\r\nand at dawn of the second day Carthoris saw in the distance the\r\nwaving ribbon of great trees that marked one of the long Barsoomian\r\nwater-ways.\r\n\r\nImmediately they abandoned their thoats and approached the cultivated\r\ndistrict on foot.  Carthoris also discarded the metal from his\r\nharness, or such of it as might serve to identify him as a Heliumite,\r\nor of royal blood, for he did not know to what nation belonged this\r\nwaterway, and upon Mars it is always well to assume every man and\r\nnation your enemy until you have learned the contrary.\r\n\r\nIt was mid-forenoon when the two at last entered one of the roads\r\nthat cut through the cultivated districts at regular intervals,\r\njoining the arid wastes on either side with the great, white,\r\ncentral highway that follows through the centre from end to end of\r\nthe far-reaching, threadlike farm lands.\r\n\r\nThe high wall surrounding the fields served as a protection against\r\nsurprise by raiding green hordes, as well as keeping the savage\r\nbanths and other carnivora from the domestic animals and the human\r\nbeings upon the farms.\r\n\r\nCarthoris stopped before the first gate he came to, pounding for\r\nadmission.  The young man who answered his summons greeted the\r\ntwo hospitably, though he looked with considerable wonder upon the\r\nwhite skin and auburn hair of the bowman.\r\n\r\nAfter he had listened for a moment to a partial narration of their\r\nescape from the Torquasians, he invited them within, took them to\r\nhis house and bade the servants there prepare food for them.\r\n\r\nAs they waited in the low-ceiled, pleasant living room of the\r\nfarmhouse until the meal should be ready, Carthoris drew his host\r\ninto conversation that he might learn his nationality, and thus\r\nthe nation under whose dominion lay the waterway where circumstance\r\nhad placed him.\r\n\r\n\"I am Hal Vas,\" said the young man, \"son of Vas Kor, of Dusar, a\r\nnoble in the retinue of Astok, Prince of Dusar.  At present I am\r\nDwar of the Road for this district.\"\r\n\r\nCarthoris was very glad that he had not disclosed his identity, for\r\nthough he had no idea of anything that had transpired since he had\r\nleft Helium, or that Astok was at the bottom of all his misfortunes,\r\nhe well knew that the Dusarian had no love for him, and that he\r\ncould hope for no assistance within the dominions of Dusar.\r\n\r\n\"And who are you?\" asked Hal Vas.  \"By your appearance I take you\r\nfor a fighting man, but I see no insignia upon your harness.  Can\r\nit be that you are a panthan?\"\r\n\r\nNow, these wandering soldiers of fortune are common upon Barsoom,\r\nwhere most men love to fight.  They sell their services wherever\r\nwar exists, and in the occasional brief intervals when there is\r\nno organized warfare between the red nations, they join one of the\r\nnumerous expeditions that are constantly being dispatched against\r\nthe green men in protection of the waterways that traverse the\r\nwilder portions of the globe.\r\n\r\nWhen their service is over they discard the metal of the nation\r\nthey have been serving until they shall have found a new master.\r\nIn the intervals they wear no insignia, their war-worn harness and\r\ngrim weapons being sufficient to attest their calling.\r\n\r\nThe suggestion was a happy one, and Carthoris embraced the chance\r\nit afforded to account satisfactorily for himself.  There was, however,\r\na single drawback.  In times of war such panthans as happened to\r\nbe within the domain of a belligerent nation were compelled to don\r\nthe insignia of that nation and fight with her warriors.\r\n\r\nAs far as Carthoris knew Dusar was not at war with any other\r\nnation, but there was never any telling when one red nation would\r\nbe flying at the throat of a neighbour, even though the great and\r\npowerful alliance at the head of which was his father, John Carter,\r\nhad managed to maintain a long peace upon the greater portion of\r\nBarsoom.\r\n\r\nA pleasant smile lighted Hal Vas' face as Carthoris admitted his\r\nvocation.\r\n\r\n\"It is well,\" exclaimed the young man, \"that you chanced to come\r\nhither, for here you will find the means of obtaining service in\r\nshort order.  My father, Vas Kor, is even now with me, having come\r\nhither to recruit a force for the new war against Helium.\"\r\n\r\n\r\n\r\n\r\nCHAPTER XII\r\n\r\nTO SAVE DUSAR\r\n\r\n\r\nThuvia of Ptarth, battling for more than life against the lust of\r\nJav, cast a quick glance over her shoulder toward the forest from\r\nwhich had rumbled the fierce growl.  Jav looked, too.\r\n\r\nWhat they saw filled each with apprehension.  It was Komal, the\r\nbanth-god, rushing wide-jawed upon them!\r\n\r\nWhich had he chosen for his prey?  Or was it to be both?\r\n\r\nThey had not long to wait, for though the Lotharian attempted to\r\nhold the girl between himself and the terrible fangs, the great\r\nbeast found him at last.\r\n\r\nThen, shrieking, he attempted to fly toward Lothar, after pushing\r\nThuvia bodily into the face of the man-eater.  But his flight was\r\nof short duration.  In a moment Komal was upon him, rending his\r\nthroat and chest with demoniacal fury.\r\n\r\nThe girl reached their side a moment later, but it was with difficulty\r\nthat she tore the mad beast from its prey.  Still growling and\r\ncasting hungry glances back upon Jav, the banth at last permitted\r\nitself to be led away into the wood.\r\n\r\nWith her giant protector by her side Thuvia set forth to find the\r\npassage through the cliffs, that she might attempt the seemingly\r\nimpossible feat of reaching far-distant Ptarth across the more than\r\nseventeen thousand haads of savage Barsoom.\r\n\r\nShe could not believe that Carthoris had deliberately deserted her,\r\nand so she kept a constant watch for him; but as she bore too far\r\nto the north in her search for the tunnel she passed the Heliumite\r\nas he was returning to Lothar in search of her.\r\n\r\nThuvia of Ptarth was having difficulty in determining the exact\r\nstatus of the Prince of Helium in her heart.  She could not admit\r\neven to herself that she loved him, and yet she had permitted him\r\nto apply to her that term of endearment and possession to which\r\na Barsoomian maid should turn deaf ears when voiced by other lips\r\nthan those of her husband or fiance--\"my princess.\"\r\n\r\nKulan Tith, Jeddak of Kaol, to whom she was affianced, commanded\r\nher respect and admiration.  Had it been that she had surrendered\r\nto her father's wishes because of pique that the handsome Heliumite\r\nhad not taken advantage of his visits to her father's court\r\nto push the suit for her hand that she had been quite sure he had\r\ncontemplated since that distant day the two had sat together upon\r\nthe carved seat within the gorgeous Garden of the Jeddaks that\r\ngraced the inner courtyard of the palace of Salensus Oll at Kadabra?\r\n\r\nDid she love Kulan Tith?  Bravely she tried to believe that she\r\ndid; but all the while her eyes wandered through the coming darkness\r\nfor the figure of a clean-limbed fighting man--black-haired and\r\ngrey-eyed.  Black was the hair of Kulan Tith; but his eyes were\r\nbrown.\r\n\r\nIt was almost dark when she found the entrance to the tunnel.  Safely\r\nshe passed through to the hills beyond, and here, under the bright\r\nlight of Mars' two moons, she halted to plan her future action.\r\n\r\nShould she wait here in the hope that Carthoris would return in\r\nsearch of her?  Or should she continue her way north-east toward\r\nPtarth?  Where, first, would Carthoris have gone after leaving the\r\nvalley of Lothar?\r\n\r\nHer parched throat and dry tongue gave her the answer--toward\r\nAaanthor and water.  Well, she, too, would go first to Aaanthor,\r\nwhere she might find more than the water she needed.\r\n\r\nWith Komal by her side she felt little fear, for he would protect\r\nher from all other savage beasts.  Even the great white apes would\r\nflee the mighty banth in terror.  Men only need she fear, but she\r\nmust take this and many other chances before she could hope to\r\nreach her father's court again.\r\n\r\nWhen at last Carthoris found her, only to be struck down by the\r\nlong-sword of a green man, Thuvia prayed that the same fate might\r\novertake her.\r\n\r\nThe sight of the red warriors leaping from their fliers had, for a\r\nmoment, filled her with renewed hope--hope that Carthoris of Helium\r\nmight be only stunned and that they would rescue him; but when she\r\nsaw the Dusarian metal upon their harness, and that they sought\r\nonly to escape with her alone from the charging Torquasians, she\r\ngave up.\r\n\r\nKomal, too, was dead--dead across the body of the Heliumite.  She\r\nwas, indeed, alone now.  There was none to protect her.\r\n\r\nThe Dusarian warriors dragged her to the deck of the nearest flier.\r\nAll about them the green warriors surged in an attempt to wrest\r\nher from the red.\r\n\r\nAt last those who had not died in the conflict gained the decks\r\nof the two craft.  The engines throbbed and purred--the propellers\r\nwhirred.  Quickly the swift boats shot heavenward.\r\n\r\nThuvia of Ptarth glanced about her.  A man stood near, smiling down\r\ninto her face.  With a gasp of recognition she looked full into\r\nhis eyes, and then with a little moan of terror and understanding\r\nshe buried her face in her hands and sank to the polished skeel-wood\r\ndeck.  It was Astok, Prince of Dusar, who bent above her.\r\n\r\nSwift were the fliers of Astok of Dusar, and great the need for\r\nreaching his father's court as quickly as possible, for the fleets\r\nof war of Helium and Ptarth and Kaol were scattered far and wide\r\nabove Barsoom.  Nor would it go well with Astok of Dusar should\r\nany one of them discover Thuvia of Ptarth a prisoner upon his own\r\nvessel.\r\n\r\nAaanthor lies in fifty south latitude, and forty east of Horz, the\r\ndeserted seat of ancient Barsoomian culture and learning, while\r\nDusar lies fifteen degrees north of the equator and twenty degrees\r\neast from Horz.\r\n\r\nGreat though the distance is, the fliers covered it without a stop.\r\nLong before they had reached their destination Thuvia of Ptarth had\r\nlearned several things that cleared up the doubts that had assailed\r\nher mind for many days.  Scarce had they risen above Aaanthor than\r\nshe recognized one of the crew as a member of the crew of that other\r\nflier that had borne her from her father's gardens to Aaanthor.\r\nThe presence of Astok upon the craft settled the whole question.\r\nShe had been stolen by emissaries of the Dusarian prince--Carthoris\r\nof Helium had had nothing to do with it.\r\n\r\nNor did Astok deny the charge when she accused him.  He only smiled\r\nand pleaded his love for her.\r\n\r\n\"I would sooner mate with a white ape!\" she cried, when he would\r\nhave urged his suit.\r\n\r\nAstok glowered sullenly upon her.\r\n\r\n\"You shall mate with me, Thuvia of Ptarth,\" he growled, \"or, by\r\nyour first ancestor, you shall have your preference--and mate with\r\na white ape.\"\r\n\r\nThe girl made no reply, nor could he draw her into conversation\r\nduring the balance of the journey.\r\n\r\nAs a matter of fact Astok was a trifle awed by the proportions\r\nof the conflict which his abduction of the Ptarthian princess had\r\ninduced, nor was he over comfortable with the weight of responsibility\r\nwhich the possession of such a prisoner entailed.\r\n\r\nHis one thought was to get her to Dusar, and there let his father\r\nassume the responsibility.  In the meantime he would be as careful\r\nas possible to do nothing to affront her, lest they all might be\r\ncaptured and he have to account for his treatment of the girl to\r\none of the great jeddaks whose interest centred in her.\r\n\r\nAnd so at last they came to Dusar, where Astok hid his prisoner in\r\na secret room high in the east tower of his own palace.  He had\r\nsworn his men to silence in the matter of the identity of the girl,\r\nfor until he had seen his father, Nutus, Jeddak of Dusar, he dared\r\nnot let any one know whom he had brought with him from the south.\r\n\r\nBut when he appeared in the great audience chamber before the\r\ncruel-lipped man who was his sire, he found his courage oozing,\r\nand he dared not speak of the princess hid within his palace.  It\r\noccurred to him to test his father's sentiments upon the subject,\r\nand so he told a tale of capturing one who claimed to know the\r\nwhereabouts of Thuvia of Ptarth.\r\n\r\n\"And if you command it, Sire,\" he said, \"I will go and capture\r\nher--fetching her here to Dusar.\"\r\n\r\nNutus frowned and shook his head.\r\n\r\n\"You have done enough already to set Ptarth and Kaol and Helium\r\nall three upon us at once should they learn your part in the theft\r\nof the Ptarth princess.  That you succeeded in shifting the guilt\r\nupon the Prince of Helium was fortunate, and a masterly move of\r\nstrategy; but were the girl to know the truth and ever return to\r\nher father's court, all Dusar would have to pay the penalty, and to\r\nhave her here a prisoner amongst us would be an admission of guilt\r\nfrom the consequences of which naught could save us.  It would cost\r\nme my throne, Astok, and that I have no mind to lose.\r\n\r\n\"If we had her here--\" the elder man suddenly commenced to muse,\r\nrepeating the phrase again and again.  \"If we had her here, Astok,\"\r\nhe exclaimed fiercely.  \"Ah, if we but had her here and none knew\r\nthat she was here!  Can you not guess, man?  The guilt of Dusar\r\nmight be for ever buried with her bones,\" he concluded in a low,\r\nsavage whisper.\r\n\r\nAstok, Prince of Dusar, shuddered.\r\n\r\nWeak he was; yes, and wicked, too; but the suggestion that his\r\nfather's words implied turned him cold with horror.\r\n\r\nCruel to their enemies are the men of Mars; but the word \"enemies\"\r\nis commonly interpreted to mean men only.  Assassination runs riot\r\nin the great Barsoomian cities; yet to murder a woman is a crime\r\nso unthinkable that even the most hardened of the paid assassins\r\nwould shrink from you in horror should you suggest such a thing to\r\nhim.\r\n\r\nNutus was apparently oblivious to his son's all-too-patent terror\r\nat his suggestion.  Presently he continued:\r\n\r\n\"You say that you know where the girl lies hid, since she was stolen\r\nfrom your people at Aaanthor.  Should she be found by any one of\r\nthe three powers, her unsupported story would be sufficient to turn\r\nthem all against us.\r\n\r\n\"There is but one way, Astok,\" cried the older man.  \"You must return\r\nat once to her hiding-place and fetch her hither in all secrecy.\r\nAnd, look you here!  Return not to Dusar without her, upon pain of\r\ndeath!\"\r\n\r\nAstok, Prince of Dusar, well knew his royal father's temper.  He\r\nknew that in the tyrant's heart there pulsed no single throb of\r\nlove for any creature.\r\n\r\nAstok's mother had been a slave woman.  Nutus had never loved her.\r\nHe had never loved another.  In youth he had tried to find a bride\r\nat the courts of several of his powerful neighbours, but their\r\nwomen would have none of him.\r\n\r\nAfter a dozen daughters of his own nobility had sought self-destruction\r\nrather than wed him he had given up.  And then it had been that\r\nhe had legally wed one of his slaves that he might have a son to\r\nstand among the jeds when Nutus died and a new jeddak was chosen.\r\n\r\nSlowly Astok withdrew from the presence of his father.  With white\r\nface and shaking limbs he made his way to his own palace.  As he\r\ncrossed the courtyard his glance chanced to wander to the great\r\neast tower looming high against the azure of the sky.\r\n\r\nAt sight of it beads of sweat broke out upon his brow.\r\n\r\nIssus!  No other hand than his could be trusted to do the horrid\r\nthing.  With his own fingers he must crush the life from that\r\nperfect throat, or plunge the silent blade into the red, red heart.\r\n\r\nHer heart!  The heart that he had hoped would brim with love for\r\nhim!\r\n\r\nBut had it done so?  He recalled the haughty contempt with which his\r\nprotestations of love had been received.  He went cold and then hot\r\nto the memory of it.  His compunctions cooled as the self-satisfaction\r\nof a near revenge crowded out the finer instincts that had for\r\na moment asserted themselves--the good that he had inherited from\r\nthe slave woman was once again submerged in the bad blood that had\r\ncome down to him from his royal sire; as, in the end, it always\r\nwas.\r\n\r\nA cold smile supplanted the terror that had dilated his eyes.  He\r\nturned his steps toward the tower.  He would see her before he set\r\nout upon the journey that was to blind his father to the fact that\r\nthe girl was already in Dusar.\r\n\r\nQuietly he passed in through the secret way, ascending a spiral\r\nrunway to the apartment in which the Princess of Ptarth was immured.\r\n\r\nAs he entered the room he saw the girl leaning upon the sill of\r\nthe east casement, gazing out across the roof tops of Dusar toward\r\ndistant Ptarth.  He hated Ptarth.  The thought of it filled him\r\nwith rage.  Why not finish her now and have it done with?\r\n\r\nAt the sound of his step she turned quickly toward him.  Ah, how\r\nbeautiful she was!  His sudden determination faded beneath the\r\nglorious light of her wondrous beauty.  He would wait until he had\r\nreturned from his little journey of deception--maybe there might\r\nbe some other way then.  Some other hand to strike the blow--with\r\nthat face, with those eyes before him, he could never do it.  Of\r\nthat he was positive.  He had always gloried in the cruelty of his\r\nnature, but, Issus! he was not that cruel.  No, another must be\r\nfound--one whom he could trust.\r\n\r\nHe was still looking at her as she stood there before him meeting\r\nhis gaze steadily and unafraid.  He felt the hot passion of his\r\nlove mounting higher and higher.\r\n\r\nWhy not sue once more?  If she would relent, all might yet be\r\nwell.  Even if his father could not be persuaded, they could fly\r\nto Ptarth, laying all the blame of the knavery and intrigue that\r\nhad thrown four great nations into war, upon the shoulders of Nutus.\r\nAnd who was there that would doubt the justice of the charge?\r\n\r\n\"Thuvia,\" he said, \"I come once again, for the last time, to lay\r\nmy heart at your feet.  Ptarth and Kaol and Dusar are battling with\r\nHelium because of you.  Wed me, Thuvia, and all may yet be as it\r\nshould be.\"\r\n\r\nThe girl shook her head.\r\n\r\n\"Wait!\" he commanded, before she could speak.  \"Know the truth\r\nbefore you speak words that may seal, not only your own fate, but\r\nthat of the thousands of warriors who battle because of you.\r\n\r\n\"Refuse to wed me willingly, and Dusar would be laid waste should\r\never the truth be known to Ptarth and Kaol and Helium.  They would\r\nraze our cities, leaving not one stone upon another.  They would\r\nscatter our peoples across the face of Barsoom from the frozen north\r\nto the frozen south, hunting them down and slaying them, until this\r\ngreat nation remained only as a hated memory in the minds of men.\r\n\r\n\"But while they are exterminating the Dusarians, countless thousands\r\nof their own warriors must perish--and all because of the stubbornness\r\nof a single woman who would not wed the prince who loves her.\r\n\r\n\"Refuse, Thuvia of Ptarth, and there remains but a single\r\nalternative--no man must ever know your fate.  Only a handful of\r\nloyal servitors besides my royal father and myself know that you\r\nwere stolen from the gardens of Thuvan Dihn by Astok, Prince of\r\nDusar, or that to-day you be imprisoned in my palace.\r\n\r\n\"Refuse, Thuvia of Ptarth, and you must die to save Dusar--there\r\nis no other way.  Nutus, the jeddak, has so decreed.  I have spoken.\"\r\n\r\nFor a long moment the girl let her level gaze rest full upon the\r\nface of Astok of Dusar.  Then she spoke, and though the words were\r\nfew, the unimpassioned tone carried unfathomable depths of cold\r\ncontempt.\r\n\r\n\"Better all that you have threatened,\" she said, \"than you.\"\r\n\r\nThen she turned her back upon him and went to stand once more before\r\nthe east window, gazing with sad eyes toward distant Ptarth.\r\n\r\nAstok wheeled and left the room, returning after a short interval\r\nof time with food and drink.\r\n\r\n\"Here,\" he said, \"is sustenance until I return again.  The next to\r\nenter this apartment will be your executioner.  Commend yourself to\r\nyour ancestors, Thuvia of Ptarth, for within a few days you shall\r\nbe with them.\"\r\n\r\nThen he was gone.\r\n\r\nHalf an hour later he was interviewing an officer high in the navy\r\nof Dusar.\r\n\r\n\"Whither went Vas Kor?\" he asked.  \"He is not at his palace.\"\r\n\r\n\"South, to the great waterway that skirts Torquas,\" replied the\r\nother.  \"His son, Hal Vas, is Dwar of the Road there, and thither\r\nhas Vas Kor gone to enlist recruits among the workers on the farms.\"\r\n\r\n\"Good,\" said Astok, and a half-hour more found him rising above\r\nDusar in his swiftest flier.\r\n\r\n\r\n\r\n\r\nCHAPTER XIII\r\n\r\nTURJUN, THE PANTHAN\r\n\r\n\r\nThe face of Carthoris of Helium gave no token of the emotions that\r\nconvulsed him inwardly as he heard from the lips of Hal Vas that\r\nHelium was at war with Dusar, and that fate had thrown him into\r\nthe service of the enemy.\r\n\r\nThat he might utilize this opportunity to the good of Helium scarce\r\nsufficed to outweigh the chagrin he felt that he was not fighting\r\nin the open at the head of his own loyal troops.\r\n\r\nTo escape the Dusarians might prove an easy matter; and then again\r\nit might not.  Should they suspect his loyalty (and the loyalty\r\nof an impressed panthan was always open to suspicion), he might\r\nnot find an opportunity to elude their vigilance until after the\r\ntermination of the war, which might occur within days, or, again,\r\nonly after long and weary years of bloodshed.\r\n\r\nHe recalled that history recorded wars in which actual military\r\noperations had been carried on without cessation for five or six\r\nhundred years, and even now there were nations upon Barsoom with\r\nwhich Helium had made no peace within the history of man.\r\n\r\nThe outlook was not cheering.  He could not guess that within a\r\nfew hours he would be blessing the fate that had thrown him into\r\nthe service of Dusar.\r\n\r\n\"Ah!\" exclaimed Hal Vas.  \"Here is my father now.  Kaor! Vas Kor.\r\nHere is one you will be glad to meet--a doughty panthan--\"  He\r\nhesitated.\r\n\r\n\"Turjun,\" interjected Carthoris, seizing upon the first appellation\r\nthat occurred to him.\r\n\r\nAs he spoke his eyes crossed quickly to the tall warrior who was\r\nentering the room.  Where before had he seen that giant figure,\r\nthat taciturn countenance, and the livid sword-cut from temple to\r\nmouth?\r\n\r\n\"Vas Kor,\" repeated Carthoris mentally.  \"Vas Kor!\" Where had he\r\nseen the man before?\r\n\r\nAnd then the noble spoke, and like a flash it all came back to\r\nCarthoris--the forward servant upon the landing-stage at Ptarth\r\nthat time that he had been explaining the intricacies of his new\r\ncompass to Thuvan Dihn; the lone slave that had guarded his own hangar\r\nthat night he had left upon his ill-fated journey for Ptarth--the\r\njourney that had brought him so mysteriously to far Aaanthor.\r\n\r\n\"Vas Kor,\" he repeated aloud, \"blessed be your ancestors for this\r\nmeeting,\" nor did the Dusarian guess the wealth of meaning that lay\r\nbeneath that hackneyed phrase with which a Barsoomian acknowledges\r\nan introduction.\r\n\r\n\"And blessed be yours, Turjun,\" replied Vas Kor.\r\n\r\nNow came the introduction of Kar Komak to Vas Kor, and as Carthoris\r\nwent through the little ceremony there came to him the only\r\nexplanation he might make to account for the white skin and auburn\r\nhair of the bowman; for he feared that the truth might not be\r\nbelieved and thus suspicion be cast upon them both from the beginning.\r\n\r\n\"Kar Komak,\" he explained, \"is, as you can see, a thern.  He\r\nhas wandered far from his icebound southern temples in search of\r\nadventure.  I came upon him in the pits of Aaanthor; but though\r\nI have known him so short a time, I can vouch for his bravery and\r\nloyalty.\"\r\n\r\nSince the destruction of the fabric of their false religion by\r\nJohn Carter, the majority of the therns had gladly accepted the\r\nnew order of things, so that it was now no longer uncommon to see\r\nthem mingling with the multitudes of red men in any of the great\r\ncities of the outer world, so Vas Kor neither felt nor expressed\r\nany great astonishment.\r\n\r\nAll during the interview Carthoris watched, catlike, for some\r\nindication that Vas Kor recognized in the battered panthan the\r\nerstwhile gorgeous Prince of Helium; but the sleepless nights, the\r\nlong days of marching and fighting, the wounds and the dried blood\r\nhad evidently sufficed to obliterate the last remnant of his likeness\r\nto his former self; and then Vas Kor had seen him but twice in all\r\nhis life.  Little wonder that he did not know him.\r\n\r\nDuring the evening Vas Kor announced that on the morrow they should\r\ndepart north toward Dusar, picking up recruits at various stations\r\nalong the way.\r\n\r\nIn a great field behind the house a flier lay--a fair-sized\r\ncruiser-transport that would accommodate many men, yet swift and\r\nwell armed also.  Here Carthoris slept, and Kar Komak, too, with\r\nthe other recruits, under guard of the regular Dusarian warriors\r\nthat manned the craft.\r\n\r\nToward midnight Vas Kor returned to the vessel from his son's\r\nhouse, repairing at once to his cabin.  Carthoris, with one of the\r\nDusarians, was on watch.  It was with difficulty that the Heliumite\r\nrepressed a cold smile as the noble passed within a foot of\r\nhim--within a foot of the long, slim, Heliumitic blade that swung\r\nin his harness.\r\n\r\nHow easy it would have been!  How easy to avenge the cowardly\r\ntrick that had been played upon him--to avenge Helium and Ptarth\r\nand Thuvia!\r\n\r\nBut his hand moved not toward the dagger's hilt, for first Vas Kor\r\nmust serve a better purpose--he might know where Thuvia of Ptarth\r\nlay hidden now, if it had truly been Dusarians that had spirited\r\nher away during the fight before Aaanthor.\r\n\r\nAnd then, too, there was the instigator of the entire foul plot.\r\nHE must pay the penalty; and who better than Vas Kor could lead\r\nthe Prince of Helium to Astok of Dusar?\r\n\r\nFaintly out of the night there came to Carthoris's ears the purring\r\nof a distant motor.  He scanned the heavens.\r\n\r\nYes, there it was far in the north, dimly outlined against the\r\ndark void of space that stretched illimitably beyond it, the faint\r\nsuggestion of a flier passing, unlighted, through the Barsoomian\r\nnight.\r\n\r\nCarthoris, knowing not whether the craft might be friend or foe\r\nof Dusar, gave no sign that he had seen, but turned his eyes in\r\nanother direction, leaving the matter to the Dusarian who stood\r\nwatch with him.\r\n\r\nPresently the fellow discovered the oncoming craft, and sounded\r\nthe low alarm which brought the balance of the watch and an officer\r\nfrom their sleeping silks and furs upon the deck near by.\r\n\r\nThe cruiser-transport lay without lights, and, resting as she was\r\nupon the ground, must have been entirely invisible to the oncoming\r\nflier, which all presently recognized as a small craft.\r\n\r\nIt soon became evident that the stranger intended making a landing,\r\nfor she was now spiraling slowly above them, dropping lower and\r\nlower in each graceful curve.\r\n\r\n\"It is the Thuria,\" whispered one of the Dusarian warriors.  \"I\r\nwould know her in the blackness of the pits among ten thousand\r\nother craft.\"\r\n\r\n\"Right you are!\" exclaimed Vas Kor, who had come on deck.  And then\r\nhe hailed:\r\n\r\n\"Kaor, Thuria!\"\r\n\r\n\"Kaor!\" came presently from above after a brief silence.  Then:\r\n\"What ship?\"\r\n\r\n\"Cruiser-transport Kalksus, Vas Kor of Dusar.\"\r\n\r\n\"Good!\" came from above.  \"Is there safe landing alongside?\"\r\n\r\n\"Yes, close in to starboard.  Wait, we will show our lights,\" and\r\na moment later the smaller craft settled close beside the Kalksus,\r\nand the lights of the latter were immediately extinguished once\r\nmore.\r\n\r\nSeveral figures could be seen slipping over the side of the Thuria\r\nand advancing toward the Kalksus.  Ever suspicious, the Dusarians\r\nstood ready to receive the visitors as friends or foes as closer\r\ninspection might prove them.  Carthoris stood quite near the rail,\r\nready to take sides with the new-comers should chance have it that\r\nthey were Heliumites playing a bold stroke of strategy upon this\r\nlone Dusarian ship.  He had led like parties himself, and knew that\r\nsuch a contingency was quite possible.\r\n\r\nBut the face of the first man to cross the rail undeceived him\r\nwith a shock that was not at all unpleasurable--it was the face of\r\nAstok, Prince of Dusar.\r\n\r\nScarce noticing the others upon the deck of the Kalksus, Astok\r\nstrode forward to accept Vas Kor's greeting, then he summoned the\r\nnoble below.  The warriors and officers returned to their sleeping\r\nsilks and furs, and once more the deck was deserted except for the\r\nDusarian warrior and Turjun, the panthan, who stood guard.\r\n\r\nThe latter walked quietly to and fro.  The former leaned across\r\nthe rail, wishing for the hour that would bring him relief.  He\r\ndid not see his companion approach the lights of the cabin of Vas\r\nKor.  He did not see him stoop with ear close pressed to a tiny\r\nventilator.\r\n\r\n\"May the white apes take us all,\" cried Astok ruefully, \"if we are\r\nnot in as ugly a snarl as you have ever seen!  Nutus thinks that\r\nwe have her in hiding far away from Dusar.  He has bidden me bring\r\nher here.\"\r\n\r\nHe paused.  No man should have heard from his lips the thing he was\r\ntrying to tell.  It should have been for ever the secret of Nutus\r\nand Astok, for upon it rested the safety of a throne.  With that\r\nknowledge any man could wrest from the Jeddak of Dusar whatever he\r\nlisted.\r\n\r\nBut Astok was afraid, and he wanted from this older man the suggestion\r\nof an alternative.  He went on.\r\n\r\n\"I am to kill her,\" he whispered, looking fearfully around.  \"Nutus\r\nmerely wishes to see the body that he may know his commands have\r\nbeen executed.  I am now supposed to be gone to the spot where we\r\nhave her hidden that I may fetch her in secrecy to Dusar.  None\r\nis to know that she has ever been in the keeping of a Dusarian.  I\r\ndo not need to tell you what would befall Dusar should Ptarth and\r\nHelium and Kaol ever learn the truth.\"\r\n\r\nThe jaws of the listener at the ventilator clicked together with\r\na vicious snap.  Before he had but guessed at the identity of the\r\nsubject of this conversation.  Now he knew.  And they were to kill\r\nher!  His muscular fingers clenched until the nails bit into the\r\npalms.\r\n\r\n\"And you wish me to go with you while you fetch her to Dusar,\" Vas\r\nKor was saying.  \"Where is she?\"\r\n\r\nAstok bent close and whispered into the other's ear.  The suggestion\r\nof a smile crossed the cruel features of Vas Kor.  He realized the\r\npower that lay within his grasp.  He should be a jed at least.\r\n\r\n\"And how may I help you, my Prince?\" asked the older man suavely.\r\n\r\n\"I cannot kill her,\" said Astok.  \"Issus!  I cannot do it!  When\r\nshe turns those eyes upon me my heart becomes water.\"\r\n\r\nVas Kor's eyes narrowed.\r\n\r\n\"And you wish--\"  He paused, the interrogation unfinished, yet\r\ncomplete.\r\n\r\nAstok nodded.\r\n\r\n\"YOU do not love her,\" he said.\r\n\r\n\"But I love my life--though I am only a lesser noble,\" he concluded\r\nmeaningly.\r\n\r\n\"You shall be a greater noble--a noble of the first rank!\" exclaimed\r\nAstok.\r\n\r\n\"I would be a jed,\" said Vas Kor bluntly.\r\n\r\nAstok hesitated.\r\n\r\n\"A jed must die before there can be another jed,\" he pleaded.\r\n\r\n\"Jeds have died before,\" snapped Vas Kor.  \"It would doubtless be\r\nnot difficult for you to find a jed you do not love, Astok--there\r\nare many who do not love you.\"\r\n\r\nAlready Vas Kor was commencing to presume upon his power over the\r\nyoung prince.  Astok was quick to note and appreciate the subtle\r\nchange in his lieutenant.  A cunning scheme entered his weak and\r\nwicked brain.\r\n\r\n\"As you say, Vas Kor!\" he exclaimed.  \"You shall be a jed when\r\nthe thing is done,\" and then, to himself:  \"Nor will it then be\r\ndifficult for me to find a jed I do not love.\"\r\n\r\n\"When shall we return to Dusar?\" asked the noble.\r\n\r\n\"At once,\" replied Astok.  \"Let us get under way now--there is\r\nnaught to keep you here?\"\r\n\r\n\"I had intended sailing on the morrow, picking up such recruits as\r\nthe various Dwars of the Roads might have collected for me, as we\r\nreturned to Dusar.\"\r\n\r\n\"Let the recruits wait,\" said Astok.  \"Or, better still, come you\r\nto Dusar upon the Thuria, leaving the Kalksus to follow and pick\r\nup the recruits.\"\r\n\r\n\"Yes,\" acquiesced Vas Kor; \"that is the better plan.  Come; I am\r\nready,\" and he rose to accompany Astok to the latter's flier.\r\n\r\nThe listener at the ventilator came to his feet slowly, like an\r\nold man.  His face was drawn and pinched and very white beneath\r\nthe light copper of his skin.  She was to die!  And he helpless to\r\navert the tragedy.  He did not even know where she was imprisoned.\r\n\r\nThe two men were ascending from the cabin to the deck.  Turjun,\r\nthe panthan, crept close to the companionway, his sinuous fingers\r\nclosing tightly upon the hilt of his dagger.  Could he despatch\r\nthem both before he was overpowered?  He smiled.  He could slay an\r\nentire utan of her enemies in his present state of mind.\r\n\r\nThey were almost abreast of him now.  Astok was speaking.\r\n\r\n\"Bring a couple of your men along, Vas Kor,\" he said.  \"We are\r\nshort-handed upon the Thuria, so quickly did we depart.\"\r\n\r\nThe panthan's fingers dropped from the dagger's hilt.  His quick\r\nmind had grasped here a chance for succouring Thuvia of Ptarth.\r\nHe might be chosen as one to accompany the assassins, and once he\r\nhad learned where the captive lay he could dispatch Astok and Vas\r\nKor as well as now.  To kill them before he knew where Thuvia was\r\nhid was simply to leave her to death at the hands of others; for\r\nsooner or later Nutus would learn her whereabouts, and Nutus, Jeddak\r\nof Dusar, could not afford to let her live.\r\n\r\nTurjun put himself in the path of Vas Kor that he might not be\r\noverlooked.  The noble aroused the men sleeping upon the deck, but\r\nalways before him the strange panthan whom he had recruited that\r\nsame day found means for keeping himself to the fore.\r\n\r\nVas Kor turned to his lieutenant, giving instruction for the bringing\r\nof the Kalksus to Dusar, and the gathering up of the recruits; then\r\nhe signed to two warriors who stood close behind the padwar.\r\n\r\n\"You two accompany us to the Thuria,\" he said, \"and put yourselves\r\nat the disposal of her dwar.\"\r\n\r\nIt was dark upon the deck of the Kalksus, so Vas Kor had not a good\r\nlook at the faces of the two he chose; but that was of no moment,\r\nfor they were but common warriors to assist with the ordinary duties\r\nupon a flier, and to fight if need be.\r\n\r\nOne of the two was Kar Komak, the bowman.  The other was not\r\nCarthoris.\r\n\r\nThe Heliumite was mad with disappointment.  He snatched his dagger\r\nfrom his harness; but already Astok had left the deck of the Kalksus,\r\nand he knew that before he could overtake him, should he dispatch\r\nVas Kor, he would be killed by the Dusarian warriors, who now were\r\nthick upon the deck.  With either one of the two alive Thuvia was\r\nin as great danger as though both lived--it must be both!\r\n\r\nAs Vas Kor descended to the ground Carthoris boldly followed him,\r\nnor did any attempt to halt him, thinking, doubtless, that he was\r\none of the party.\r\n\r\nAfter him came Kar Komak and the Dusarian warrior who had been\r\ndetailed to duty upon the Thuria.  Carthoris walked close to the\r\nleft side of the latter.  Now they came to the dense shadow under\r\nthe side of the Thuria.  It was very dark there, so that they had\r\nto grope for the ladder.\r\n\r\nKar Komak preceded the Dusarian.  The latter reached upward for\r\nthe swinging rounds, and as he did so steel fingers closed upon\r\nhis windpipe and a steel blade pierced the very centre of his heart.\r\n\r\nTurjun, the panthan, was the last to clamber over the rail of the\r\nThuria, drawing the rope ladder in after him.\r\n\r\nA moment later the flier was rising rapidly, headed for the north.\r\n\r\nAt the rail Kar Komak turned to speak to the warrior who had been\r\ndetailed to accompany him.  His eyes went wide as they rested\r\nupon the face of the young man whom he had met beside the granite\r\ncliffs that guard mysterious Lothar.  How had he come in place of\r\nthe Dusarian?\r\n\r\nA quick sign, and Kar Komak turned once more to find the Thuria's\r\ndwar that he might report himself for duty.  Behind him followed\r\nthe panthan.\r\n\r\nCarthoris blessed the chance that had caused Vas Kor to choose the\r\nbowman of all others, for had it been another Dusarian there would\r\nhave been questions to answer as to the whereabouts of the warrior\r\nwho lay so quietly in the field beyond the residence of Hal Vas,\r\nDwar of the Southern Road; and Carthoris had no answer to that\r\nquestion other than his sword point, which alone was scarce adequate\r\nto convince the entire crew of the Thuria.\r\n\r\nThe journey to Dusar seemed interminable to the impatient Carthoris,\r\nthough as a matter of fact it was quickly accomplished.  Some\r\ntime before they reached their destination they met and spoke with\r\nanother Dusarian war flier.  From it they learned that a great\r\nbattle was soon to be fought south-east of Dusar.\r\n\r\nThe combined navies of Dusar, Ptarth and Kaol had been intercepted\r\nin their advance toward Helium by the mighty Heliumitic navy--the\r\nmost formidable upon Barsoom, not alone in numbers and armament,\r\nbut in the training and courage of its officers and warriors, and\r\nthe zitidaric proportions of many of its monster battleships.\r\n\r\nNot for many a day had there been the promise of such a battle.\r\nFour jeddaks were in direct command of their own fleets--Kulan Tith\r\nof Kaol, Thuvan Dihn of Ptarth, and Nutus of Dusar upon one side;\r\nwhile upon the other was Tardos Mors, Jeddak of Helium.  With the\r\nlatter was John Carter, Warlord of Mars.\r\n\r\nFrom the far north another force was moving south across the barrier\r\ncliffs--the new navy of Talu, Jeddak of Okar, coming in response\r\nto the call from the warlord.  Upon the decks of the sullen ships\r\nof war black-bearded yellow men looked over eagerly toward the\r\nsouth.  Gorgeous were they in their splendid cloaks of orluk and\r\napt.  Fierce, formidable fighters from the hothouse cities of the\r\nfrozen north.\r\n\r\nAnd from the distant south, from the sea of Omean and the cliffs\r\nof gold, from the temples of the therns and the garden of Issus,\r\nother thousands sailed into the north at the call of the great man\r\nthey all had learned to respect, and, respecting, love.  Pacing the\r\nflagship of this mighty fleet, second only to the navy of Helium,\r\nwas the ebon Xodar, Jeddak of the First Born, his heart beating\r\nstrong in anticipation of the coming moment when he should hurl his\r\nsavage crews and the weight of his mighty ships upon the enemies\r\nof the warlord.\r\n\r\nBut would these allies reach the theatre of war in time to be of\r\navail to Helium?  Or, would Helium need them?\r\n\r\nCarthoris, with the other members of the crew of the Thuria, heard\r\nthe gossip and the rumours.  None knew of the two fleets, the one\r\nfrom the south and the other from the north, that were coming to\r\nsupport the ships of Helium, and all of Dusar were convinced that\r\nnothing now could save the ancient power of Helium from being wiped\r\nfor ever from the upper air of Barsoom.\r\n\r\nCarthoris, too, loyal son of Helium that he was, felt that even\r\nhis beloved navy might not be able to cope successfully with the\r\ncombined forces of three great powers.\r\n\r\nNow the Thuria touched the landing-stage above the palace of Astok.\r\nHurriedly the prince and Vas Kor disembarked and entered the drop\r\nthat would carry them to the lower levels of the palace.\r\n\r\nClose beside it was another drop that was utilized by common\r\nwarriors.  Carthoris touched Kar Komak upon the arm.\r\n\r\n\"Come!\" he whispered.  \"You are my only friend among a nation of\r\nenemies.  Will you stand by me?\"\r\n\r\n\"To the death,\" replied Kar Komak.\r\n\r\nThe two approached the drop.  A slave operated it.\r\n\r\n\"Where are your passes?\" he asked.\r\n\r\nCarthoris fumbled in his pocket pouch as though in search of them,\r\nat the same time entering the cage.  Kar Komak followed him, closing\r\nthe door.  The slave did not start the cage downward.  Every second\r\ncounted.  They must reach the lower level as soon as possible after\r\nAstok and Vas Kor if they would know whither the two went.\r\n\r\nCarthoris turned suddenly upon the slave, hurling him to the opposite\r\nside of the cage.\r\n\r\n\"Bind and gag him, Kar Komak!\" he cried.\r\n\r\nThen he grasped the control lever, and as the cage shot downward\r\nat sickening speed, the bowman grappled with the slave.  Carthoris\r\ncould not leave the control to assist his companion, for should\r\nthey touch the lowest level at the speed at which they were going,\r\nall would be dashed to instant death.\r\n\r\nBelow him he could now see the top of Astok's cage in the parallel\r\nshaft, and he reduced the speed of his to that of the other.  The\r\nslave commenced to scream.\r\n\r\n\"Silence him!\" cried Carthoris.\r\n\r\nA moment later a limp form crumpled to the floor of the cage.\r\n\r\n\"He is silenced,\" said Kar Komak.\r\n\r\nCarthoris brought the cage to a sudden stop at one of the higher\r\nlevels of the palace.  Opening the door, he grasped the still form\r\nof the slave and pushed it out upon the floor.  Then he banged the\r\ngate and resumed the downward drop.\r\n\r\nOnce more he sighted the top of the cage that held Astok and Vas\r\nKor.  An instant later it had stopped, and as he brought his car\r\nto a halt, he saw the two men disappear through one of the exits\r\nof the corridor beyond.\r\n\r\n\r\n\r\n\r\nCHAPTER XIV\r\n\r\nKULAN TITH'S SACRIFICE\r\n\r\n\r\nThe morning of the second day of her incarceration in the east tower\r\nof the palace of Astok, Prince of Dusar, found Thuvia of Ptarth\r\nwaiting in dull apathy the coming of the assassin.\r\n\r\nShe had exhausted every possibility of escape, going over and over\r\nagain the door and the windows, the floor and the walls.\r\n\r\nThe solid ersite slabs she could not even scratch; the tough\r\nBarsoomian glass of the windows would have shattered to nothing\r\nless than a heavy sledge in the hands of a strong man.  The door\r\nand the lock were impregnable.  There was no escape.  And they had\r\nstripped her of her weapons so that she could not even anticipate\r\nthe hour of her doom, thus robbing them of the satisfaction of\r\nwitnessing her last moments.\r\n\r\nWhen would they come?  Would Astok do the deed with his own hands?\r\nShe doubted that he had the courage for it.  At heart he was a\r\ncoward--she had known it since first she had heard him brag as, a\r\nvisitor at the court of her father, he had sought to impress her\r\nwith his valour.\r\n\r\nShe could not help but compare him with another.  And with whom\r\nwould an affianced bride compare an unsuccessful suitor?  With her\r\nbetrothed?  And did Thuvia of Ptarth now measure Astok of Dusar by\r\nthe standards of Kulan Tith, Jeddak of Kaol?\r\n\r\nShe was about to die; her thoughts were her own to do with as\r\nshe pleased; yet furthest from them was Kulan Tith.  Instead the\r\nfigure of the tall and comely Heliumite filled her mind, crowding\r\ntherefrom all other images.\r\n\r\nShe dreamed of his noble face, the quiet dignity of his bearing,\r\nthe smile that lit his eyes as he conversed with his friends, and\r\nthe smile that touched his lips as he fought with his enemies--the\r\nfighting smile of his Virginian sire.\r\n\r\nAnd Thuvia of Ptarth, true daughter of Barsoom, found her breath\r\nquickening and heart leaping to the memory of this other smile--the\r\nsmile that she would never see again.  With a little half-sob\r\nthe girl sank to the pile of silks and furs that were tumbled in\r\nconfusion beneath the east windows, burying her face in her arms.\r\n\r\nIn the corridor outside her prison-room two men had paused in heated\r\nargument.\r\n\r\n\"I tell you again, Astok,\" one was saying, \"that I shall not do\r\nthis thing unless you be present in the room.\"\r\n\r\nThere was little of the respect due royalty in the tone of the\r\nspeaker's voice.  The other, noting it, flushed.\r\n\r\n\"Do not impose too far upon my friendship for you, Vas Kor,\" he\r\nsnapped.  \"There is a limit to my patience.\"\r\n\r\n\"There is no question of royal prerogative here,\" returned Vas\r\nKor.  \"You ask me to become an assassin in your stead, and against\r\nyour jeddak's strict injunctions.  You are in no position, Astok,\r\nto dictate to me; but rather should you be glad to accede to my\r\nreasonable request that you be present, thus sharing the guilt with\r\nme.  Why should I bear it all?\"\r\n\r\nThe younger man scowled, but he advanced toward the locked door,\r\nand as it swung in upon its hinges, he entered the room beyond at\r\nthe side of Vas Kor.\r\n\r\nAcross the chamber the girl, hearing them enter, rose to her feet\r\nand faced them.  Under the soft copper of her skin she blanched\r\njust a trifle; but her eyes were brave and level, and the haughty\r\ntilt of her firm little chin was eloquent of loathing and contempt.\r\n\r\n\"You still prefer death?\" asked Astok.\r\n\r\n\"To YOU, yes,\" replied the girl coldly.\r\n\r\nThe Prince of Dusar turned to Vas Kor and nodded.  The noble drew\r\nhis short-sword and crossed the room toward Thuvia.\r\n\r\n\"Kneel!\" he commanded.\r\n\r\n\"I prefer to die standing,\" she replied.\r\n\r\n\"As you will,\" said Vas Kor, feeling the point of his blade with\r\nhis left thumb.  \"In the name of Nutus, Jeddak of Dusar!\" he cried,\r\nand ran quickly toward her.\r\n\r\n\"In the name of Carthoris, Prince of Helium!\" came in low tones\r\nfrom the doorway.\r\n\r\nVas Kor turned to see the panthan he had recruited at his son's\r\nhouse leaping across the floor toward him. The fellow brushed past\r\nAstok with an:  \"After him, you--calot!\"\r\n\r\nVas Kor wheeled to meet the charging man.\r\n\r\n\"What means this treason?\" he cried.\r\n\r\nAstok, with bared sword, leaped to Vas Kor's assistance.  The\r\npanthan's sword clashed against that of the noble, and in the first\r\nencounter Vas Kor knew that he faced a master swordsman.\r\n\r\nBefore he half realized the stranger's purpose he found the man\r\nbetween himself and Thuvia of Ptarth, at bay facing the two swords of\r\nthe Dusarians.  But he fought not like a man at bay.  Ever was he\r\nthe aggressor, and though always he kept his flashing blade between\r\nthe girl and her enemies, yet he managed to force them hither and\r\nthither about the room, calling to the girl to follow close behind\r\nhim.\r\n\r\nUntil it was too late neither Vas Kor nor Astok dreamed of that\r\nwhich lay in the panthan's mind; but at last as the fellow stood\r\nwith his back toward the door, both understood--they were penned in\r\ntheir own prison, and now the intruder could slay them at his will,\r\nfor Thuvia of Ptarth was bolting the door at the man's direction,\r\nfirst taking the key from the opposite side, where Astok had left\r\nit when they had entered.\r\n\r\nAstok, as was his way, finding that the enemy did not fall immediately\r\nbefore their swords, was leaving the brunt of the fighting to\r\nVas Kor, and now as his eyes appraised the panthan carefully they\r\npresently went wider and wider, for slowly he had come to recognize\r\nthe features of the Prince of Helium.\r\n\r\nThe Heliumite was pressing close upon Vas Kor.  The noble was\r\nbleeding from a dozen wounds.  Astok saw that he could not for long\r\nwithstand the cunning craft of that terrible sword hand.\r\n\r\n\"Courage, Vas Kor!\" he whispered in the other's ear.  \"I have a\r\nplan.  Hold him but a moment longer and all will be well,\" but the\r\nbalance of the sentence, \"with Astok, Prince of Dusar,\" he did not\r\nvoice aloud.\r\n\r\nVas Kor, dreaming no treachery, nodded his head, and for a moment\r\nsucceeded in holding Carthoris at bay.  Then the Heliumite and the\r\ngirl saw the Dusarian prince run swiftly to the opposite side of\r\nthe chamber, touch something in the wall that sent a great panel\r\nswinging inward, and disappear into the black vault beyond.\r\n\r\nIt was done so quickly that by no possibility could they have\r\nintercepted him.  Carthoris, fearful lest Vas Kor might similarly\r\nelude him, or Astok return immediately with reinforcements, sprang\r\nviciously in upon his antagonist, and a moment later the headless\r\nbody of the Dusarian noble rolled upon the ersite floor.\r\n\r\n\"Come!\" cried Carthoris.  \"There is no time to be lost.  Astok will\r\nbe back in a moment with enough warriors to overpower me.\"\r\n\r\nBut Astok had no such plan in mind, for such a move would have\r\nmeant the spreading of the fact among the palace gossips that the\r\nPtarthian princess was a prisoner in the east tower.  Quickly would\r\nthe word have come to his father, and no amount of falsifying could\r\nhave explained away the facts that the jeddak's investigation would\r\nhave brought to light.\r\n\r\nInstead Astok was racing madly through a long corridor to reach\r\nthe door of the tower-room before Carthoris and Thuvia left the\r\napartment.  He had seen the girl remove the key and place it in\r\nher pocket-pouch, and he knew that a dagger point driven into the\r\nkeyhole from the opposite side would imprison them in the secret\r\nchamber till eight dead worlds circled a cold, dead sun.\r\n\r\nAs fast as he could run Astok entered the main corridor that led\r\nto the tower chamber.  Would he reach the door in time?  What if\r\nthe Heliumite should have already emerged and he should run upon\r\nhim in the passageway?  Astok felt a cold chill run up his spine.\r\nHe had no stomach to face that uncanny blade.\r\n\r\nHe was almost at the door.  Around the next turn of the corridor\r\nit stood.  No, they had not left the apartment.  Evidently Vas Kor\r\nwas still holding the Heliumite!\r\n\r\nAstok could scarce repress a grin at the clever manner in which he\r\nhad outwitted the noble and disposed of him at the same time.  And\r\nthen he rounded the turn and came face to face with an auburn-haired,\r\nwhite giant.\r\n\r\nThe fellow did not wait to ask the reason for his coming; instead\r\nhe leaped upon him with a long-sword, so that Astok had to parry a\r\ndozen vicious cuts before he could disengage himself and flee back\r\ndown the runway.\r\n\r\nA moment later Carthoris and Thuvia entered the corridor from the\r\nsecret chamber.\r\n\r\n\"Well, Kar Komak?\" asked the Heliumite.\r\n\r\n\"It is fortunate that you left me here, red man,\" said the bowman.\r\n\"I but just now intercepted one who seemed over-anxious to reach\r\nthis door--it was he whom they call Astok, Prince of Dusar.\"\r\n\r\nCarthoris smiled.\r\n\r\n\"Where is he now?\" he asked.\r\n\r\n\"He escaped my blade, and ran down this corridor,\" replied Kar\r\nKomak.\r\n\r\n\"We must lose no time, then!\" exclaimed Carthoris.  \"He will have\r\nthe guard upon us yet!\"\r\n\r\nTogether the three hastened along the winding passages through which\r\nCarthoris and Kar Komak had tracked the Dusarians by the marks of\r\nthe latter's sandals in the thin dust that overspread the floors\r\nof these seldom-used passage-ways.\r\n\r\nThey had come to the chamber at the entrances to the lifts before\r\nthey met with opposition.  Here they found a handful of guardsmen,\r\nand an officer, who, seeing that they were strangers, questioned\r\ntheir presence in the palace of Astok.\r\n\r\nOnce more Carthoris and Kar Komak had recourse to their blades,\r\nand before they had won their way to one of the lifts the noise of\r\nthe conflict must have aroused the entire palace, for they heard\r\nmen shouting, and as they passed the many levels on their quick\r\npassage to the landing-stage they saw armed men running hither and\r\nthither in search of the cause of the commotion.\r\n\r\nBeside the stage lay the Thuria, with three warriors on guard.\r\nAgain the Heliumite and the Lotharian fought shoulder to shoulder,\r\nbut the battle was soon over, for the Prince of Helium alone would\r\nhave been a match for any three that Dusar could produce.\r\n\r\nScarce had the Thuria risen from the ways ere a hundred or more\r\nfighting men leaped to view upon the landing-stage.  At their head\r\nwas Astok of Dusar, and as he saw the two he had thought so safely\r\nin his power slipping from his grasp, he danced with rage and\r\nchagrin, shaking his fists and hurling abuse and vile insults at\r\nthem.\r\n\r\nWith her bow inclined upward at a dizzy angle, the Thuria shot\r\nmeteor-like into the sky.  From a dozen points swift patrol boats\r\ndarted after her, for the scene upon the landing-stage above the\r\npalace of the Prince of Dusar had not gone unnoticed.\r\n\r\nA dozen times shots grazed the Thuria's side, and as Carthoris could\r\nnot leave the control levers, Thuvia of Ptarth turned the muzzles\r\nof the craft's rapid-fire guns upon the enemy as she clung to the\r\nsteep and slippery surface of the deck.\r\n\r\nIt was a noble race and a noble fight.  One against a score now, for\r\nother Dusarian craft had joined in the pursuit; but Astok, Prince\r\nof Dusar, had built well when he built the Thuria.  None in the\r\nnavy of his sire possessed a swifter flier; no other craft so well\r\narmoured or so well armed.\r\n\r\nOne by one the pursuers were distanced, and as the last of them\r\nfell out of range behind, Carthoris dropped the Thuria's nose to a\r\nhorizontal plane, as with lever drawn to the last notch, she tore\r\nthrough the thin air of dying Mars toward the east and Ptarth.\r\n\r\nThirteen and a half thousand haads away lay Ptarth--a stiff\r\nthirty-hour journey for the swiftest of fliers, and between Dusar\r\nand Ptarth might lie half the navy of Dusar, for in this direction\r\nwas the reported seat of the great naval battle that even now might\r\nbe in progress.\r\n\r\nCould Carthoris have known precisely where the great fleets of\r\nthe contending nations lay, he would have hastened to them without\r\ndelay, for in the return of Thuvia to her sire lay the greatest\r\nhope of peace.\r\n\r\nHalf the distance they covered without sighting a single warship,\r\nand then Kar Komak called Carthoris's attention to a distant craft\r\nthat rested upon the ochre vegetation of the great dead sea-bottom,\r\nabove which the Thuria was speeding.\r\n\r\nAbout the vessel many figures could be seen swarming.  With the\r\naid of powerful glasses, the Heliumite saw that they were green\r\nwarriors, and that they were repeatedly charging down upon the crew\r\nof the stranded airship.  The nationality of the latter he could\r\nnot make out at so great a distance.\r\n\r\nIt was not necessary to change the course of the Thuria to permit\r\nof passing directly above the scene of battle, but Carthoris dropped\r\nhis craft a few hundred feet that he might have a better and closer\r\nview.\r\n\r\nIf the ship was of a friendly power, he could do no less than stop\r\nand direct his guns upon her enemies, though with the precious\r\nfreight he carried he scarcely felt justified in landing, for\r\nhe could offer but two swords in reinforcement--scarce enough to\r\nwarrant jeopardizing the safety of the Princess of Ptarth.\r\n\r\nAs they came close above the stricken ship, they could see that\r\nit would be but a question of minutes before the green horde would\r\nswarm across the armoured bulwarks to glut the ferocity of their\r\nbloodlust upon the defenders.\r\n\r\n\"It would be futile to descend,\" said Carthoris to Thuvia.  \"The\r\ncraft may even be of Dusar--she shows no insignia.  All that we\r\nmay do is fire upon the hordesmen\"; and as he spoke he stepped to\r\none of the guns and deflected its muzzle toward the green warriors\r\nat the ship's side.\r\n\r\nAt the first shot from the Thuria those upon the vessel below\r\nevidently discovered her for the first time.  Immediately a device\r\nfluttered from the bow of the warship on the ground.  Thuvia of\r\nPtarth caught her breath quickly, glancing at Carthoris.\r\n\r\nThe device was that of Kulan Tith, Jeddak of Kaol--the man to whom\r\nthe Princess of Ptarth was betrothed!\r\n\r\nHow easy for the Heliumite to pass on, leaving his rival to the fate\r\nthat could not for long be averted!  No man could accuse him of\r\ncowardice or treachery, for Kulan Tith was in arms against Helium,\r\nand, further, upon the Thuria were not enough swords to delay even\r\ntemporarily the outcome that already was a foregone conclusion in\r\nthe minds of the watchers.\r\n\r\nWhat would Carthoris, Prince of Helium, do?\r\n\r\nScarce had the device broken to the faint breeze ere the bow of\r\nthe Thuria dropped at a sharp angle toward the ground.\r\n\r\n\"Can you navigate her?\" asked Carthoris of Thuvia.\r\n\r\nThe girl nodded.\r\n\r\n\"I am going to try to take the survivors aboard,\" he continued.\r\n\"It will need both Kar Komak and myself to man the guns while\r\nthe Kaolians take to the boarding tackle.  Keep her bow depressed\r\nagainst the rifle fire.  She can bear it better in her forward\r\narmour, and at the same time the propellers will be protected.\"\r\n\r\nHe hurried to the cabin as Thuvia took the control.  A moment later\r\nthe boarding tackle dropped from the keel of the Thuria, and from\r\na dozen points along either side stout, knotted leathern lines\r\ntrailed downward.  At the same time a signal broke from her bow:\r\n\r\n\"Prepare to board us.\"\r\n\r\nA shout arose from the deck of the Kaolian warship.  Carthoris,\r\nwho by this time had returned from the cabin, smiled sadly.  He was\r\nabout to snatch from the jaws of death the man who stood between\r\nhimself and the woman he loved.\r\n\r\n\"Take the port bow gun, Kar Komak,\" he called to the bowman, and\r\nhimself stepped to the gun upon the starboard bow.\r\n\r\nThey could now feel the sharp shock of the explosions of the green\r\nwarriors' projectiles against the armoured sides of the staunch\r\n_Thuria_.\r\n\r\nIt was a forlorn hope at best.  At any moment the repulsive ray\r\ntanks might be pierced.  The men upon the Kaolian ship were battling\r\nwith renewed hope.  In the bow stood Kulan Tith, a brave figure\r\nfighting beside his brave warriors, beating back the ferocious\r\ngreen men.\r\n\r\nThe Thuria came low above the other craft.  The Kaolians were forming\r\nunder their officers in readiness to board, and then a sudden fierce\r\nfusillade from the rifles of the green warriors vomited their hail\r\nof death and destruction into the side of the brave flier.\r\n\r\nLike a wounded bird she dived suddenly Marsward careening drunkenly.\r\nThuvia turned the bow upward in an effort to avert the imminent\r\ntragedy, but she succeeded only in lessening the shock of the\r\nflier's impact as she struck the ground beside the Kaolian ship.\r\n\r\nWhen the green men saw only two warriors and a woman upon the deck\r\nof the Thuria, a savage shout of triumph arose from their ranks,\r\nwhile an answering groan broke from the lips of the Kaolians.\r\n\r\nThe former now turned their attention upon the new arrival, for\r\nthey saw her defenders could soon be overcome and that from her\r\ndeck they could command the deck of the better-manned ship.\r\n\r\nAs they charged a shout of warning came from Kulan Tith, upon the\r\nbridge of his own ship, and with it an appreciation of the valour\r\nof the act that had put the smaller vessel in these sore straits.\r\n\r\n\"Who is it,\" he cried, \"that offers his life in the service of\r\nKulan Tith?  Never was wrought a nobler deed of self-sacrifice upon\r\nBarsoom!\"\r\n\r\nThe green horde was scrambling over the Thuria's side as there\r\nbroke from the bow the device of Carthoris, Prince of Helium, in\r\nreply to the query of the jeddak of Kaol.  None upon the smaller\r\nflier had opportunity to note the effect of this announcement upon\r\nthe Kaolians, for their attention was claimed slowly now by that\r\nwhich was transpiring upon their own deck.\r\n\r\nKar Komak stood behind the gun he had been operating, staring with\r\nwide eyes at the onrushing hideous green warriors.  Carthoris,\r\nseeing him thus, felt a pang of regret that, after all, this man\r\nthat he had thought so valorous should prove, in the hour of need,\r\nas spineless as Jav or Tario.\r\n\r\n\"Kar Komak--the man!\" he shouted.  \"Grip yourself!  Remember the\r\ndays of the glory of the seafarers of Lothar.  Fight!  Fight, man!\r\nFight as never man fought before.  All that remains to us is to\r\ndie fighting.\"\r\n\r\nKar Komak turned toward the Heliumite, a grim smile upon his lips.\r\n\r\n\"Why should we fight,\" he asked.  \"Against such fearful odds?\r\nThere is another way--a better way.  Look!\"  He pointed toward the\r\ncompanion-way that led below deck.\r\n\r\nThe green men, a handful of them, had already reached the Thuria's\r\ndeck, as Carthoris glanced in the direction the Lotharian had\r\nindicated.  The sight that met his eyes set his heart to thumping\r\nin joy and relief--Thuvia of Ptarth might yet be saved?  For from\r\nbelow there poured a stream of giant bowmen, grim and terrible.\r\nNot the bowmen of Tario or Jav, but the bowmen of an odwar of\r\nbowmen--savage fighting men, eager for the fray.\r\n\r\nThe green warriors paused in momentary surprise and consternation,\r\nbut only for a moment.  Then with horrid war-cries they leaped\r\nforward to meet these strange, new foemen.\r\n\r\nA volley of arrows stopped them in their tracks.  In a moment the\r\nonly green warriors upon the deck of the Thuria were dead warriors,\r\nand the bowmen of Kar Komak were leaping over the vessel's sides\r\nto charge the hordesmen upon the ground.\r\n\r\nUtan after utan tumbled from the bowels of the Thuria to launch\r\nthemselves upon the unfortunate green men.  Kulan Tith and his\r\nKaolians stood wide-eyed and speechless with amazement as they\r\nsaw thousands of these strange, fierce warriors emerge from the\r\ncompanion-way of the small craft that could not comfortably have\r\naccommodated more than fifty.\r\n\r\nAt last the green men could withstand the onslaught of overwhelming\r\nnumbers no longer.  Slowly, at first, they fell back across the\r\nochre plain.  The bowmen pursued them.  Kar Komak, standing upon\r\nthe deck of the Thuria, trembled with excitement.\r\n\r\nAt the top of his lungs he voiced the savage war-cry of his forgotten\r\nday.  He roared encouragement and commands at his battling utans,\r\nand then, as they charged further and further from the Thuria, he\r\ncould no longer withstand the lure of battle.\r\n\r\nLeaping over the ship's side to the ground, he joined the last of\r\nhis bowmen as they raced off over the dead sea-bottom in pursuit\r\nof the fleeing green horde.\r\n\r\nBeyond a low promontory of what once had been an island the green\r\nmen were disappearing toward the west.  Close upon their heels\r\nraced the fleet bowmen of a bygone day, and forging steadily ahead\r\namong them Carthoris and Thuvia could see the mighty figure of Kar\r\nKomak, brandishing aloft the Torquasian short-sword with which he\r\nwas armed, as he urged his creatures after the retreating enemy.\r\n\r\nAs the last of them disappeared behind the promontory, Carthoris\r\nturned toward Thuvia of Ptarth.\r\n\r\n\"They have taught me a lesson, these vanishing bowmen of Lothar,\"\r\nhe said.  \"When they have served their purpose they remain not\r\nto embarrass their masters by their presence.  Kulan Tith and his\r\nwarriors are here to protect you.  My acts have constituted the\r\nproof of my honesty of purpose.  Good-bye,\" and he knelt at her\r\nfeet, raising a bit of her harness to his lips.\r\n\r\nThe girl reached out a hand and laid it upon the thick black hair\r\nof the head bent before her.  Softly she asked:\r\n\r\n\"Where are you going, Carthoris?\"\r\n\r\n\"With Kar Komak, the bowman,\" he replied.  \"There will be fighting\r\nand forgetfulness.\"\r\n\r\nThe girl put her hands before her eyes, as though to shut out some\r\nmighty temptation from her sight.\r\n\r\n\"May my ancestors have mercy upon me,\" she cried, \"if I say the\r\nthing I have no right to say; but I cannot see you cast your life\r\naway, Carthoris, Prince of Helium!  Stay, my chieftain.  Stay--I\r\nlove you!\"\r\n\r\nA cough behind them brought both about, and there they saw standing,\r\nnot two paces from them Kulan Tith, Jeddak of Kaol.\r\n\r\nFor a long moment none spoke.  Then Kulan Tith cleared his throat.\r\n\r\n\"I could not help hearing all that passed,\" he said.  \"I am no fool,\r\nto be blind to the love that lies between you.  Nor am I blind to\r\nthe lofty honour that has caused you, Carthoris, to risk your life\r\nand hers to save mine, though you thought that that very act would\r\nrob you of the chance to keep her for your own.\r\n\r\n\"Nor can I fail to appreciate the virtue that has kept your lips\r\nsealed against words of love for this Heliumite, Thuvia, for I know\r\nthat I have but just heard the first declaration of your passion\r\nfor him.  I do not condemn you.  Rather should I have condemned\r\nyou had you entered a loveless marriage with me.\r\n\r\n\"Take back your liberty, Thuvia of Ptarth,\" he cried, \"and bestow\r\nit where your heart already lies enchained, and when the golden\r\ncollars are clasped about your necks you will see that Kulan Tith's\r\nis the first sword to be raised in declaration of eternal friendship\r\nfor the new Princess of Helium and her royal mate!\"\r\n\r\n\r\n\r\n\r\nA GLOSSARY OF NAMES AND TERMS USED IN THE MARTIAN BOOKS\r\n\r\nAaanthor.  A dead city of ancient Mars.\r\n\r\nAisle of Hope.  An aisle leading to the court-room in Helium.\r\n\r\nApt.  An Arctic monster.  A huge, white-furred creature with\r\n      six limbs, four of which, short and heavy, carry it over\r\n      the snow and ice; the other two, which grow forward\r\n      from its shoulders on either side of its long, powerful\r\n      neck, terminate in white, hairless hands with which it\r\n      seizes and holds its prey.  Its head and mouth are\r\n      similar in appearance to those of a hippopotamus,\r\n      except that from the sides of the lower jawbone two\r\n      mighty horns curve slightly downward toward the front.\r\n      Its two huge eyes extend in two vast oval patches from\r\n      the centre of the top of the cranium down either side\r\n      of the head to below the roots of the horns, so that\r\n      these weapons really grow out from the lower part of\r\n      the eyes, which are composed of several thousand ocelli\r\n      each.  Each ocellus is furnished with its own lid, and\r\n      the apt can, at will, close as many of the facets of\r\n      his huge eyes as he chooses.  (See THE WARLORD OF MARS.)\r\n\r\nAstok.  Prince of Dusar.\r\n\r\nAvenue of Ancestors.  A street in Helium.\r\n\r\nBanth.  Barsoomian lion.  A fierce beast of prey that roams\r\n      the low hills surrounding the dead seas of ancient Mars.\r\n      It is almost hairless, having only a great, bristly mane\r\n      about its thick neck.  Its long, lithe body is supported\r\n      by ten powerful legs, its enormous jaws are equipped\r\n      with several rows of long needle-like fangs, and its\r\n      mouth reaches to a point far back of its tiny ears.  It\r\n      has enormous protruding eyes of green.  (See THE GODS\r\n      OF MARS.)\r\n\r\nBar Comas.  Jeddak of Warhoon.  (See A PRINCESS OF MARS.)\r\n\r\nBarsoom.  MARS.\r\n\r\nBlack pirates of Barsoom.  Men six feet and over in height.\r\n      Have clear-cut and handsome features; their eyes are\r\n      well set and large, though a slight narrowness lends\r\n      them a crafty appearance.  The iris is extremely black\r\n      while the eyeball itself is quite white and clear.  Their\r\n      skin has the appearance of polished ebony.  (See THE\r\n      GODS OF MARS.)\r\n\r\nCalot.  A dog.  About the size of a Shetland pony and has\r\n      ten short legs.  The head bears a slight resemblance to\r\n      that of a frog, except that the jaws are equipped with\r\n      three rows of long, sharp tusks.  (See A PRINCESS OF MARS.)\r\n\r\nCarter, John.  Warlord of Mars.\r\n\r\nCarthoris of Helium.  Son of John Carter and Dejah Thoris.\r\n\r\nDak Kova.  Jed among the Warhoons (later jeddak).\r\n\r\nDarseen.  Chameleon-like reptile.\r\n\r\nDator.  Chief or prince among the First Born.\r\n\r\nDejah Thoris.  Princess of Helium.\r\n\r\nDjor Kantos.  Son of Kantos Kan; padwar of the Fifth Utan.\r\n\r\nDor.  Valley of Heaven.\r\n\r\nDotar Sojat.  John Carter's Martian name, from the\r\n      surnames of the first two warrior chieftains he killed.\r\n\r\nDusar.  A Martian kingdom.\r\n\r\nDwar.  Captain.\r\n\r\nErsite.  A kind of stone.\r\n\r\nFather of Therns.  High Priest of religious cult.\r\n\r\nFirst Born.  Black race; black pirates.\r\n\r\nKar Komak.  Odwar of Lotharian bowmen.\r\n\r\nGate of Jeddaks.  A gate in Helium.\r\n\r\nGozava.  Tars Tarkas' dead wife.\r\n\r\nGur Tus.  Dwar of the Tenth Utan.\r\n\r\nHaad.  Martian mile.\r\n\r\nHal Vas.  Son of Vas Kor the Dusarian noble.\r\n\r\nHastor.  A city of Helium.\r\n\r\nHekkador.  Title of Father of Therns.\r\n\r\nHelium.  The empire of the grandfather of Dejah Thoris.\r\n\r\nHoly Therns.  A Martian religious cult.\r\n\r\nHortan Gur.  Jeddak of Torquas.\r\n\r\nHor Vastus.  Padwar in the navy of Helium.\r\n\r\nHorz.  Deserted city; Barsoomian Greenwich.\r\n\r\nIllall.  A city of Okar.\r\n\r\nIss.  River of Death.  (See A PRINCESS OF MARS.)\r\n\r\nIssus.  Goddess of Death, whose abode is upon the banks\r\n      of the Lost Sea of Korus.  (See THE GODS OF MARS.)\r\n\r\nJav.  A Lotharian.\r\n\r\nJed.  King.\r\n\r\nJeddak.  Emperor.\r\n\r\nKab Kadja.  Jeddak of the Warhoons of the south.\r\n\r\nKadabra.  Capital of Okar.\r\n\r\nKadar.  Guard.\r\n\r\nKalksus.  Cruiser; transport under Vas Kor.\r\n\r\nKantos Kan.  Padwar in the Helium navy.\r\n\r\nKaol.  A Martian kingdom in the eastern hemisphere.\r\n\r\nKaor.  Greeting.\r\n\r\nKarad.  Martian degree.\r\n\r\nKomal.  The Lotharian god; a huge banth.\r\n\r\nKorad.  A dead city of ancient Mars.  (See A PRINCESS OF MARS.)\r\n\r\nKorus.  The Lost Sea of Dor.\r\n\r\nKulan Tith.  Jeddak of Kaol.  (See THE WARLORD OF MARS.)\r\n\r\nLakor.  A thern.\r\n\r\nLarok.  A Dusarian warrior; artificer.\r\n\r\nLorquas Ptomel.  Jed among the Tharks.  (See A PRINCESS OF MARS.)\r\n\r\nLothar.  The forgotten city.\r\n\r\nMarentina.  A principality of Okar.\r\n\r\nMatai Shang.  Father of Therns.  (See THE GODS OF MARS.)\r\n\r\nMors Kajak.  A jed of lesser Helium.\r\n\r\nNotan.  Royal Psychologist of Zodanga.\r\n\r\nNutus.  Jeddak of Dusar.\r\n\r\nOd.  Martian foot.\r\n\r\nOdwar.  A commander, or general.\r\n\r\nOkar.  Land of the yellow men.\r\n\r\nOld Ben (or Uncle Ben).  The writer's body-servant (coloured).\r\n\r\nOmad.  Man with one name.\r\n\r\nOmean.  The buried sea.\r\n\r\nOrluk.  A black and yellow striped Arctic monster.\r\n\r\nOtz Mountains.  Surrounding the Valley Dor and the Lost\r\n      Sea of Korus.\r\n\r\nPadwar.  Lieutenant.\r\n\r\nPanthan.  A soldier of fortune.\r\n\r\nParthak.  The Zodangan who brought food to John Carter\r\n      in the pits of Zat Arras.  (See THE GODS OF MARS.)\r\n\r\nPedestal of Truth.  Within the courtroom of Helium.\r\n\r\nPhaidor.  Daughter of Matai Shang.  (See THE GODS OF MARS.)\r\n\r\nPimalia.  Gorgeous flowering plant.\r\n\r\nPlant men of Barsoom.  A race inhabiting the Valley Dor.\r\n      They are ten or twelve feet in height when standing\r\n      erect; their arms are very short and fashioned after the\r\n      manner of an elephant's trunk, being sinuous; the body\r\n      is hairless and ghoulish blue except for a broad band\r\n      of white which encircles the protruding, single eye, the\r\n      pupil, iris and ball of which are dead white.  The nose\r\n      is a ragged, inflamed, circular hole in the centre of\r\n      the blank face, resembling a fresh bullet wound which\r\n      has not yet commenced to bleed.  There is no mouth in\r\n      the head.  With the exception of the face, the head is\r\n      covered by a tangled mass of jet-black hair some eight\r\n      or ten inches in length.  Each hair is about the thickness\r\n      of a large angleworm.  The body, legs and feet are\r\n      of human shape but of monstrous proportions, the\r\n      feet being fully three feet long and very flat and broad.\r\n      The method of feeding consists in running their odd\r\n      hands over the surface of the turf, cropping off the\r\n      tender vegetation with razor-like talons and sucking it\r\n      up from two mouths, which lie one in the palm of each\r\n      hand.  They are equipped with a massive tail about six\r\n      feet long, quite round where it joins the body, but\r\n      tapering to a flat, thin blade toward the end, which\r\n      trails at right angles to the ground.  (See THE GODS OF MARS.)\r\n\r\nPrince Soran.  Overlord of the navy of Ptarth.\r\n\r\nPtarth.  A Martian kingdom.\r\n\r\nPtor.  Family name of three Zodangan brothers.\r\n\r\nSab Than.  Prince of Zodanga.  (See A PRINCESS OF MARS.)\r\n\r\nSafad.  A Martian inch.\r\n\r\nSak.  Jump.\r\n\r\nSalensus Oll.  Jeddak of Okar.  (See THE WARLORD OF MARS.)\r\n\r\nSaran Tal.  Carthoris' major-domo.\r\n\r\nSarkoja.  A green Martian woman.  (See A PRINCESS OF MARS.)\r\n\r\nSator Throg.  A Holy Thern of the Tenth Cycle.\r\n\r\nShador.  Island in Omean used as a prison.\r\n\r\nSilian.  Slimy reptiles inhabiting the Sea of Korus.\r\n\r\nSith.  Hornet-like monster.  Bald-faced and about the size of\r\n      a Hereford bull.  Has frightful jaws in front and mighty\r\n      poisoned sting behind.  The eyes, of myriad facets, cover\r\n      three-fourths of the head, permitting the creature to see\r\n      in all directions at one and the same time.  (See THE\r\n      WARLORD OF MARS.)\r\n\r\nSkeel.  A Martian hardwood.\r\n\r\nSola.  A young green Martian woman.\r\n\r\nSolan.  An official of the palace.\r\n\r\nSompus.  A kind of tree.\r\n\r\nSorak.  A little pet animal among the red Martian women, about the size\r\n        of a cat.\r\n\r\nSorapus.  A Martian hardwood.\r\n\r\nSorav.  An officer of Salensus Oll.\r\n\r\nTal.  A Martian second.\r\n\r\nTal Hajus.  Jeddak of Thark.\r\n\r\nTalu.  Rebel Prince of Marentina.\r\n\r\nTan Gama.  Warhoon warrior.\r\n\r\nTardos Mors.  Grandfather of Dejah Thoris and Jeddak of Helium.\r\n\r\nTario.  Jeddak of Lothar.\r\n\r\nTars Tarkas.  A green man, chieftain of the Tharks.\r\n\r\nTemple of Reward.  In Helium.\r\n\r\nTenth Cycle.  A sphere, or plane of eminence, among the Holy Therns.\r\n\r\nThabis.  Issus' chief.\r\n\r\nThan Kosis.  Jeddak of Zodanga.  (See A PRINCESS OF MARS.)\r\n\r\nThark.  City and name of a green Martian horde.\r\n\r\nThoat.  A green Martian horse.  Ten feet high at the shoulder,\r\n      with four legs on either side; a broad, flat tail,\r\n      larger at the tip than at the root which it holds straight\r\n      out behind while running; a mouth splitting its head\r\n      from snout to the long, massive neck.  It is entirely\r\n      devoid of hair and is of a dark slate colour and\r\n      exceedingly smooth and glossy.  It has a white belly and\r\n      the legs are shaded from slate at the shoulders and\r\n      hips to a vivid yellow at the feet.  The feet are heavily\r\n      padded and nailless.  (See A PRINCESS OF MARS.)\r\n\r\nThor Ban.  Jed among the green men of Torquas.\r\n\r\nThorian.  Chief of the lesser Therns.\r\n\r\nThrone of Righteousness.  In the court-room of Helium.\r\n\r\nThroxus.  Mightiest of the five oceans.\r\n\r\nThurds.  A green horde inimical to Torquas.\r\n\r\nThuria.  The nearer moon.\r\n\r\nThurid.  A black dator.\r\n\r\nThuvan Dihn.  Jeddak of Ptarth.\r\n\r\nThuvia.  Princess of Ptarth.\r\n\r\nTorith.  Officer of the guards at submarine pool.\r\n\r\nTorkar Bar.  Kaolian noble; dwar of the Kaolian Road.\r\n\r\nTorquas.  A green horde.\r\n\r\nTurjun.  Carthoris' alias.\r\n\r\nUtan.  A company of one hundred men (military).\r\n\r\nVas Kor.  A Dusarian noble.\r\n\r\nWarhoon.  A community of green men; enemy of Thark.\r\n\r\nWoola.  A Barsoomian calot.\r\n\r\nXat.  A Martian minute.\r\n\r\nXavarian.  A Helium warship.\r\n\r\nXodar.  Dator among the First Born.\r\n\r\nYersted.  Commander of the submarine.\r\n\r\nZad.  Tharkian warrior.\r\n\r\nZat Arras.  Jed of Zodanga.\r\n\r\nZithad.  Dator of the guards of Issus.  (See THE GODS OF MARS.)\r\n\r\nZitidars.  Mastodonian draught animals.\r\n\r\nZodanga.  Martian city of red men at war with Helium.\r\n\r\nZode.  A Martian hour.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nEnd of Project Gutenberg's Thuvia, Maid of Mars, by Edgar Rice Burroughs\r\n",
    "textIndexes": {
        "header": 20,
        "footer": 6290
    },
    "buildPath": "./json//pg72.json",
    "wordcount": 47786
}