{
    "id": "75",
    "formats": [
        {
            "format": "text/html",
            "fileName": "75.html.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/75.html.noimages",
            "extension": "noimages"
        },
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "75.kindle.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/75.kindle.noimages",
            "extension": "noimages"
        },
        {
            "format": "application/rdf+xml",
            "fileName": "75.rdf",
            "filePath": "http://www.gutenberg.org/ebooks/75.rdf",
            "extension": "rdf"
        },
        {
            "format": "application/epub+zip",
            "fileName": "75.epub.images",
            "filePath": "http://www.gutenberg.org/ebooks/75.epub.images",
            "extension": "images"
        },
        {
            "format": "application/epub+zip",
            "fileName": "75.epub.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/75.epub.noimages",
            "extension": "noimages"
        },
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "75.kindle.images",
            "filePath": "http://www.gutenberg.org/ebooks/75.kindle.images",
            "extension": "images"
        },
        {
            "format": "text/plain; charset=us-ascii",
            "fileName": "75/75.zip",
            "filePath": "http://www.gutenberg.org/files/75/75.zip",
            "extension": "zip"
        },
        {
            "format": "text/html",
            "fileName": "75.html.images",
            "filePath": "http://www.gutenberg.org/ebooks/75.html.images",
            "extension": "images"
        },
        {
            "format": "text/plain",
            "fileName": "75.txt.utf-8",
            "filePath": "http://www.gutenberg.org/ebooks/75.txt.utf-8",
            "extension": "utf-8"
        },
        {
            "format": "text/plain; charset=us-ascii",
            "fileName": "75/75.txt",
            "filePath": "http://www.gutenberg.org/files/75/75.txt",
            "extension": "txt"
        }
    ],
    "languages": [
        "en"
    ],
    "title": [
        "E-mail 101"
    ],
    "author": "Goodwin, John E.",
    "issued": "1993-07-01",
    "text": "*** START OF THIS PROJECT GUTENBERG EBOOK EMAIL 101 ***\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nEMAIL 101 by John Goodwin, this is an Alpha test version, your\r\nsuggestions will be included in the Beta test versions, and in\r\nthe final editions.\r\n\r\n\r\nThis rough version is missing 8 out of 28 chapters and 1 out of 5\r\nappendices.\r\n\r\nCopyright (c) 1993 by John E. Goodwin.  All Rights Reserved.\r\n\r\nYou may make and distribute verbatim copies of these course notes for\r\nnon-commercial purposes using any means, provided this copyright notice\r\nis preserved on all copies.\r\n\r\nFor information on taking the internetworking course, contact\r\n\r\n     John Goodwin (jgoodwin@adcalc.fnal.gov)\r\n     P.O. Box 6022\r\n     St. Charles, IL  60174, U.S.A.\r\n1\r\n\r\n<title> E-MAIL 101\r\n\r\nIf you like those little machines that give you 24 hour access to your\r\nbank account, you'll love the Internet.  I suppose there are still\r\npeople who, given a choice, will go to a drive-through teller just so\r\nthey can deal with a \"live person\" instead of a machine.  But even those\r\npeople will admit that it is nice to have the option of doing things for\r\nyourself, on your own schedule, anywhere.  Do you remember what it was\r\nlike before automatic tellers?  Banks closed at 3 p.m. on weekdays.\r\nEach Saturday you had to guess how much money you would need for the\r\nfollowing week.  If you were wrong you had to cash a check at a food\r\nstore (and maybe buy something you didn't want).  And if you were out of\r\ntown?  Well, there were always credit cards.\r\n\r\nWe don't do that anymore.  I think many people go to the automatic\r\nteller because they like the privacy of handling their own business\r\nwithout having to explain it all to someone else.  And we like the\r\nillusion of having access to our \"own\" account anytime we want.\r\nThere are disadvantages to using an automatic teller card too--you may\r\nhave to pay a fee each month or even for each transaction--and you have\r\nto remember to deduct those fees from your account balance or you will\r\nbounce checks.  But I'll bet you feel pretty competent using an\r\nautomatic teller and don't lose much sleep worrying over the fees.\r\n\r\nThis course is designed to give you that same sense of freedom and\r\ncompetence with the Internet that you have with an automatic teller\r\nmachine or the telephone.  With a home computer, a modem, and\r\ncommunications software, you can connect to other computers over the\r\nphone line to exchange electronic mail (E-mail), trade files, or search\r\nfor information.  Many of those computers are connected to the worldwide\r\nnetwork called the Internet.  Some few of them will--for a fee--let\r\n*you* connect to the Internet.  From there you can dial any of 900,000\r\nor more computers, send E-mail to any of 25 million people, and access\r\nhundreds of free, informative services.\r\n\r\nIn short, you are on the verge of a new method of communicating with\r\npeople and machines called \"internetworking.\"  Internetworking lets you:\r\n\r\n  o Avoid playing phone tag;\r\n\r\n  o Sign up to receive special interest electronic newsletters and\r\njournals;\r\n\r\n  o Access hundreds of information services and document collections in\r\nexactly the same way--no need to have hundreds of sets of different\r\ninstructions or hundreds of (expensive) special purpose software\r\npackages;\r\n\r\n  o Find and communicate with other people who share your interests.\r\n\r\nInternetworking is an essential skill for the '90s.  Your children will\r\nfind it as common as viewing television or using the telephone.  It\r\nstill has a few rough edges--but we'll explain those.\r\n\r\nThere is actually no single network owned by one company called the\r\nInternet.  Instead, many medium-sized networks have grown together to\r\ncreate a \"phone system\" that connects together nearly a million\r\ncomputers.  Many hundreds of these computers allow some form of public\r\naccess.  You can get the latest news or weather, download information\r\nabout Government programs or high-tech products, search on-line library\r\ncatalogues and databases, download free software, and do many other\r\nthings, with little or no monetary investment beyond the cost of your\r\nhome computer.\r\n\r\nUsing the Internet need not be expensive:  you can get on the Internet\r\nfor as little as $10 a month if you own (1) a home computer, (2) a $50\r\nmodem, and (3) some communications software (under $100).  There are\r\nmore expensive ways to connect to the Internet, of course.  These ways\r\nmake sense for businesses or organizations that make heavy use of the\r\nnetwork.  But in this course we will discuss methods that cost in the\r\n$10-$40/month range.  These methods are suitable for exploring the net\r\nafter hours and for casual use.  We will provide some basic information\r\nabout more expensive methods of connecting (Appendix C) so that you can\r\nmake informed decisions if your networking needs should increase in the\r\nfuture.\r\n\r\nInternetworking well means mastering a whole host of skills--connecting\r\ntwo computers together using the Internet is just the beginning.  You\r\nhave to learn methods for transferring information from the remote\r\ncomputer to your own.  This is a complex task that may involve using a\r\nfile transfer protocol and compression techniques.\r\n\r\nBecause the information world is so vast, your biggest problem will most\r\nlikely not be connecting to the Internet.  It will be finding what you\r\nwant.  Thus, this course covers not only the mechanics of making a\r\nconnection and transferring files, but techniques for locating material\r\nas well.  And of course you will want to be savvy about the costs of\r\ndifferent connection methods.  This means estimating whether it will\r\ncost you more per Megabyte to transfer the information or to have it\r\nfaxed to you by a friendly librarian.\r\n\r\nThis course is intended for the general public--students,\r\nbusinesspersons, librarians, teachers, writers, journalists--in fact\r\nanyone who needs to find information and communicate with others.\r\nWhether you are researching a paper, writing an article, or trying to\r\nget technical information on a product, you will use these techniques\r\nover and over.\r\n\r\nChapters marked with an asterisk are omitted from this edition.\r\n\r\n\r\nCOURSE CONTENTS\r\n\r\n1 : The Past and the Future of Internetworking\r\n\r\n2 : What Is the Internet?\r\n\r\n3 : How Do I Connect to the Internet?\r\n\r\n4 : Who Pays for the Internet?\r\n\r\n5 : Internet Basics\r\n\r\n6 : Getting on the Internet Step by Step\r\n\r\n7 : Programs and Pictures\r\n\r\n8 : File Compression Methods for Faster Transfer\r\n\r\n9 : What to Do When You Only Have E-mail\r\n\r\n10 : Employee Development:  How to Get Your Employees Internetworking\r\n\r\n\r\nPart II  Special Concerns\r\n\r\n11 : Special for Businesses\r\n\r\n12 : Special for Students and their Parents\r\n\r\n13 : Special for Writers, Journalists, Publishers, and Printers\r\n\r\n14 : Special for Elementary and High School Teachers\r\n\r\n15 : Special for Librarians\r\n\r\n16 : Special for Scholars\r\n\r\n17 : Special for Churches, Synagogues, and Mosques\r\n\r\n\r\nPart III  Research, Organization, and Writing\r\n\r\n18 : Research Methods I:  Basic Navigation Methods\r\n\r\n*19 : Research Methods II:  Usenet Newsgroups\r\n\r\n20 : Research Methods III:  Advanced Techniques\r\n\r\n*21 : Organizing Information\r\n\r\n*22 : Information Structures\r\n\r\n*23 : Boolean Logic\r\n\r\n*24 : Writing for an Internetworked World:  Basic Problems\r\n\r\n*25 : Writing for an Internetworked World:  Getting Through to your\r\nAudience\r\n\r\n\r\nPart IV  Resources\r\n\r\n*26 : The Internet Address Book\r\n\r\n27 : Bibliography\r\n\r\n*28 : Glossary\r\n\r\nAppendix A.  Computer Hints for the *Really* Green\r\n\r\nAppendix B.  Using a Modem\r\n\r\n*Appendix C.  Technical Details of an Internet Connection\r\n\r\nAppendix D.  Just Enough UNIX\r\n\r\nAppendix E.  The Ten Best Things To Get If You Only Have E-Mail\r\n\r\n\r\n\r\n<Chapter 1>  The Past and Future of Internetworking\r\n\r\nThere is an old fashioned way to connect with other computers and share\r\ninformation and there is a modern way.  It is helpful to compare the two\r\nmethods briefly in order to make contact with methods you may already\r\nknow and to show off the advantages of using the Internet.\r\n\r\nThe old fashioned (ca. 1980) method of making contact with other\r\ncomputers is through a bulletin board service (BBS).  Bulletin board\r\nservices grew up in the late 70s as a method for sharing software,\r\ntalking, playing games, etc. with a personal computer.  They range in\r\nsize from small special interest Bulletin Boards with a local following\r\nto giant national boards like CompuServe, GEnie, and The Source.  You\r\naccess a bulletin board with a modem and communication software by\r\ndialing a telephone number.  Of course, if you don't live in the local\r\narea of the BBS you have to use a long distance carrier.  This may add a\r\ncouple dollars per hour to the connect fee.\r\n\r\nThe basic services offered by a Bulletin Board and by the Internet are\r\nsimilar:\r\n\r\n  (1)  Access to a host computer (Internet TELNET command)\r\n\r\n  (2)  File transfer capability (Internet FTP command)\r\n\r\n  (3)  The ability to contact other BBS members individually (Internet\r\nE-mail)\r\n\r\n  (4)  The ability to post messages for general consumption in any of\r\nseveral catagories. (Usenet Newsgroups)\r\n\r\nThe difference is that whereas each BBS has its own dialup procedure,\r\nmenu interface, file transfer methods, billing policies, and so on, THE\r\nINTERNET USES ONE METHOD FOR ALL COMPUTERS IN THE WORLD.  The savings in\r\nterms of the \"learning curve\" is staggering.  Once you know how to use\r\nanonymous FTP you know how to get information from *hundreds* of\r\nproviders.  It is like the difference between using the postal service\r\nor using a special courier for each person you write a letter to.  Once\r\nyou know how to address the envelope and put the stamp on, you can write\r\nanyone.\r\n\r\nThe Internet has the added savings that any communications software you\r\nbuy for it works with all providers.  You do not have to buy (or\r\ncustomize) special software for each information provider.  Thus you can\r\nuse one familiar graphical user interface (\"windows\" program) to connect\r\nwith any computer.  The usual situation where you have to buy a special\r\n\"client\" program to connect to each kind of \"server\" is replaced with a\r\nsituation in which you have a single program that any \"server\" out there\r\nhas to comply with.  This standardization is the main advantage of using\r\nthe Internet.\r\n\r\nBulletin Boards are still around.  In fact, one of the easiest ways to\r\nconnect to the Internet is through a national bulletin board service.\r\nOne disadvantage of this method is that--as of this writing--national\r\nBBS's like CompuServe offer only E-mail.  You can't FTP or Telnet from\r\nthem.  And they often charge per message for E-mail, so using them can\r\nbe quite expensive.  There are better ways.\r\n\r\n\r\n<Chapter 2>  What is the Internet?\r\n\r\nThe best way to think of the Internet is as a communications medium like\r\nthe Telephone, Television, or the Postal Service.  Using the Internet\r\nyou can send a any written text by E-mail.  This is rather like mailing\r\na letter and having it arrive in seconds--three days in the most\r\nbackwards parts of the world.  Using a special protocol called File\r\nTransfer Protocol you can transfer text files that are too long to mail\r\n(over about 50 pages) or even transfer graphics and programs.  If E-mail\r\nis the equivalent of \"talking\" to a person, then Telnet, the third main\r\nInternet service, is equivalent to telephoning a computer.  As long as\r\nyou know the password for logging on to a computer, you can access and\r\nsearch any of nearly a million computers.  Details of E-mail, FTP, and\r\nTelnet are contained in Chapter 5, Internet Basics.\r\n\r\nThis chapter puts the Internet into context.  Rather than concentrating\r\non the trees that will occupy us in later chapters, it paints a big\r\npicture of the computing world in which the Internet has evolved.  When\r\nyou pick up a telephone receiver you know you can dial households,\r\nbusinesses, or government offices.  You can dial 800 numbers or 411 for\r\ninformation.  You know how to get the time or weather, get your credit\r\ncard balance, or leave a message on an answering machine.  In short, you\r\nhave a good idea of what might possibly be at the other end of the line\r\nand a great deal of experience with negotiating their various\r\nintricacies.  But you are new to the Internet.  Some sense of \"what's\r\nout there\" in this new world is necessary to avoid getting lost in the\r\nthickets of acronyms, numbers, and procedures developed by different\r\nvendors.\r\n\r\nAs we approach the middle of the 90s, the normal working situation in\r\noffices is approaching something like this:  there is a Local Area\r\nNetwork (LAN) connecting together personal computers, workstations, and\r\nmainframes of different makes.  The LAN (pronounced like \"land\" without\r\nthe \"d\") may be connected to other LANs as part of a Wide Area Network\r\n(WAN).  The WAN may or may not be part of the global network called the\r\nInternet.  In colleges, universities, and research laboratories it\r\nlikely is part of the Internet; in the commercial world, except for a\r\nfew high-tech companies, it likely is not.  But the difference between\r\nacademia and the commerical world is rapidly becoming blurred.\r\n\r\nIn addition to the LANs and WANs there are many, many home and office\r\ncomputers that *could* be part of the global network using a modem-to-\r\nhost connection.  These computers can be the portable computers of\r\noutside salespersons connecting to the central office to file a report,\r\na computer in a home-operated desktop publishing company connecting\r\nbriefly to the Internet to get a graphic for a newsletter, or a parent\r\nsending E-mail to their child at college.\r\n\r\n\r\n<Section 2.1>  Getting Over Shell-Shock\r\n\r\nLet's face it.  Not many members of the public--even the computer\r\nliterate public-are on the Internet.  There are three reasons that using\r\nthe Internet for the first time can be rather intimidating, even though\r\nit is actually rather simple to use, when you get down to the nitty-\r\ngritty of internetworking:\r\n\r\n  o  Getting on to the Internet can be a little bit complicated;\r\n\r\n  o  The capability of logging on to computers you've never used before\r\nby its very nature means facing unfamiliar--and hence uncomfortable--\r\nsituations; and\r\n\r\n  o  The world is a very big place.\r\n\r\nI like to think of the first problem--getting on to the Internet--by\r\nremembering what it was like using an \"alternative\" long distance\r\nservice before the breakup of the Bell monopoly.  People who used the\r\nalternative carriers had to dial all sorts of access codes--very often a\r\nlocal access number, a credit card number, a security code, *and* the\r\nnumber of the party they were calling.  They knew that whatever came\r\nafter that was going to be easier.\r\n\r\nThat's what getting on the Internet is like.  You may have to dial a\r\nlocal access number, get your modem settings right, and type the right\r\nmagic combination of words; but after all that, actually *using* the\r\nInternet is simple.  We'll talk you through the initial steps--after a\r\nwhile (and some frustration) it will be as unconscious as unlocking your\r\nfront door or tuning a television set.\r\n\r\nThe second problem is a little more substantial.  Using the Internet,\r\nyou can get yourself into situations that are, well, experimental.\r\nBecause the Internet gives you the freedom to \"go anywhere\" and \"do\r\nanything\"--at least if you know the passwords--you can uncover strange\r\nincompatibilities and unfamiliar systems.  I call this experience \"shell\r\nshock\".  At some point you will likely find yourself face to face with a\r\ncomputer program that expects you to type a command you don't happen to\r\nknow.\r\n\r\nYou can mostly avoid such situations by only trying things about which\r\nyou have good information.  The situation is not much different from\r\nusing a telephone:  if you stick to well-worn paths like dialing local\r\nnumbers or simple long distance calls, you will have little trouble; but\r\nif you start dialing other countries or special numbers you may be in\r\nfor a surprise or two.\r\n\r\nWhen you do log on to a new (previously unknown) computer, you can\r\nexpect to come face to face with something called a \"shell prompt\".\r\nShell prompts look like this:\r\n\r\n     %        (or some other obscure symbol, like a dollar-sign)\r\n\r\nor this:\r\n\r\n     mail>    (a favourite--means you're in some sort of mail program)\r\n\r\nor like this:\r\n\r\n     prez23:\r\n\r\n(means 23rd command since you logged into computer \"prez\").\r\n\r\nA prompt means the other computer expects you to type a command for its\r\n\"shell\", or \"command interpreter\".  The shell is the outer layer that\r\nyou, the user, interact with.\r\n\r\nTwo other types of \"user interfaces\" you might encounter are:\r\n\r\n  o  menu systems that give you choice of numbers\r\n\r\n  o  \"window\" systems or graphical user interfaces (GUIs, pronounced\r\n\"gooey\").\r\n\r\nMenu systems are popular on bulletin board services, and usually present\r\nno problem to the novice.  Their weakness is that they get cloying after\r\nabout five minutes.  Most menu systems that are designed to be used for\r\nthat length of time or longer have a \"command mode\", where you get--you\r\nguessed it--a shell prompt.\r\n\r\nEven windowing systems (you know if you have one of these) very often\r\ngive you a window that \"emulates a terminal\", i.e. that gives you a\r\nshell prompt inside.\r\n\r\nSo, you see, in each of the three common user interfaces--command line,\r\nmenu-driven, or graphical user interface--you will likely encounter, at\r\nsome time in your life, a shell prompt.  Advice on things that will\r\nlikely work to get you started is given here and in Appendix A.  Some\r\nexperience of other kinds of computers, especially computers that use\r\nthe UNIX operating system is useful.  Some tips about using UNIX and\r\nother operating systems you may not have encountered before is given in\r\nAppendix D.\r\n\r\nIf you do get stuck, whether by being experimental or just by accident,\r\nit is helpful to remember a few points:\r\n\r\n  o  You can always disconnect from a remote service by using your\r\ncommunications software to \"hang up\".\r\n\r\n  o  If the computer gives you a strange symbol like a percent sign or a\r\ndollar sign and just sits and stares at you, you can try \"help\" or \"?\"\r\nto try to find out what the computer expects, or else try \"exit\",\r\n\"quit\", \"bye\", \"logoff\", or something similar, to return to where you\r\nwere before.\r\n\r\n  o  Many times, when you log on to a system, you will get instructions\r\non how to get further help or how to \"escape\" back to your own system.\r\nYou should remember these or write them down!\r\n\r\n  o  As a last resort, exit the communications program (and all other\r\nactive programs) and shut off your computer, turn off your modem, and\r\ndisconnect it from the phone line.  Be sure to do these steps in the\r\norder prescribed.  It is unwise (though tempting) to simply turn your\r\ncomputer off and on, or to pull the plug on your modem with your\r\ncomputer running.\r\n\r\nMore suggestions for the inexperienced are given in Appendix A.\r\n\r\n\r\nThe final hurdle to using the Internet is that the world, even the world\r\nof the Internet, is indeed a very large place.  When using the Internet\r\nyou have to decide:\r\n\r\n  o  where to go;\r\n\r\n  o  what information you want (and where it might be); and\r\n\r\n  o  how to get to it (and get it back home intact).\r\n\r\nFor a system as vast as the Internet, these are hard decisions.  Often,\r\nthe only strategy that works is to explore and try different things.\r\nThis course is designed to get you over the initial hurdles, give you a\r\nfair grounding in methods that work, and point you in the right\r\ndirection.  The exploration is up to you.  As an initial orientation, we\r\ndescribe the \"three worlds of the known Internet\" in the next section.\r\n\r\n\r\n<Section 2.2>  The Three Worlds of the Known Internet\r\n\r\nThe Internet, like ancient Gaul, is divided into three parts.  These\r\nparts are not so much territories as worlds, each with their own sets of\r\nassumptions, favorite dialects, and favored equipment.  We may\r\nconveniently refer to them as the \"PC world\", the \"UNIX world\", and the\r\n\"Mainframe world\".  Here's a dossier on each of the three worlds:\r\n\r\n     World:  Personal Computer (PC)\r\n     Typical Equipment:  IBM PC and clones (85%) , Macintosh (15%)\r\n     Conventional Operating Systems:  MS-DOS, OS/2\r\n     Windowing Systems:  Windows, MacOS\r\n     Typical Size:  PC ($1k to $5k typical; few $100 used)\r\n     Clientele:  Mixed--Business, Home users, just about everybody\r\n\r\n     World:  (mostly UNIX) workstation\r\n     Typical Equipment:  Sun Workstation, VAXStations, other vendors\r\n     Conventional Operating Systems:  UNIX (two major dialects), VMS\r\n     Windowing System:  X Windows\r\n     Typical Size:  Workstation ($5k and up)\r\n     Clientele:  Engineering/Scientific users; more and more businesses\r\n\r\n     World:  Mainframe or Minicomputer\r\n     Typical Equipment:  IBM (various), Digital Equipment VAXes\r\n     Conventional Operating Systems:  VM, VMS, UNIX\r\n     Windowing Systems:  X Windows, if available\r\n     Typical Size:  Minicomputer or Mainframe ($10k to millions)\r\n     Clientele:  Big Business, Universities, Government\r\n\r\nThe neat picture of three worlds is distorted somewhat by a tendency for\r\neach of the worlds to have two (or a few) major options, either in\r\nchoice of equipment, operating system, or vendor.  So, for example, the\r\nPC world is split into two camps, the MS-DOS people and the Mac people.\r\nSimilarly, the UNIX world is split into the \"BSD\" workstations and\r\n\"System V\" (i.e. \"5\") workstations.\r\n\r\nThe three worlds are reflected somewhat in networking.  The Internet is\r\ndominated by minicomputers and workstations running UNIX and VMS, with\r\nan ever increasing influx of PCs running MS-DOS and Macs.  Machines\r\nrunning other operating systems often put a \"UNIX-like\" foot forward, so\r\nthe user can almost believe he or she is dealing with UNIX machines.\r\nThere is a certain sense that the UNIX software is the standard for the\r\nInternet.  Software tends to appear on UNIX machines first and then be\r\n\"ported\" to other machines.\r\n\r\nWhat makes it possible for all these disparate machines to talk to each\r\nother is the \"Internet Protocol\" (known more formally as TCP/IP, for\r\nTransport Control Protocol/Internet Protocol).  TCP/IP can be thought of\r\nas a set of rules for two computers to use when they communicate with\r\neach other, even if they are not from the same vendor.\r\n\r\nWe are used to thinking of computer systems as having \"software\" and\r\n\"hardware\", but it is closer to the truth to say that complicated\r\nsystems like the Internet have many levels--in the case of the Internet\r\nas many as seven--ranging from \"very software\" to \"very hardware\".  Each\r\nlevel has its own set of rules, called its protocol.  The TCP/IP\r\nprotocol belongs to two of the middle levels.  At the moment, the most\r\ncommon protocol for the two most \"very hardware\" levels is \"Ethernet\"\r\n(looks rather like the coaxial cable used for cable TV), while the \"very\r\nsoftware\" levels are completely dependent on the vendor.  In fact, it is\r\nthis profusion of levels which lets the Internet work on just about any\r\nkind of hardware and with software from many different vendors.\r\n\r\nAnyway, the Internet grew up as several medium-sized networks, all\r\nhaving diffent \"very hardware\" and \"very software\", but using the TCP/IP\r\nprotocol for their middle layers, were connected together.  Two of the\r\nfirst, and biggest, nets to adopt the Internet Protocol were ARPAnet--\r\nInternet was first designed for this one--the network for what used to\r\nbe called DARPA (the Defense Advanced Research Projects Agency of the\r\nU.S. Department of Defense), and NSFnet, a network connecting\r\nuniversities and government laboratories for the U.S. National Science\r\nFoundation.  These and other large networks form the \"backbone\" of the\r\nInternet.  But today there are hundreds of smaller nets hooked on to the\r\nbackbones.\r\n\r\nThere *are* big networks that don't use TCP/IP.  For example, in the\r\ncontext of IBM mainframes at large universities and research\r\ninstitutions, BITnet (The \"Because It's Time\" Network) emerged.  This\r\nlarge worldwide network does not use the Internet protocol.  BITnet can\r\nbe reached from the Internet through special translators called\r\ngateways, but it is definitely a different network.  Occasionally one\r\nencounters problems that can be traced to this fact.\r\n\r\n\r\n<Section 2.3>  The Future of the Internet\r\n\r\nThe future of any technology is difficult to forcast, and I do not\r\nprofess to know what the future holds for the Internet.  Some\r\npredictions that various forcasters have made for internetworking (and\r\ntelecommunications in general) are:\r\n\r\n  o  A proposal for a data \"superhighway\" called the NREN (National\r\nResearch and Education Network) will pass the U.S. Congress.  This is an\r\nupgrade for the Internet.\r\n\r\n  o  Commercial use of the Internet will become more common and new\r\nschemes for charging for its use will emerge.\r\n\r\n  o  The Internet will be handed by the government over to AT&T and the\r\nother \"telecoms\", who will charge so much to access it that the whole\r\nscheme will collapse.\r\n\r\n  o  Optical Fiber will replace Coaxial Cable (Ethernet protocol) as the\r\nmost common standard for LANs.\r\n\r\n  o  The Internet will enter the home over ordinary phone lines.\r\n\r\n  o  The Internet will enter the home over existing Cable TV coaxial\r\ncable.\r\n\r\n  o  The Internet will enter the home through newly strung optical fiber\r\nas part of a unified system for Telephony, Cable TV, and the data\r\ncommunication, using [insert your favorite protocol here] as a standard.\r\n\r\n  o  Personal Computers will replace telephones, answering machines,\r\nstereos, CD players, and VCRs--maybe even TV!--as a single, universal\r\ndevice for home use.  Sounds like a good thing to connect to the NREN.\r\n\r\n  o  Computer and telephone technology will become so intertwined that\r\nit is hard to tell the difference.  One product, already on the market,\r\nis described as \"[a handheld] alphanumeric pager, an XT-compatible\r\ncomputer with a backlit screen and PCMCIA Type III slot, a fax/modem, a\r\ncellular and land-line phone, and a voice recorder\"!\r\n\r\nYou are welcome to believe all or none of these predictions.\r\n\r\n\r\n<Chapter 3>  How Do I Connect To the Internet?\r\n\r\nConnecting to the Internet involves several steps:\r\n\r\n  (1) Getting your modem and communications software working together\r\n\r\n  (2) Connecting to a provider over the phone lines (or a LAN)\r\n\r\n  (3) Using Internet services\r\n\r\nFor the first step you will have to rely on the manuals that came with\r\nyour modem and software.  Appendix B contains a discussion of some of\r\nthe obscurer terminology associated with modem settings.  You might want\r\nto read it if your manual is not well written.\r\n\r\nActually, you do not have to know about the second step in great detail.\r\nMostly it is a matter of knowing enough to intellegently choose a\r\nprovider.  Each provider will have a specific set of steps--modem\r\nsettings, access numbers, passwords, etc.--that you need to follow in\r\norder to get from you to the provider.  Don't lose hope!  Once you get\r\nthere you've finished the hardest part.  Chapter 6 contains very\r\nexplicit instructions for connecting to one particular service, DELPHI.\r\n\r\nStep 3 is the subject of the rest of this course--what you can do once\r\nyou're on.  The basics are discussed in the next chapter.\r\n\r\n\r\n<Section 3.1>  Connection Methods\r\n\r\nIn theory, there are three ways to connect to the Internet from a\r\npersonal computer or workstation:\r\n\r\n  (1) Your PC may have a direct connection.  This means that it is part\r\nof a Local Area Network (LAN) that is in turn connected to one of the\r\ncomponent Wide Area Networks of the Internet.  Your computer will have\r\nits own Internet Protocol (IP) Address.  This type of connection is\r\ncommon in offices, especially of high-tech firms, but definitely not for\r\nhome use.\r\n\r\n  (2) You may have a connection to a \"host\" computer that is directly\r\nconnected to the net.  If you can use a modem to connect your home PC to\r\nthe mainframe at the office and the mainframe is on the net, then you\r\ncan get an Internet connection that way.  But what if your office\r\ndoesn't have a mainframe on the net?  You can still subscribe to a\r\nservice that makes a host computer available to the public.  This is\r\npresently the cheapest and most common method for public access to the\r\nnet.\r\n\r\n  (3) There is a connection method in between cases (1) and (2) called a\r\nSerial Line Internet Protocol (SLIP) connection.  You dial up a special\r\nhost computer--just like case (2)--called a SLIP-server.  The difference\r\nis that the SLIP server gives you a temporary IP address and talks to\r\nyour computer using the Internet Protocol.  This requires your\r\ncomputer's software to speak SLIP.  Your computer thinks it is using\r\ncase (1) even though your actual connection is closer to step 2.  The\r\nadvantage of fooling your terminal into thinking it has a direct\r\nconnection is that it can use all the fancy, free software developed for\r\ncomputers with direct connections.\r\n\r\nThe software for a SLIP connection is being built into all new\r\ncommunications software.  If you just bought or upgraded your software,\r\nyou probably have SLIP capability already.  The catch?  SLIP is too slow\r\non a cheap 2400 baud modem.  But if you buy a fast FAX modem it works\r\nfine.  That's one reason that a $350 FAX modem is a good investment.  It\r\nis fast enough for SLIP and gives you the ability to send and receive\r\nFAXes as well.\r\n\r\nSLIP technology is still rather new and somewhat experimental, so this\r\ndiscussion will focus on the old reliable--method 2.  How do you find a\r\nservice that will give the public access to the Internet?\r\n\r\nDepending on where you live, you may have a provider you can call in\r\nyour local area code.  If not, then most of your problem will be finding\r\nthe cheapest way to make a long distance phone call.  This book does not\r\nhave a list of providers, since such a list will get out of date\r\nrapidly.  Instead, it gives you one cheap way to get on the Internet,\r\nthen gives you instructions on how to find out who the providers are and\r\nwhat their rates are.  I would rather teach you how to look out for\r\nyourself than just give you some outdated advice.  This method also has\r\nthe advantage that one set of instructions works for everybody.  That\r\nwouldn't be true if I listed 20 or 30 providers.  Instructions are given\r\nin \"Gettin on the Internet Step by Step.\"\r\n\r\n\r\n<Section 3.2>  Types of Internet Providers\r\n\r\nAs I said, most of the problem of getting on the net occurs when you\r\nlive in an area that doesn't have a LOCAL provider.  Basically there are\r\nthree kinds of providers and three ways to get to them:\r\n\r\n  (1) Providers of direct connections.  If you are setting up a business\r\nand need a high volume direct connection for your office Local Area\r\nNetwork and can afford several thousand a year at least, you will want\r\nto consider these high-end providers.  They are not relevant to our\r\ndiscussion.  (But see Appendix C for more information).\r\n\r\n  (2) There are several regional networks and one national one that\r\nspecialize in low cost PC-to-host or SLIP connections.  Costs range from\r\n$20-40 a month to $2000 a year, depending on the services you need.\r\nPerformance Systems International (PSI) is a major provider of this kind\r\nof service.  Other networks offer services similar to PSI, although PSI\r\nhas the most extensive nationwide service at this time.  This service\r\ncan be very competitive with BBS type service (see below) if you are a\r\nfrequent user of the net or need to send more than an occasional E-mail\r\nmessage.  It is definitely worth a look.\r\n\r\n  (3) Many computer bulletin board services offer E-mail or even\r\nInternet connections for around $10-20 per month.  Be very careful to\r\ncheck out the connection charges.  If you are not careful you could be\r\ncharged for using the bulletin board (per hour), using the Internet, the\r\nlong-distance connection, a surcharge for daytime use, and a per message\r\ncharge for E-mail!  One of the purposes of this book is to explain the\r\nminefield of charges so you don't get burned.  The service recommended\r\nbundles all the charges up front so there are no surprises.\r\n\r\nGenerally speaking, connecting to the Internet through a BBS is the best\r\nmethod for the explorer.  Once you've determined that you need the\r\nInternet on a regular basis, one of the regional networks or PSI is\r\nprobably the most economical route.\r\n\r\nUnless you are fortunate enough to live in an area where an Internet\r\nprovider is a local call away, you will have to contend with long\r\ndistance charges.  Actually, these can be as low as $2 an hour and are\r\nsometimes bundled in with the network connection charge.\r\n\r\n\r\n<Section 3.3>  Finding the Cheapest Long Distance Method\r\n\r\nThere are three basic methods of paying for long distance:\r\n\r\n  (1)  You just pay for a call to another area code.  This is very\r\nexpensive and not recommended.\r\n\r\n  (2)  You use a provider with a toll free (800) number and pay for the\r\ncall in a higher connect charge.  This is also very expensive.\r\n\r\n  (3)  You use a Public Data Network after hours and pay around $2 an\r\nhour (may be included).\r\n\r\nActually, the last method is the only workable one.  There are a number\r\nof PDN's.\r\n\r\n  CompuServe has a data network.  You do not have to join CompuServe to\r\nuse it.\r\n\r\n  PSI has its own data network with many points of presence around the\r\nUS and abroad.  These are divided into Class A and Class B, depending on\r\nthe level of service provided.\r\n\r\n  Tymenet and SprintNet are two other public data networks.  You may\r\nhave heard of the SprintNet service PC Pursuit.  For a monthly fee this\r\ngives you many BBS nationwide as well as any computer that can be\r\nreached by SprintNet.\r\n\r\nIn general, for a first experiment we recommend the DELPHI BBS and\r\nSprintNet.  DELPHI includes the SprintNet surcharge in its $13/month\r\nbill (after hours use only--daytime is expensive everywhere).  At this\r\nwriting you get 5 free hours the first month and 4 hours per month after\r\nthat.  Additional hours are $4 each.  There is also a 20 hours for $20\r\nplan.  Additional hours are $2 each with this plan.  Detailed\r\ninstructions on how to sign up are given in \"Connecting to the Internet\r\nStep by Step.\"\r\n\r\n\r\n<Chapter 4>  Who Pays for the Internet?\r\n\r\nAll this talk of cost may be making you edgy.  Eventually, everyone\r\nusing the Internet must face the fear--if I am calling up a computer in\r\nSwitzerland won't I be billed for the call?  The marvelous thing about\r\nthe Internet is that although there is plenty of expense involved in\r\ngetting on it, there is no additional expense associated with what you\r\ndo after you are connected.  THE WHOLE WORLD IS ON LOCAL.  Thus, you may\r\nhave to pay for a $2 an hour call to Massachussetts, for your PC, your\r\nmodem and software, and a connect fee to your internet provider.  But\r\nyou DO NOT HAVE TO PAY FOR EACH AND EVERY INTERNET CALL.\r\n\r\nSince most people find it hard to believe that you can send mail\r\nanywhere in the world or dial up a computer on the other side of the\r\nglobe without paying a special charge, I will spend some time explaining\r\nwho does pay for the Internet and how those costs are reflected back to\r\nthe user.  One way or another you do pay for network usage, but these\r\npayments are not in the form of a direct billing for each call.\r\n\r\nFirst, you already know that there is no Internet, Inc. that monitors\r\nall the calls and bill customers.  Instead there are hundreds of smaller\r\nnetworks that act as relays.  Those networks *could* charge their\r\ncustomers for each call, based on how much time it takes and where it\r\ngoes, but since no one is charging them, they have no real incentive to\r\npass on costs.  Instead they charge a flat fee--usually based on connect\r\ntime, but for a 24 hour connection just a flat yearly fee.\r\n\r\nNow network traffic does use up resources.  Basically, the Internet\r\nworks like a potluck supper.  Everyone with a direct connection allows\r\nsome of their system resources to be used by messages that are just\r\n\"passing through\".  They allow this because other systems allow them the\r\nsame privilege.  Thus, it is in everyone's interest to allow some of\r\ntheir resources to be consumed by other persons' messages, because\r\neveryone comes out ahead.\r\n\r\nSo, sites with direct connections pay real costs in terms of lost\r\ncomputing cycles, extra cabling, fancier equipment, and lost disk space.\r\nThese costs are passed on to their customers or shouldered by government\r\nsubsidy.  But there are no direct charges associated with using the\r\nsystem.\r\n\r\nIn the early days of the Internet, Government subsidy of the backbone\r\nnetworks was crucial.  The backbone was built with government funds and\r\nit was government funds that paid for the extra equipment needed by the\r\nuniversities and laboratories that carried more traffic than they\r\ngenerated.  With the development of commercial nets alternatives to the\r\nGovernment-sponsored backbone arose.  The Government subsidy is still\r\nimportant, but becomming less so every year.\r\n\r\nSo, the short answer is that you pay for the network.  You either pay\r\nyour provider a flat fee or you pay as a taxpayer for Government\r\nsubsidized network resources.  Most of the cost you actually see will be\r\nin your own equipment, the cost of placing a phone call, and whatever\r\nyour provider charges you.\r\n\r\n\r\n\r\n<Chapter 5>  Internet Basics\r\n\r\nWe've talked a lot about the Internet, but how do you actually use it?\r\nThere are three basic skills on which all Internet use is based:\r\n\r\n  Electronic Mail (E-mail)\r\n\r\n  File Transfer Protocol (FTP)\r\n\r\n  Telnet\r\n\r\nAll three commands rely on the Internet addressing scheme.  An Internet\r\n\"telephone number\" of another computer is its Internet Protocol (IP)\r\naddress, a number that looks like this:\r\n\r\n     225.225.12.38\r\n\r\nThis form, called \"dotted decimal,\" is still required by some computers.\r\nBut, to make IP addresses easier for humans, this telephone number has\r\nanother form which is easier to remember:\r\n\r\n     hoople.usnd.edu\r\n\r\nThis means that computer (\"node\") named \"hoople\" is located at the\r\nUniversity of Southern North Dakota.  The last component, \".edu\", means\r\nthat the institution is in the educational domain.  .  Other domain\r\nnames look like this:\r\n\r\n  .edu : educational institutions\r\n\r\n  .gov : government (research laboratories and\r\n\r\n  .com : commercial businesses\r\n\r\n  .org : nonprofit organizations\r\n\r\n  .mil : military installations\r\n\r\nIn addition to these domain names, there are many two-letter country\r\ncodes, e.g.\r\n\r\n  .ca  : Canada\r\n\r\n  .jp  : Japan\r\n\r\n  .uk  : United Kingdom\r\n\r\n  .us  : United States\r\n\r\nand many more.\r\n\r\nTo send electronic mail to someone over the Internet, all you need to\r\nknow is their \"username\", or \"handle\".  This is followed by an at-sign,\r\nthe node name, and any domain names.  Thus\r\n\r\n     joe@locoweed.chi.il.us\r\n\r\ndonotes a private citizen in Chicago, Illinois, in the U.S.  Joe's\r\ncomputer is called \"locoweed\".\r\n\r\nAs another (real) example,\r\n\r\n     president@whitehouse.gov\r\n\r\nis the E-mail address of the U.S. President.\r\n\r\nIn the examples that follow we will give details for a typical\r\ncharacter-oriented computer.  Windowing systems with menus, dialog\r\nboxes, and so on will hide many of these details, but they are happening\r\nbehind the scenes.  Also, once you are connected, you may be faced with\r\nan old-fashioned command-line system.\r\n\r\n\r\n<Section 5.1>  Electronic Mail (E-mail)\r\n\r\nThe details of using the mail system depend on your system, but\r\nbasically it looks like this:\r\n\r\n     % mail   <enter the mail program with the MAIL command, or\r\nwhatever>\r\n\r\n     Welcome to Mail, Version 99.3 . . .\r\n\r\n     mail>  send\r\n\r\n     To:  president@whitehouse.gov\r\n     Cc:  vice.president@whitehouse.gov  <or return if you don't want a\r\ncarbon sent to anyone>\r\n     Subj:  I'm on Internet\r\n\r\n     Type your message.  Control-Z to exit\r\n\r\n     Bill--\r\n\r\n     I just got my Internet connection today.  My address is\r\n     pdq@hoople.usnd.edu.\r\n\r\n     Give my best to Al,\r\n\r\n       PDQ\r\n\r\n     <type control-Z or do whatever your system needs to signal an end\r\nof the message>\r\n\r\n     %   <your system is now ready for your next command>\r\n\r\n\r\n<Section 5.2>  Telnet\r\n\r\nIn addition to using an Internet address to send E-mail, you can use it\r\nto call a computer.  This is rather like dialing up a computer with a\r\nmodem, except that the local computer (the one you called with *your*\r\nmodem) is calling up the remote computer:\r\n\r\n     your PC or Mac  -->  \"local computer\"  -->  \"remote computer\"\r\n\r\nThe example assumes that \"home>\" is the shell prompt given by your local\r\ncomputer and that \"%\" is the prompt given by the remote computer (see\r\nSection 2.2 on \"shell prompts\").  So remember, you don't type them.\r\n\r\n     home> telnet hoople.usnd.edu   <type this on your \"home\" computer>\r\n\r\n     Welcome to node HOOPLE.  Now running Opus 2.0\r\n\r\n     username: pdq\r\n     password: <type your password here>\r\n\r\n     Last login 23:14:55 15-JUN-1752\r\n     You have mail.\r\n\r\n     %  <now type whatever commands you like until . . . >\r\n\r\n     % logoff <or bye or quit or exit or whatever>\r\n\r\n     Session with hoople.usnd.gov terminated at 21:19.\r\n\r\n     home>  <now continue issuing commands on your home computer>\r\n\r\nThis method of connecting to another computer is called \"telnetting\".\r\nIn effect, you have used the local computer to telephone the remote\r\ncomputer.  You can now do anything on the remote computer (with certain\r\nrestrictions) you could do if you were \"actually\" logged on.\r\n\r\n  SPECIAL PROBLEMS WITH TELNETTING\r\n\r\nSometimes telnetting will put you into a menu-type program or even a\r\n\"screen oriented\" program.  A special problem here is getting the other\r\ncomputer to recognize what type of screen you have.  Since most\r\ncommunications software \"emulates a terminal\", this amounts to telling\r\nthe other system what type of terminal your communications system is\r\nemulating.\r\n\r\nE.g., on a UNIX system you might type:\r\n\r\n     % set term vt100\r\n\r\nto tell the other system that your communications software thinks it is\r\na VT100 terminal (a very common choice for emulation programs).\r\n\r\nIf you don't get this exactly right, your telnet session will \"sort of\r\nwork\".  It's probably not worth spending a lot of time on this problem\r\nfor a brief contact with the other computer.  If you are going to work\r\non the remote computer every day, however, you will want to get it\r\nright.  Most \"flaky\" behavior can be traced to this problem.\r\n\r\n\r\n<Section 5.3>  File Transfer Protocol (FTP)\r\n\r\nIt is easy to transfer files over the Internet using a special protocol\r\ncalled FTP.  FTP takes the place of programs like XModem or Kermit that\r\nmay be familiar to you if you use a bulletin board service.  Now, you\r\nmight ask, if FTP transfers a file, what is the differnce between\r\nsending E-mail and FTP; why prefer one over the other?\r\n\r\nFirst of all, FTP avoids certain restrictions on the type of file sent;\r\nin particular, you can send binary (non-text) files like programs and\r\npictures; and you are not restricted to any particular length, as is\r\noften the case with mail programs.\r\n\r\nNot only that, with FTP you can \"browse\" a directory of files before\r\nchoosing one.  You can move up and down the directory hierarchy and list\r\nfiles, looking for the one you want.\r\n\r\nFinally, FTP lets you get places that you may not have an account (or a\r\nfriend to send you mail).  The method for doing this, called \"anonymous\r\nFTP\", is described in the next section.  There are several hundred\r\n\"anonymous FTP sites\" worldwide, with large collections of programs,\r\ntextfiles, and graphics.  Anonymous FTP is the Internet equivalent of\r\npublishing--a very important topic indeed.\r\n\r\n\r\n<Section 5.4>  Anonymous FTP\r\n\r\n\r\nFurther facility with Anon. FTP requires a little knowledge of the UNIX\r\noperating system.  See Appendix D for an introduction.\r\n\r\n\r\n\r\n<Chapter 6>  Getting on the Internet Step by Step\r\n\r\nThis course takes a different approach to .  Rather than\r\n\r\nIn particular, you should contact the following for information.\r\n\r\n\r\nSTEP 1.  SIGN UP WITH A PROVIDER (example DELPHI)\r\n\r\nTo get on the Internet you need:\r\n\r\n  1.  a home computer,\r\n\r\n  2.  a 1200 or 2400 baud modem that understands AT commands (\"Hayes\r\nCommand Set Compatible\"),\r\n\r\n  3.  communications software, and\r\n\r\n  4.  a credit card.\r\n\r\nThis example assumes that you are signing up with the bulletin board\r\nservice DELPHI.  DELPHI has no commercial relationship with the author.\r\nIt was chosen for an example because its rates are typical of the low\r\nend of the market, it offers nationwide service, it includes afterhours\r\naccess by SprintNet in its basic fee, and because at this time it offers\r\n5 free hours of Internet access to new subscribers.\r\n\r\nYou should definitely consider other providers.  You can get information\r\nabout other providers once you're on the Internet.  In fact, that will\r\nbe one of your first steps below.\r\n\r\n  1.  Set your modem to 2400 (or 1200) baud, 8 bits, NO parity, 1 stop\r\nbit, full duplex, local echo and auto linefeeds off, XON/XOFF on, VT100\r\nemulation.  (see the manual for your modem, the manual for your\r\ncommunications software, and Appendix A if you need help)\r\n\r\nDon't worry if some of the options are missing.  Usually, for example,\r\nfull duplex implies local echo off and vice versa, so your software may\r\nnot list these as separate options.\r\n\r\n  2.  Use your communications software to issue (or type directly to\r\nyour modem) the command ATDT 1 800 365 4656.  If you have a pulse-dial\r\nphone your will use ATDP instead of ATDT.\r\n\r\n  3.  DELPHI will give you explicit instructions, but for reference they\r\nwill look like this:\r\n\r\n    A.  Make sure it is after 6 or 7 p.m. or on a weekend--unless you\r\nwant a $9 surcharge for daytime access.\r\n\r\n    B.  Dial your local SprintNet access number (local call!):  ATDT 123\r\n4567.\r\n\r\n    C.  After \"CONNECT 2400\", type @D (\"D\" must be capital)\r\n\r\n    D.  After \"terminal=\" type <CR>, i.e. carriage return.\r\n\r\n    E.  At the @-sign type\r\n\r\n        @C DELPHI\r\n\r\n    F.  After Username: type\r\n\r\n        Username:  YOURNAME\r\n        Password:  OPENSESAME\r\n\r\nType your own username and password of course.\r\n\r\n\r\n  4.  If at anytime you forget your Sprintnet access number, or if you\r\nare out of town, you can look up SprintNet numbers as follows.\r\n\r\nSTEP 2.  Your First E-mail\r\n    Get PDIAL, NIXPUB, INTERNET RESOURCE GUIDE, Info on PSI\r\n    Info on LISTSERV and signing up for E-mail\r\n\r\nSTEP 3.  Your First Anonyomous FTP\r\n\r\n    Get surfing the internet\r\n\r\nSTEP 4.  Your First Telnet\r\n\r\n    Getting Public Access UNIX and reading Usenet news\r\n\r\n\r\nSTEP 5.  First E-mail\r\n    Getting Information on PSI\r\n    Getting Information on LISTSERV\r\n\r\nYou can do many, many things with the Internet.  The information you\r\nhave retrieved, especially the Internet Guides, will give you other\r\nideas.  We will go over some of the retrieval methods in Part III of\r\nthis course.  For now, you should experiment and explore, using the\r\ninformation you have as a starting point.  The experience you gain will\r\nbe useful when we come to the more systematic study of Internet research\r\nmethods later.\r\n\r\n\r\n\r\n<Chapter 7>  Programs and Pictures\r\n\r\nEvenually, as you gain experience finding and transfering information,\r\nyou will want to try you hand at transferring binary files containing\r\npictures or free software from one of the large FTP archives like\r\n\r\n  wustl.edu\r\n\r\n  sumex-aim.stanford.edu (Macintosh software)\r\n\r\n  simtel-20.mil (IBM and compatible software)\r\n\r\nIn fact, some of the first software you will want to get is software for\r\ncompressing and uncompressing files (see next Chapter), processing\r\ngraphics (\"image files\"), and perhaps some games.\r\n\r\nFirst, what is a binary file?  A binary file is one that you can't read.\r\nUnlike text, which consists of groups of eight bit code letters\r\nrepresenting \"a\", \"b\", and so on, binary files have bits that are meant\r\nto be read only by programs.  You cannot \"look\" at them by typing them\r\nout or with a word processor--unless the word processor understands the\r\nformat of the file.  Expensive word processing programs--including the\r\nmost popular ones like Word Perfect and Microsoft Word--are increasingly\r\nable to read a large variety of binary files.\r\n\r\nFrequently encountered binary files include:\r\n\r\n  1.  Files that use proprietary formats, such as word-processing\r\nprograms, spreadsheets, database programs, etc.  These files contain\r\nformatting (like italics, underlines, etc.) and perhaps graphics, and\r\nother goodies beyond the simple text.\r\n\r\n  2.  \"Application Programs\".  These are programs written in (the\r\nbinary) machine language that your computer understands.  They are\r\n\"compiled\" from text files of \"source code\" written in a programming\r\nlanguage.  Vendors almost never make their source code available--except\r\nfor free software, which you may have to compile yourself.\r\n\r\n  3.  Text files that have been compressed to about half their size with\r\none of the popular compression programs.  Compression makes texts files\r\nbinary.  Compression doesn't do much for files that are already binary\r\nunless the data they contain is very repetitive.\r\n\r\n  4.  Files containing graphics like GIF, TIFF, PICT, or JPEG files.\r\nMore on this below.\r\n\r\nTransfering binary files is as easy as transfering text files once you\r\nunderstand the potential problems:\r\n\r\n  1.  Most FTP programs start you out in TEXT mode.  This means that\r\ntext files are *translated* when they go from computer to computer on\r\ntheir way to you.  This is fatal to binary files because their bit\r\npattern has nothing to do with the groups of eight bits that make up\r\ntext.\r\n\r\n  2.  Even text files have slight compatibility problems because the\r\nthree \"worlds\"--IBM, Macintosh, and UNIX--use a different control\r\ncharacter to represent \"return\", \"enter\", or \"newline.\"  Translation\r\nbetween the different dialects is handled automatically in TEXT mode\r\ntransfers.  It is also the main reason why text files cannot be\r\ntransfered in BINARY mode.\r\n\r\nThe two control characters involved are called \"linefeed\" (LF) and\r\n\"carriage return\" (CR):\r\n\r\n     IBM PC and compatibles : <LF> <CR>\r\n\r\n     Macintosh and VAX : <CR>\r\n\r\n     UNIX : <LF>\r\n\r\n  3.  As mentioned above, text files are often compressed to save space.\r\nThis means that you need a program to uncompress them before you read\r\nthem--and that you have to transfer them in BINARY mode.\r\n\r\nThe most common compression programs and common file extensions are:\r\n\r\n     IBM PC and compatibles : PKZIP and PKUNZIP (.ZIP)\r\n\r\n     Macintosh : Stuffit and UnStuffit archives (.sit)\r\n\r\n     UNIX : compress and uncompress (.Z) and tape archive (.tar) with\r\nboth together being most common (.tar.Z or .taz).  Note capital \"Z\".\r\n\r\nUNIX also has the gzip/gunzip command pair.  gzip files usually have the\r\nextension \".z\" (*small* z) or \".tgz\" if they are also tape archive\r\nfiles.\r\n\r\nFortunately you can usually find free software for you computer that\r\nwill uncompress formats from other computer models.  For current\r\ninformation on compression software, see the FAQ for the newsgroup\r\ncomp.compression (ftp://rtfm.mit.edu/xxx).\r\n\r\n  4.  Conversely, sometimes binary files are converted to a sort of\r\nASCII that looks like gibberish so that they can be mailed or\r\ntransferred in TEXT mode--but again you need a program that translates\r\nthem back to binary.  Sometimes we encounter the ultimate absurdity, a\r\ntext file that is compressed then re-encoded as ASCII for mailing.\r\nActually this makes sense if a large number of related text files are\r\nstored in a compressed \"archive\".\r\n\r\nThe most common programs for this are:\r\n\r\n     uuencode/uudecode for UNIX (used for Usenet news postings of binary\r\nfiles and for mailing programs)  The file extension (rarely encountered\r\nbecause there is little reason to store files in this format) is \".uue\".\r\n\r\n     BinHex for the Macintosh (.hqx)  Often combined with Stuffit\r\n(.sit.hqx).  This is a common method for distributing all the files that\r\ncome with a program as a single file.\r\n\r\nuuencoded files can be recognized by the fact that every line begins\r\nwith a capital \"M\" and is exactly the same length.  The file starts with\r\nthe word \"begin\" and ends with \"end\"  The translating program needs\r\nthese words, but nothing above or below them.  Often a uuencoded file is\r\nsplit into several parts for transmission and must be reassembled (and\r\nstripped of mail headers, etc.) in a word processing program before it\r\nis decoded.  If you do this be sure to save the resulting file as a text\r\nfile and not in the proprietary format of the word processing program!\r\n\r\n\r\n<Section 7.2>  What To Do With Graphics\r\n\r\nThe second topic of this chapter is graphic images.  Graphics are very\r\nimportant for Desktop Publishers--writers of newsletters, businesses\r\nthat prepare their own brochures, and small printshops.  Pictures can be\r\nstored in separate files or, in some cases, embedded in other formats\r\nsuch as the proprietary format of Microsoft Word files.  Picture files\r\ntake up a large amount of space--especially big pictures at high\r\nresolution.  1 Megabyte is a typical size for a smallish picture at\r\nmoderate resolution.  Thus, one picture is worth about 500 pages of\r\ntext!\r\n\r\nThe lifecycle of a typical graphic goes something like this:\r\n\r\n  STEP 1.  Capturing (scanning) of photograph with optical scanner or\r\nwith a special \"video\" camera\r\n\r\nThe better sort of optical scanner looks like a small xerox machine.\r\nThere are also cheaper hand-held models.  Flatbed scanners cost in the\r\n$1000+ range so you are not likely to have one unless you are in the\r\nbusiness.  Most likely, the casual user will get a graphic from someone\r\nelse, from a collection of \"clip art\", or create the graphic from\r\nscratch in a drawing program.\r\n\r\n  STEP 2.  Storage in a file using an interchange format\r\n\r\nHowever the image is obtained, it has to be stored on disk before it can\r\nbe used.  There are perhaps twenty or so common formats, but those found\r\nmost often on the Internet and in the Usenet newsgroups are:\r\n\r\n     GIF (Graphics Interchange Format) a rather old-fashioned but very\r\ncommonly found type of graphics file.  Almost any software can read this\r\nformat.  This is the most common format on Anonymous FTP archives.\r\n\r\n     TIFF (Tagged Image File Format)  Technically more versatile than\r\nGIF and just about as common.  A very good choice for exchanging files\r\nbetween different programs.\r\n\r\n     JPEG () A special compressed image format that is becoming common\r\nin newer software.\r\n\r\n     EPS (Encapsulated PostScript)  Not really a graphics file per say,\r\nbut a set of instructions for drawing an image.  The success of the\r\nPostscript page description language for Laser printers has led to a new\r\nstategy for including graphics in word processing files.  Many high end\r\nword processing programs like Microsoft Word allow you to include a\r\nreference to an external Postscript file containing the figure.\r\n\r\nDesktop publishing and high-end word processing programs can often save\r\nand import graphics in any of these formats, especially TIFF and EPS.\r\n\r\nIn addition, you may find files in proprietary formats like Macintosh\r\nPICT files.  These formats serve as standards for their line of\r\ncomputers but not across different brands.  Fortunately you can find\r\nfree software that will convert TIFF to PICT or _vice versa_.\r\n\r\n  STEP 3.  Transmission to point of use\r\n\r\nSuppose you have a graphics file or a word processing file containing\r\nyour brochure.  How do you send that file to someone?\r\n\r\nIf you work in an academic environment, it is quite possible that one or\r\nthe other institutions is an Anonymous FTP site.  You may be able to use\r\nthe Anon. FTP site as a \"mailbox\" to transfer the file in binary mode--\r\nor you could exchange passwords and transfer the file directly, if both\r\nhave a direct connection to the Internet.\r\n\r\nMore commonly, you will have to send the file by E-mail.  Say you've\r\njust finished a brochure and you want to send it cross-country.  Let's\r\nsuppose that your business has two branches--one in New York and one in\r\nLos Angeles, and that both offices have Macintoshes with Microsoft Word\r\nand that you both have one of the free \"Usenet software kits\" for the\r\nMacintosh (not necessarily the same one).  Then, you proceed as follows:\r\n\r\n  A.  Using UUENCODE (or BINHEX, if you like) you convert the Microsoft\r\nWord file to a coded text file.\r\n\r\n  B.  If your mail has a size limit, you may have to break up the file\r\nand send it in parts.\r\n\r\n  C.  At the receiving end, reassemble the file and strip any headers\r\nand trailers added by the mail system.  The file should look like\r\n\r\n     begin  <very first line>\r\n     M\r\n     M\r\n     M\r\n\r\n\r\n     M\r\n     end  <very last line>\r\n\r\nand be saved as a TEXT file.\r\n\r\n  D.  Run UUDECODE (or BINHEX) and recover the binary file.\r\n\r\n  E.  Run Microsoft Word, open the binary (MS Word!) file and print.\r\n\r\nThere may be one slight glitch.  Macintosh files have two parts, a\r\n\"resource\" part and a \"data\" part.  The resource part contains such\r\ninformation as the name of the application to run when you click on the\r\nfile and how to draw the cute little icon pictures.  Some of the simpler\r\nprograms do not encode the resource part so you may get a generic\r\ndocument that you can't open by clicking on it (the infamous\r\n\"application busy or missing\" message).  That's OK.  Open it from\r\n*within* Word and then save it as a Word document.  It should recover\r\nthe missing parts.  And get smarter software.\r\n\r\nCertainly this procedure is complicated--and you might want to do a dry\r\nrun before you try beating a 5 o'clock deadline--but the capability of\r\ntransfering a computer file cross-country in seconds can be crucial to a\r\nbusiness.  The fact that it can be done with free software and a casual\r\n$10/month E-mail connection is astounding.  Play around and learn to do\r\nthis.  In the future, printers may commonly accept submissions by E-mail\r\nor by direct transfer over telephone lines.  Imagine not having to\r\nfigure out how to keep your camera-ready copy dry on a rainy day or\r\nhaving to rush across town minutes before your deadline!\r\n\r\n  STEP 4.  Image enhancing and/or color separation\r\n\r\nOne of the great advantages of having a graphic in a computer file is\r\nthat you can use free software (or shareware) to play around with the\r\nimage.  Cropping, rotating, streching, zooming, and so on are all\r\ncommon.  In addition, you can convert color to black and white or\r\ngreyscale, enhance the image, make halftones or color separations, and\r\neven play with the spatial frequency spectrum if you want.  (Color\r\nseparations are the four images needed by printers--separate ones for\r\nCyan, Yellow, Magenta, and Black ink).\r\n\r\n  STEP 5.  Importing or embedding in a word processing or desktop\r\npublishing program\r\n\r\nOnce you are happy with the picture you import it as a graphic into your\r\nDTP or word processing program.  If your program reads the format the\r\npicture is in, this is easy.  If not, you will need to get free software\r\nthat converts from the format you have to the one you need.  This\r\nprocess is very experimental.  I've found that I have better results\r\nconverting from an obscure format to a standard and common format like\r\nGIF or TIFF before converting to a proprietary target format.  This is\r\neven true if the software says it reads the obscure format directly.\r\n\r\n  STEP 6.  Printing on a laser printer or other equipment\r\n\r\nIf a graphic is not solely intended for display on a (color) monitor,\r\nlike a slide presentation, it must be printed out.  And there it is.\r\nYour picture in print.\r\n\r\n\r\n\r\n<Chapter 8>  What to Do When You Only Have E-mail\r\n\r\nThe very first thing to do is to get information on getting a better\r\nInternet connection!  But barring that, there are many reasons that you\r\nmight need to know workarounds that only require E-mail:  you might be\r\nstuck somewhere (like work) where there is no Internet access, or you\r\ncould be borrowing access from a friend.  Since Internetworking is about\r\ncommunicating with others, in many ways this is the most important\r\nchapter in this course.\r\n\r\nFirst we consider methods for\r\n\r\n\r\n<Section 8.1>  FTP by Mail Servers\r\n\r\n\r\n<Section 8.2>  Archie by Mail\r\n\r\n\r\n<Section 8.3>  Mailservers and Fileservers\r\n\r\n\r\n<Section 8.4>  Mailing lists and how to find them\r\n\r\n\r\n<Section 8.5>  E-mail to FAX\r\n\r\nFax is not a useful as E-mail, except in regard to one thing.\r\n\r\n\r\n<Section 8.6>  The Top Ten Fun Things to Get by E-mail List\r\n\r\nNow that you know the techniques, try getting some of the things on the\r\n\"Top 10\" list, in Appendix E.\r\n\r\n\r\n<Chapter 9>  Employee Development:  How to Get Your Employees\r\nInternetworking\r\n\r\nThis short Chapter contains a little advice on how to learn about the\r\nInternet.  It should be clear from the preceding Chapters that learning\r\nhow to use the Internet is a survival skill for many businesses.\r\nEffective use of the electronic medium\r\n\r\n  o  Saves employee time--time lost in phone tag, lost messages, and\r\nthey three day time delay of surface mail.\r\n\r\n  o  Avoids circuitous means of transfering data like printing a\r\ndocument, faxing it, and then rekeyboarding the data at the receiving\r\nend\r\n\r\n  o  Allows businesses and individuals to self-publish, and distribute\r\ntheir work efficiently, whether or not the text or the graphical\r\nappearance is primary.\r\n\r\n  o  Provides access to information, allows communication and\r\ndistribution of documents in a single, uniform fashion.\r\n\r\nIt should also be clear that Internetworking is not yet a smooth, easily\r\nlearned process.  It requires knowledge and skills that are not\r\npresently taught anywhere except on the Internet itself.\r\n\r\nThe next section discusses specific needs of different segments of\r\npeople.  The final section contains a fairly systematic exposition of\r\nthe methods and skills needed to Internetwork effectively.  But far from\r\nrepresenting these sections as the last word on the subject, I would\r\nlike to stress that the only way to learn Internetworking is through\r\nundirected exploration of the Internet.\r\n\r\nThis means you have to let your employees play, at least on their own\r\ntime:  play with programs, play with Anonymous FTP, and play with Usenet\r\nnews.  None of these activities are directly productive, but the playing\r\npays off when you need a new program and someone in your office can\r\n\r\n     o  pick the right Usenet newsgroup and retrieve its FAQ\r\n\r\n     o  read the FAQ and learn about free software that will solve your\r\nproblem and where to find the latest version\r\n\r\n     o  connect to the software archive and (correctly) transfer the\r\nprogram--even though the intervening machine is of the \"wrong\" make.\r\n\r\n     o  properly decompress and install the software.\r\n\r\nWhen all this is done competently, in less than half an hour, you will\r\nhave attained the goal of employee development.\r\n\r\nA final caveat:  *don't neglect Usenet news.*  Usenet news is the most\r\ndifficult of the \"Internet basic services\" to get because it is not\r\nreally an Internet service.  It is commonly found on Internet computers\r\nand commonly transmitted over the Internet, but it does not fit into the\r\nE-mail-FTP-telnet scheme of things.  If your Internet provider does not\r\nprovide the news, you may have to ferret it out by (1) getting an\r\naccount on a public access UNIX system and (2) learning to use UNIX.\r\nCommand-line UNIX is no easier than command-line MS-DOS, but it is worth\r\nlearning how to get on a UNIX system for the \"rn\" (readnews) command\r\nalone.  All you need to know to get that far (and more) is contained in\r\nAppendix D.\r\n\r\nAny guide like this will soon be dated in terms of information sources,\r\ntechniques, and software.  But Usenet is up to the minute.  There,\r\nhidden among the many diversions of alt., talk., and soc. hierarchies,\r\nis the latest information on the computing environment of modern\r\nInternetworking.  In the opinion of this author, learning to use a\r\nnewsreader and reading the network news regularly is the *single most\r\nimportant Internetworking skill*.  The Usenet newsgroups are Dewey\r\nDecimal System of the the true world library.  Information can be found\r\nin plenty elsewhere, but guides to information are rare and priceless--\r\nand the Usenet news is the guide to the Internet.\r\n\r\n\r\n\r\n<Part II>  Special Concerns\r\n\r\nThis Part lists briefly some of the ways in which various groups of\r\npeople can use internetworking skills.\r\n\r\n\r\n\r\n<Chapter 11>  Special for Businesses\r\n\r\nI wish I had better news for business use of the Internet.  I wish I\r\ncould describe hundreds of free services of interest to *business* and\r\ntell you how to use the Internet for profit.  But it's not there yet.\r\nHowever, before you turn away with a sad but knowing smile on your face\r\nshaking your head over another unlikely technological dream--you've seen\r\nit before--consider this:  the main potential of the Internet is as a\r\ncommunication medium.  Is radio and television important to businesses?\r\nWhat about newspapers and magazines?  Or direct mail?  Very few\r\nbusinesses make money by selling newspapers or operating radio stations,\r\nbut many, many businesses use these media for advertising.  You and your\r\nemployees need to become adept at using this medium for the same reasons\r\nyou've mastered layout of newpaper ads and writing form letters.\r\n\r\nIt is very important to understand that the Internet is not a broadcast\r\nmedium but more like the telephone or mail system.  It specializes in\r\ncontacting individuals one at a time.  In other words, you are not going\r\nto get a list of all 25 million E-mail addresses and bombard them every\r\n10 minutes with a 30 second sound byte.  Nor are you going to send 100\r\npeople a letter asking them to contact 100 persons each.  On the other\r\nhand you might use the medium to contact a mailing list of your\r\ncustomers or self-publish a promotional brochure.\r\n\r\nThe amount of commercial traffic on the Internet is disappointingly\r\nsmall--but important.  Mostly this is for historical reasons.  The\r\nbackbone network in the United States, NSFnet (for National Science\r\nFoundation) has an \"acceptable use\" policy for traffic carried over it.\r\nThis restricts traffic to messages that support the R&D effort of\r\ncertain government laboratories and universities.  Clearly, there is\r\nnot room for commercial traffic if you are directly connected to the\r\nNSFnet.\r\n\r\nBut nowadays one can get on the Internet without connecting directly to\r\nNSFnet, and the amount of commercial traffic is growing.  Don't\r\noverlook:\r\n\r\n  o  Making product information and brochures available by E-mail as\r\nwell as by the postal service.\r\n\r\n  o  Allowing customer-support inquiries by E-mail.\r\n\r\n  o  Starting a mailing list for your customers or clients.\r\n\r\n  o  Setting up a \"mail-server\" to let clients get information about\r\nyour product automatically, without having to wait for you to log on\r\n(required direct connection to the Internet).\r\n\r\n  o  Putting your product information on an anonymous FTP server\r\n(requires that you have a fileserver on the net or find an FTP site\r\nwilling to take the information).\r\n\r\nSuprisingly, there are, to my knowledge, no pay-for-advertising services\r\nthat support mailservers or anonymous FTP sites.  It is a fair\r\nprediction that this advertising medium will develop as more persons\r\njoin the net.  You could put your information on bulletin boards, of\r\ncourse, but only members will see it there--not the 25 million people\r\nwith E-mail access.\r\n\r\nThe fact remains, however, that unless you are in very specific\r\nindustries that are information or paper intensive (say publishing,\r\ncomputing, information retrieval, and so on), or unless you need access\r\nto government information like weather maps, that your use of the\r\nInternet will consist of downloading programs or getting the latest\r\ntechnical information.\r\n\r\nAll of this overlooks the most important aspect of the Internet for\r\nbusinesses.  The Internet is evolving very rapidly.  It is likely to be\r\nan important medium for transacting business, for customer service and\r\nfor advertising in the very near future no matter what industry you are\r\nin.  For some industries, like publishing, high-technology industries,\r\nand the media, it will be critical.  Businesses who have a pool of\r\nemployees that are adept at using the Internet will have a competitive\r\nadvantage over firms that don't.  Thus you should encourage your\r\nemployees to get personal Internet connections and learn about the\r\nInternet after hours.\r\n\r\n\r\n\r\n<Chapter 12>  Special for Students and their Parents\r\n\r\nSince the Internet grew up in an academic environment, university\r\nstudents will likely have a level of access that would be the envy of\r\nany business.  All the services and research tools--not just E-mail,\r\nFTP, and telnet, but gopher, WWW, WAIS, and the rest are likely to be\r\navailable to students from any terminal on the local \"cluster\" or by\r\ndial-up from their dorm rooms.\r\n\r\nStudents will be especially keen on:\r\n\r\n  o  checking the university library catalogue to see if a book is in\r\nbefore walking to the library.\r\n\r\n  o  finding out about campus events (even at other universities!)\r\nthrough gopher or school bulletin boards\r\n\r\n  o  posting buy and sell notices for computer equipment, cars, housing,\r\nand so on.\r\n\r\n  o  contacting potential tutors either at their own university or for\r\nhelp by E-mail.  (A netwide \"university\" of tutors, called Usenet\r\nUniversity, is prepared to answer questions in various subjects by E-\r\nmail already exists in the Usenet newsgroups.  See the alt.uu.*\r\nhierarchy).\r\n\r\n  o  using online catalogues of other university libraries to find books\r\nfor interlibrary loan or to compile bibliographies\r\n\r\n  o  downloading free software and information\r\n\r\n  o  finding scholarship information\r\n\r\nParents can communicate with their children at college by E-mail--and\r\nprobably get a faster response than waiting for the occasional letter\r\nfrom home.  Worried parents will have to refrain, however, from using\r\nthe \"finger\" command to find out when their children last logged in or\r\nread their mail!\r\n\r\n\r\n\r\n<Chapter 13>  Special for Writers, Journalists, Publishers, and Printers\r\n\r\nThere is probably no industry for which information is so critical as\r\nfor the media and publishing industries.  Journalists who explore the\r\nnetworks will find that they use the tools described in the first part\r\nover and over to track down information, conduct prompt \"interviews\" by\r\nmail, and so on.  Publishers will be interested in the electronic\r\ntransmission of manuscripts (though writers soliciting publication will\r\nstill want to send hardcopy--the equivalent in the electronic age of\r\nsending a self-addressed stamped envelope).  Publishers will also be\r\ninterested in sharing or developing free image processing software with\r\nother publishers, and transmitting graphics.\r\n\r\nAs the net develops, libraries research will more and more often involve\r\ninternetworking.  Searching for books is already easy by dial-up or over\r\nthe Internet.  In addition, the amount of information that is never\r\ncirclulated on paper will increase.  This is already the case in the\r\nscientific and technical community where printing is a luxury rather\r\nthan a necessity.  Given that a single 8 mm videotape can hold 500,000\r\npages of text, it is possible to hoard (and search) vast amounts of\r\ninformation that you can never possibly print out.  Imagine what such\r\ntechnology will do in the hands of Government or any other bureaucracy.\r\nFinally, it is not hard to image the day when an editor will receive as\r\nmany press releases by E-mail as through the postal service.\r\n\r\nInternetworking technology allows virtually any business or individual\r\nto set up and run their own \"wire service\", providing information about\r\ntheir business or special interest to a select group of subscribers.\r\nThis capability is completely analogous to Desk Top Publishing, which\r\nput low-end printing in the hands of any business or individual.\r\n\r\nJournalists and other writers will not want to overlook the\r\nkaleidascopic mixture of technical discussion, product announcements,\r\ngossip, and general ranting on Usenet.  Usenet already has more channels\r\nthan a typcial satellite and is growing by ten channels a day or so.  It\r\nis hard to find, but tucked in among the chit-chat and programs is the\r\nonly up to the minute information on the Internetworked World.\r\nCertainly all writers of scientific or technical columns will want to\r\ntap this source of information.\r\n\r\n\r\n\r\n<Chapter 14>  Special for Elementary and High School Teachers\r\n\r\nThere are many special Internet services for Elementary and Secondary\r\nSchool teachers provided by the Government, mostly through the education\r\noffices of research laboratories.  The best all around refernce for\r\nteachers is the _NCSA Guide to the Internet_, put out by the Education\r\nOffice of the National Center for Supercompter Administration.  A paper\r\nversion is available from:\r\n\r\nThe network version is located at ftp.ncsa.uiuc.edu.  Unfortunately, it\r\nis available only in Microsoft Word format (requires binary transfer).\r\nIf you are unable to use this format directly or convert to a format you\r\ncan use, you will have to order the paper version.\r\n\r\nThe NCSA Guide covers all you need to know to connect to the Internet--\r\nboth technical details and etiquette--as well as suggested projects to\r\nintroduce children to the net.  You will find out how to get information\r\nabout the space program or how to access such programs as the Newton\r\nBulletin Board Service for Science and Math. teachers at Argonne\r\nNational Laboratory.\r\n\r\nIn addition, Usenet has a k12.* hierarchy which provides a gateway to\r\nthe K12 network.  Besides K12, there are several other regional networks\r\nspecifically for teachers and students.\r\n\r\nOne of the more exciting prospects for teachers is that of sharing\r\nworksheets, handouts, and other materials with other teachers.  Although\r\nthis type of sharing is routine on bulletin boards and regional networks\r\nthat cater to teachers, anonymous FTP sites hold out the possibility of\r\na worldwide collection of such materials.  Send contributed materials\r\n(in electronic format) to\r\n\r\n     ftp.cs.city.ac.uk:/freelore/incoming\r\n\r\nby following the instructions in Chapter xx for sending a file by\r\nanonymous FTP, or mail a floppy disk (and a return mailer with prepaid\r\npostage, if you want it back!) to\r\n\r\n     The FreeLore Project\r\n     P.O. Box 6022\r\n     St. Charles, IL  60174.\r\n\r\nMake sure your materials have a copyright notice like this course,\r\nallowing anyone to copy and distribute them for free (for educational\r\npurposes).\r\n\r\n\r\n\r\n<Chapter 15>  Special for Librarians\r\n\r\nFor many years, of course, libraries have been among the heaviest users\r\nof information services--for cataloguing or to fill patron requests.\r\nSeveral companies now specialize in providing Internet access to\r\nlibraries, e.g. ACCESS or DRAnet.  Libraries will increasingly use these\r\nservices because the promise the following benefits:\r\n\r\n  o  Inexpensive access to hundreds of online library catalogues,\r\nworldwide.\r\n\r\n  o  Uniform, and often cheaper, access to information services using\r\ntelnet rather than a host of special software packages.\r\n\r\n  o  Access to netwide searching tools like WAIS, WWW, and GOPHER.\r\n\r\n  o  Discussion by E-mail with other librarians, conference reports and\r\nannouncements, and so on.\r\n\r\nIt is true, as one librarian said to me, that you can tell that\r\nlibrarians didn't set up the Internet.  The archives grew piecemeal and\r\ntheir contents are far from uniform in quality.  In addition, the whole\r\nInternet is so vast it probably can't be catalogued.  Nevertheless,\r\nrough and ready tools and customs have grown up to provide some sort of\r\naccess to the information that is \"out there\".  There is a great deal of\r\nwork to be done by librarians that will doubtless keep them employed\r\ninto the next millenium.\r\n\r\nThe main boon to librarians is the hierarchical organization of the net\r\ninto nodes, directories, and subdirectories.  These provide an implicit\r\nand universal call number to *everything in the electronic world*.  The\r\nday is not far away when a cross-reference like\r\n\r\n     See ota.ox.ac.uk:/pub/HistoricalDocs/Political/US/constitution\r\n\r\nwill be as common as a bibliographic citation or See reference in a card\r\ncatalogue.\r\n\r\nThe Internet also carries a number of hidden expenses and dangers to\r\nlibraries:\r\n\r\n  o  It will somewhat increase the expense of computer equipment,\r\ntechnical personnel, software, etc. needed by libraries\r\n\r\n  o  Additional phone lines may become necessary, especially if some\r\nsort of public access to the Internet is contemplated\r\n\r\n  o  Staff training needs will be greater\r\n\r\n  o  The local computer system will need virus protection software and\r\nregular backups (a good idea anyway but seldom practiced by librarians,\r\nin my experience.  Persons who are trained in book conservation should\r\nknow better!).\r\n\r\n  o  Some material on the Internet will arouse complaints from the\r\npublic because it represents the views of unpopular minorities (e.g\r\nliberals, homosexuals, feminists, and intellectuals).  There is also a\r\ngreat deal of pornographic material (text and graphics) available by E-\r\nmail or through the Usenet newsgroups.  Issues of censorship, public\r\nfunding, and access for minors have yet to be played out in the domain\r\nof electronic communications.\r\n\r\nIn addition to the standard package of services from your provider,\r\nlibrarians should not neglect Usenet Newgroups, even if this means\r\ngetting a special account with a different service (and accessing it by\r\ndial-up or telnet through your primary service).  Learning to use the\r\nUsenet Newgroups and their invaluable FAQs (Frequently Asked Questions)\r\nis the *single most important skill for professional development of your\r\nstaff.*  This means that you may want to encourage after-hours \"playing\"\r\nwith your computer system.  Think of the Usenet Newsgroups as the\r\nReference Section of the Internet.\r\n\r\n\r\n\r\n<Chapter 16>  Special for Scholars\r\n\r\nIt used to be that only scientists and technologists used the academic\r\nnetworks.  But no longer.  Today there are many humanists and social\r\nscientists happily gabbing away with their friends (oops . . . I mean\r\ncolleagues) at other universities, collaborating by E-mail, subscribing\r\nto and writing for E-journals, and so on.  This is, of course, in\r\naddition to the academic computing environment described in the Chapter\r\nfor students.\r\n\r\nYour main entree to this world is some sort of E-mail access and finding\r\na mailing list or newsgroup for your field.  From there you will pick up\r\ntips on interesting materials or groups to join--in short you can start\r\nnetworking.  The two main sources for such mailing lists are LISTSERVERS\r\n(traditional on BITNET) and increasingly Usenet Newsgroups.  Actually\r\nthe newsgroups are not as useful as the lists at the moment *for the\r\nhumanities*.  This is because the academic hierarchy is not as\r\nsubdivided as the computer science hierarchy.  Thus, there is a whole\r\nhierarchy for computer science, but all of linguistics fits into\r\nsci.lang!  These discussion groups either tend to have just a few\r\nparticipants or to be so all-encompassing that they are useless.  This\r\ndoes not mean you should ignore Usenet--the computer and networking\r\ninformation is invaluable--just that you will not find it *directly*\r\nrelevant to your field.\r\n\r\nListservers are another matter.  They allow distribution of articles by\r\nanyone to the whole list (unless the list is moderated, i.e. refereed by\r\nthe list's owner), and they allow archiving of articles at a place\r\nanyone on the list can access.  In short, they form a sort of Electronic\r\nJournal with a *very* big reader mail column.  To find a list in your\r\nfield, send the message \"INDEX GLOBAL\" to any listserver.  These usually\r\nhave an address like \"listserv@hoople.usnd.edu\".  Then send a message\r\nlike \"SUBSCRIBE PDQFAN\" to the listserver to join the list PDQFAN.\r\nAfter that you will send messages for publication to\r\n\"pdqfan@hoople.usnd.edu\" and (human) service requests to \"pdqfan-\r\nrequest@hoople.usnd.edu\".\r\n\r\nThe best way to use a listserver is to avail yourself of the \"SET PDQFAN\r\nDIGEST\" or \"SET <whateverlist> DIGEST\" command so that you get the\r\n(daily?) mailing as a newspaper and not as a series of fifty or so mail\r\nmessages interspersed throughout the day.  The digest includes *your\r\nown* correspondence so that you have a record of this.  This is not what\r\nhappens without the DIGEST option.  For full instructions send the\r\nmessage \"HELP\" to \"listserv@whereever.edu\".\r\n\r\nUltimately the Humanities will have the same infrastructure of services\r\nthat already is forming in the Sciences:\r\n\r\n  o  easy access to preprints and collections of journal articles\r\n\r\n  o  archives of data sets, special purpose free software, and text\r\ndatabases.\r\n\r\n  o  collections of E-text source materials, if relevant.  These may\r\ninclude \"tagged\" text for special statistical studies.\r\n\r\n  o  a set of free programming tools for routine scholarly tasks like\r\ntypesetting papers, creating bibliographic databases, and so on--in the\r\nformat specific to your field.\r\n\r\nScholars in the humanities should check the list of E-text archives\r\n(over 300 of them) at Georgetown University (send E-mail message \"\" to\r\n\"\" to get started).  These archives may well have materials in your\r\nfield that they will make available for scholarly purposes at a nominal\r\ncost.  In addition, check the Oxford Text Archives at black.ox.ac.uk.\r\n(Login as \"anonymous\" for information--as of this writing the archives\r\nare not searchable online by telnet, but an index is available).\r\n\r\n\r\n\r\n<Chapter 17>  Special for Churches, Synagogues, and Mosques\r\n\r\nIt is suprising that religious organizations have been so slow to\r\nrecognize the importance of a new communications medium like the\r\nInternet.  Many religious organizations use computers for producing\r\nnewsletters or accounting and other office tasks; but very few use them\r\neffectively for telecommunication and internetworking.\r\n\r\nThe Internet is not like Television or Radio--it is not a broadcast\r\nmedium.  In many ways the Internet is a more appropriate communications\r\nmedium for religions organizations than \"the media\".  It is less\r\nexpensive, not centrally controlled, and reaches persons who want to\r\nreceive the information on a case-by-case basis.\r\n\r\nThere is nothing to prevent a religious organization from setting up a\r\nfileserver on one of the commercial nets (admittedly expensive, but you\r\nonly need one worldwide).  From there any member of your organization\r\ncan upload and download information.  Thus you can keep a library of\r\nregional or local newsletters, special software, a directory of local\r\ngroups, listings of job openings, and so on.  Many organizations already\r\nhave this sort of thing on Bulletin Boards, but FTP archives and E-mail\r\nprovide a less expensive method of disseminating information that can\r\nreach anywhere in the world, not just a local region or single area\r\ncode.\r\n\r\nBut the promise of internetworking goes beyond the \"office environment\"\r\nof your organization--which I am sure is already well developed--to\r\ntouch your educational and evangelical mission.  You can make\r\ninformation about your organization and its beliefs instantly available\r\nto 25 million people if they want it.\r\n\r\nIn addition, there is a great need for \"charity work\" in preparing E-\r\ntexts.  Most E-texts are copyrighted or locked up in proprietary\r\ndatabases.  This means that they cannot be freely shared.  Free E-texts,\r\nespecially those written in plain \"vanilla\" ASCII, are in great demand\r\namong blind people--who can use special software to convert the text to\r\nsound--and by persons in remote areas or the third world.\r\n\r\nDistribution of free E-text is not limited to the Internet by any means.\r\nFree E-text will find its way onto thousands of bulletin boards and will\r\nbe passed to non-networked machines by floppy disks.  Once printed out\r\nit can be disseminated by photocopying or any inexpensive printing\r\nmethod that uses \"camera-ready\" copy.  The Internet is thus the backbone\r\nof a worldwide distribution network that can reach anyplace\r\nsophisticated enough to have some sort of printing (or delivery)\r\ntechnology.\r\n\r\nThere are basically two ways to create free E-text:  you can type or\r\nscan in something in the public domain (75 years old or older) or you\r\ncan create new text that has a copyright notice like this one allowing\r\nanyone to copy and distribute the text.  It is not enough merely to sell\r\nthe information at a nominal cost.  Unless you allow others the right to\r\nfurther distribute information it is not really \"free\", even if you\r\nsometimes give it away at no cost on a floppy disk.\r\n\r\nIn fact, the only *free* religious literature (and typing even this in\r\nwas quite an accomplishment) consists of:  The _King James Bible_\r\n(without Apocrypha), the _Quran_, the _Nicene Creed_, The _Book of\r\nMormon_ and related texts, the Bible in Hebrew, and the _Kama Sutra_.\r\nCertainly the various denominations should consider releasing their\r\nbasic liturgical texts and a selection of their religious literature in\r\nfree E-text form.  Modern versions of the Bible are a problem because of\r\ncopyright restrictions.  It would certainly be a boon for some\r\norganization to make a modern version \"free\" in the sense that anyone\r\ncould copy and distribute it.\r\n\r\n\r\n\r\n\r\n<Part III>  Advanced Techniques\r\n\r\n<Chapter 18>  Research Methods I:  Basic Navigation Methods\r\n\r\nThe Internet is certainly a vast place.  For the beginner, or for the\r\nexperienced user who wants to do more than check an occasional\r\nbibliographic cross-reference to an FTP site, a navigation tool is\r\nalmost essential.  The three most common navigation tools are discussed\r\nhere.  They represent three different approaches to stategy, target\r\nconstituency, target materials, and user interface (the part of the\r\nprogram that you see).  The three services are known as GOPHER, the WIDE\r\nAREA INFORMATION SERVICE (WAIS, pron. \"ways\"), and the WORLD WIDE WEB\r\n(WWW or W3).\r\n\r\nAll three services are based on client-server technology.  To make\r\ninformation *available* to others you need special software called a\r\nserver.  The user then uses a \"client\" program to access the\r\ninformation.  \"Clients\" are often free--they are written by whoever\r\nfunded the initial project or by volunteer hackers.  The catch to using\r\na client is that you have to have a *direct* (usually expensive)\r\nconnection to the Internet.  This is the main reason that a SLIP\r\nconnection will become more and more important.  It \"fools\" the net into\r\nthinking that you have a direct connection without the expense of\r\nhooking your computer to a Local Area Network and then to the Internet.\r\nYou can use a client program on your own home or office computer if you\r\nhave a SLIP connection.\r\n\r\nEven if you don't yet have a SLIP connection--they're still a bit\r\nexperimental--you can use the services listed here.  As of this writing\r\nall three services allow free access to a client for demonstration\r\npurposes.  There are a number of telnet addresses where you can try out\r\nthese navigation tools.  I expect that, as the traffic on the network\r\nincreases, these public access sites will close down.  But by then\r\ncommunications programs will routinely include SLIP and probably some\r\nversion of the major \"clients\" as well.\r\n\r\nOne word of caution:  all the services here are built on top of telnet\r\nand FTP.  They just provide a different and perhaps more useful way of\r\nmaking Internet connections.  Thus, the same service may appear in\r\nseveral guises, depending on the tool you use to connect to it.  There\r\nare also gateways that let you access one service from the other--but\r\noften at a price in terms of useability.  Since the software may not\r\ntell you that you are looking at, say, a Gopher-based service via WWW,\r\nyou may have to try all three services to find the one that makes the\r\nmost reliable connection.\r\n\r\nAnother factor to consider is that unless you have a direct or SLIP\r\nconnection, you will be limited to using a command line interface.  You\r\nwill not experience the real power of, at least, WWW or WAIS.\r\nNevertheless they are useful.  In general, a beginner should use gopher\r\nfirst, then play with the other two services to see if they are useful\r\nto you.\r\n\r\nThe main problem you will have is *getting* the information you find.\r\nIf you do not have the client program, this is difficult.  You could cut\r\nand paste the information from your screen or use your communications\r\nprogram's \"buffer\" to store it.  WAIS will send you the results of your\r\nsearch by E-mail.  Often, you will have to resort to FTP to fetch the\r\ninformation once you have located it--if you can figure out where you\r\nare.  One of my criticisms of search tools like Gopher or WAIS is that\r\nthey often give you a very poor indication of where the information you\r\nfound is physically located.  This is especially true of the publically\r\naccessible versions.\r\n\r\n\r\n<Section 18.1>  Gopher\r\n\r\nGopher was created by two students, xx and xx, at the University of\r\nMinnesota.  It provides a menu-like view of that part of the Internet\r\nwhere Gopher servers are found, \"gopherspace\".  Gopher has spread to\r\nmany universities.  You can search student directories and campus\r\ncalendars, as well as the usual internet resources.  It is by far the\r\neasiest way to explore the net without entering numerous FTP and telnet\r\ncommands.\r\n\r\nSince Gopher is the oldest and most decentralized of the services, it\r\nprovides the most extensive access to useful services.  Online library\r\ncatalogues, the Project Gutenberg library, FTP archives, and numerous\r\nexits to telnet.\r\n\r\nThe telnet access to demonstration Gopher systems (and through them to\r\nGopher servers on *any* campus) is through:\r\n\r\n     xxx.xxx.xxx\r\n\r\nStudents will of course want to use Gopher directly from their school's\r\nsystem.  Try typing \"gopher\" at any prompt.\r\n\r\n\r\n<Section 18.2>  Wide Area Information Services (WAIS)\r\n\r\nWAIS was developed in a very different environment from Gopher.  It was\r\ndeveloped by a joint collaboration of Thinking Machines, Inc.\r\n(Artificial Intellegence technology), Dow Jones News Retrieval\r\n(Information systems), and Apple Computer (User interface).  Its ability\r\nto find information given a plain English description of what you want\r\n(\"hey, find everthing on Personal Computers and Health) is truely mind-\r\nboggling.  It returns a list of \"hits\" together with a likelihood that\r\nit contains what you wanted.  It can also look for documents that are\r\n\"something like\" a sample document.\r\n\r\nThe user interface is a pleasure to use--but requires a direct or SLIP\r\nconnection to the Internet.  The line-oriented version that is\r\npublically available is a pale imitation of the real thing.\r\n\r\nWAIS strength is its ability to retrieve information from almost any\r\nsource, not just FTP sites.  A list of all WAIS sources is maintained in\r\na directory-of-directories (available at think.com).  You import a set\r\nof instructions on how to access a given information server to create\r\nyour own personalized list of sources.\r\n\r\nThis service is probably the one of greatest interest to business (i.e.\r\nnon-academic and non-library) users.  To try out WAIS, telnet think.com\r\nand log in as SWAIS.\r\n\r\n\r\n<Section 18.3>  World Wide Web (WWW or W3)\r\n\r\nThe newest of the three services is the World Wide Web.  It was created\r\nat the European European Center for High Energy Physics (CERN).  It is\r\nbased on yet another technology (besides FTP and client-server)--\r\nhypertext.  The World Wide Web views the entire complex of FTP sites as\r\na single \"document\" with cross-references.\r\n\r\nA WWW server lets you read that document and jump to any cross-reference\r\nthat you find--hence the term \"hypertext\".  The result is rather like a\r\nmenu driven system but (at least in the graphical interface versions)\r\nyou stay inside the familiar context of a text editor.  If you can\r\nimagine clicking on a cross-reference and having your text editor fetch\r\nthe document from an FTP site you will get the idea.\r\n\r\nThe documents that can be viewed by WWW are ASCII text with special\r\n\"tags\" that give a addresses of the \"hypertext links.\"  The tags use the\r\nsyntax of the Standard Generalized Markup Language (SGML).  SGML is a\r\nlanguage used by scholars to mark text for academic research.  The WWW\r\nvision of the library of the future is a collection of documents spread\r\nall over the world, the whole of which can be looked at starting from\r\nany one of them.  Sort of like having the whole world on your desktop.\r\n\r\nThere is not \"top\" node to the Web, but you can find points of entry at:\r\n\r\n     telnet info.cern.ch (European Center for High Energy Physics in\r\nGeneva, Switzerland, the \"home\" of WWW).\r\n\r\n\r\n\r\n\r\n<Section 18.4>  Summary of Navigation Tools\r\n\r\nTo summarize, here are the three systems discussed, together with their\r\nunderlying technology and \"constituency\":\r\n\r\n  Gopher         : Simple FTP and Telnet             : Campus Info\r\n\r\n  WAIS           : Artificially Intellegent searches : Business\r\n\r\n  World Wide Web : Hypertext and SGML markup         : Ac. Research\r\n\r\n\r\n\r\n<Chapter 19>  Research Methods II:  Usenet Newsgroups\r\n\r\n[This chapter is under construction]\r\n\r\n\r\n\r\n<Chapter 20>  Research Methods III:  Advanced Techniques\r\n\r\nThe previous two chapters covered the more or less standard techniques\r\nfor finding your way around the net.  This chapter covers more\r\n\r\nThere are three basic \"problem situation\" that every researcher using\r\nthe Internet will eventually face:\r\n\r\n  (1)  You know who has the information but you don't know their\r\n\"address\".\r\n\r\n  (2)  The information is on the net, only you don't know where.\r\n\r\n  (3)  The desired information is not on the net, but their *is*\r\ninformation on how to get it from a non-network source.\r\n\r\nThe methods described in this chapter are more tentative than in the\r\npreceeding two chapters.  They don't always work.\r\n\r\n\r\n<Section 20.1>  Finding Persons and Computers\r\n\r\nThere are a couple of standard methods for checking and verifying E-mail\r\naddresses.\r\n\r\n     % ping rtfm.mit.edu\r\n\r\n(Remember that \"%\" is the prompt the computer gives you.  Your system\r\nprompt may look different).  You should get back a message saying\r\n\"rtfm.mit.edu is alive\" or something like that.\r\n\r\nMany machines support a command called \"nslookup\" that will return the\r\ndotted decimal address given the name of the machine\r\n\r\n     % nslookup rtfm.mit.edu\r\n\r\nreturns \"xxx\" as the dotted decimal address.\r\n\r\nIf you can guess the name of person or institution--this is not hard--\r\nthen you can try to see if you have a valid address by \"fingering\" your\r\nintended victim:\r\n\r\n     % finger pdq@hoople.usnd.edu\r\n\r\nIf the system supports the \"finger\" feature (and many don't), you can\r\ntry any number of guesses or permutations.  If you succeed, you can find\r\nout lots of information about the person:  their telephone number, when\r\nthey last logged on, when they last read their mail, what department\r\nthey work in, etc.  Many systems allow you to leave a file called\r\n\".plan\"--note the initial dot--that contains further contact\r\ninformation.\r\n\r\nGood guesses for names:\r\n\r\n  o  last name (bach),\r\n\r\n  o  last name with one or more initials (pbach, pdqbach),\r\n\r\n  o  three (or more!) initials (pdqb)\r\n\r\n  o  nicknames, cute handles, etc. (fluffy,aragorn)\r\n\r\n  o  work ID numbers  (bach2378@bigblue.com)\r\n\r\nYour last resort is a search program called \"netfind\".  It lets you find\r\na machine or person by keyword.  If you know your target is at USND, you\r\ncan try the keywords PDQ, USND, EDU and find pdq@hoople.usnd.edu.  Note\r\nthat you often have to guess the \"domain\", but this should not be hard.\r\nYou can also search with PDQ, \"University of Southern North Dakota\",\r\nEDU, if USND is not sufficiently obvious.  City and state names work,\r\ntoo.  Try it.\r\n\r\nThe main short comings of \"netfind\" are:\r\n\r\n  (1)  it often fails if the target computer does not support the\r\n\"finger\" command; and\r\n\r\n  (2)  it only works on the Internet, not Bitnet or other mail systems.\r\n\r\nTo use \"netfind\" you have to telnet to any of several standard locations\r\nand log in as \"netfind\".\r\n\r\n\r\nIf one server is busy it should give you a list of alternate servers to\r\ntry.\r\n\r\nDetailed information on how to find someone on the net is given in the\r\nUsenet FAQ  (ftp://rtfm.mit.edu/ xxxx ).  This FAQ is oriented towards\r\nhelping University students, who flood the networks every Fall looking\r\nfor the E-mail addresses of their friends.\r\n\r\n\r\n<Section 20.2>  Finding Information and Software\r\n\r\nBy far the easiest way to\r\n\r\nIf you do not have Internet access, then you will have to use FTP by E-\r\nmail (use the \"Archie by E-mail\" archive server first to find your\r\ntarget!).\r\n\r\n  Finding Information and Software\r\n    Usenet News FAQ Archives\r\n    Archie\r\n\r\n\r\n<Section 20.3>  Finding References to Paper Documents\r\n\r\nThis is the last resort, right?  Most information is still in paper,\r\nalthough the high cost of paper will mean that less and less is\r\navailable this way.\r\n\r\n  (1)  Use the Internet to access bibliographic databases, especially\r\nlibrary catalogues\r\n\r\n  (2)  Use a document retrieval service like that provided by the\r\nColorado Alliance of Research Libraries (CARL).\r\n\r\n  (3)  Try to get someone to send you a xerox or fax.\r\n\r\n<Chapter 21>\r\n<Chapter 22>\r\n<Chapter 23>\r\n<Chapter 24>\r\n<Chapter 25>\r\n     These chapters, which deal more with abstract theory than with\r\n     specific instructions, has been omitted from this special edition.\r\n\r\n\r\n\r\n\r\n<Part IV>  Resources\r\n\r\nThe main resources on the Internet are to be found on the net itself:\r\nespecially the Usenet news and its many FAQs including the PDIAL and\r\nNIXPUB listings and various Internet resource guides.  The resources\r\nprovided here are second best.  Nevertheless, it was felt important to\r\nprovide a few addresses and a few book titles for the neophyte to get\r\nstarted.  The information in this section is a point of departure, not a\r\nconclusive summary.\r\n\r\n\r\n\r\n<Chapter 26>  The Internet Address Book:\r\n\r\n[This Chapter is under construction]\r\n\r\n\r\n\r\n<Chapter 27>  Bibliography\r\n\r\nMost of the books below do not contain a great deal of how-to\r\ninformation about connecting to the Network.  This course is intended to\r\nfill the gap.  But they do tell you what to do once you are on.  The\r\nfirst few, which are available by Internet, are especially useful.  They\r\ndo make the network \"self-describing\".\r\n\r\n\r\n  AVAILABLE ON THE INTERNET\r\n\r\n_The Incomplete Guide to the Internet_ (for Macintosh with Microsoft\r\nWord only--for paper version see below)\r\n\r\n  A very complete guide written by the Education Office of the National\r\n  Supercomputing Agency (NCSA).  It contains a very complete intro-\r\n  duction to the Internet and classroom Internet projects for K12\r\n  teachers.  This is the best guide for public school teachers.\r\n\r\nFor paper version, write:  Chuck Farmer, 152 CAB, 605 E. Springfield\r\nAve., Champaign, IL  61820.  Cost is around $22.00 for 300 pp.\r\n\r\n\r\nPolly, Jean Armour.  _Surfing the Internet_\r\n  nysernet.org:/pub/resources/guides (192.77.173.2).  This is my all-\r\n  around choice for best introduction to the Internet.  It contains\r\n  references to most other good sources of information together with\r\n  instructions on how to get them.  It is especially complete in giving\r\n  information of interest to librarians.\r\n\r\nKehoe, Brendan.  _Zen and the Art of the Internet_ (1st ed.)\r\n\r\n  A very good guide for how-to information.  Unfortunately, the FTP\r\nversions are all marked up in a dialect of the TeX typesetting system.\r\nThey are still somewhat readable though, even if you don't have the TeX\r\nsystem.  A Postscript version is also provided.\r\n\r\n  ftp.uu.net:/inet/doc (137.39.1.9)\r\n  ftp.cs.toronto.edu:/pub/zen (147.31.254.132)\r\n  ftp.cs.widener.edu:/pub/zen (147.31.254.132) files are called zen-\r\n  1.0.tar.Z, zen-1.0.dvi, and zen-1.0.PS\r\n  ftp.sura.net:/pub/nic/zen-1.0.PS\r\n\r\n\r\n  PUBLISHED WORKS\r\n\r\nKehoe, Brendan. (1993). Zen and the Art of the Internet: a Beginner's\r\nGuide (2nd ed.). Englewood Cliffs, NJ: Prentice-Hall.  ISBN 0-13-010778-\r\n6. Index.\r\n\r\nKrol, Ed. (1992). The Whole Internet User's Guide & Catalog. Sebastopol,\r\nCA: O'Reilly & Associates.  ISBN 1-56592-025-2.\r\n\r\nLaQuey, Tracey, & Ryer, J. C. (1993). The Internet Companion: a\r\nBeginner's Guide to Global Networking.. Reading, MA: Addison-Wesley.\r\nISBN 0-201-62224-6\r\n\r\nMarine, April. (1992). INTERNET: Getting Started. Menlo Park, CA:  SRI\r\nInternational.   ISBN 0-944604-15-3\r\n\r\nTennant, Roy, Ober, J., and Lipow, A. G. (1993). Crossing the Internet\r\nThreshold: An Instructional Handbook. Berkeley, CA: Library Solutions\r\nPress.  ISBN: 1-882208-01-3  (Library Solutions Institute and Press,\r\n2137 Oregon Street, Berkeley, CA 94705.  Voice: 510/841-2636  FAX:\r\n510/841-2926)\r\n\r\n\r\n\r\n<Chapter 28>  Glossary\r\n\r\n[This chapter is under construction]\r\n\r\n\r\n\r\n<Appendix A>  COMPUTER HINTS FOR THE *REALLY* GREEN\r\n\r\n1.  (turning on) Make sure the computer is plugged in and on.  Is\r\nsomething on the screen?  Can you hear a fan?  Does anything happen when\r\nyou type or move the mouse?  Are lights lit or flashing?  The screen may\r\nbe frozen by a \"hold\" button (look for a light labelled \"scroll lock\" or\r\nsomething similar.  Try touching the upper left button on the keyboard--\r\nF1, \"escape\", \"hold\", \"break\", whatever).  If the computer is not on\r\nlook for a switch on back or a key labelled \"on\" or with a triangle on\r\nit.\r\n\r\n2.  (using a mouse) Determine whether you are looking at a character\r\nterminal or a window-oriented screen.  If window-oriented, then moving\r\nthe mouse should cause a pointer to appear and move around.  Use this\r\npointer to click on windows, buttons, etc.  You click the mouse by\r\npressing its button (leftmost one if there are three).  If you hold the\r\nmouse button down you can \"grab\" things and drag them around.  Clicking\r\non windows makes them active (ready for commands) and brings them\r\nforward.\r\n\r\n3.  (modifier and function keys) Keys labelled \"shift\", \"alt\", \"meta\",\r\n\"option\", \"command\", \"ctrl\" or marked with certain funny symbols are\r\nmodifier keys.  They work like shift keys on a typewriter and can change\r\nthe effect of typing a key or clicking a mouse button.  Function keys,\r\nlabelled F1, F2, etc., do something immediately--like edit, move to the\r\nnext page, or quit the program--when you press them.  The keys on the\r\nkeypad (right hand side, looks like a calculator pad) act as function\r\nkeys in some programs.\r\n\r\n4.  (popup menus and menubars).  If there is a string of words at the\r\ntop of the screen (\"menubar\"), touch one of the words with the pointer\r\nusing the mouse and then hold down the mouse button.  A menu should pop\r\nup.  If you continue holding down the mouse button and drag down the\r\nmenu, then let go, you will select one of the commands.  If you don't\r\nwant to activate a command, drag the pointer away from the commands\r\n(towards the middle of the screen, say) and let go.\r\n\r\n5.  (getting the computer's attention) No luck?  Try hitting \"return\" or\r\n\"enter\" a few times, look for keys labelled \"break\" or \"escape\", try\r\n\"control-C\" (hold down the key labelled \"CTRL\"--it works like the shift\r\nkey on a typewriter--and then press \"c\", then let go of both keys).\r\n\r\n6.  (carriage return) Once the system is responding you usually have to\r\nhit the carriage return key (marked with a hooked arrow or \"return\" or\r\n\"enter\" or \"CR\" or \"newline\") or else click the mouse (left-most button\r\nif there are three) before anything permanent happens--like sending a\r\ncommand to the computer.\r\n\r\nAn exception is in \"menu-driven\" systems which print a list of options\r\nand expect you to type a number or letter (like \"y\" for yes, \"n\" for\r\nno).  Sometimes answering a question with a carriage return gets you a\r\ndefault answer.  The default is often indicated in brackets:\r\n\r\n  Do you really want to quit [n]?\r\n\r\nHitting return here will not quit.\r\n\r\n7.  (delete key) If you make a typing mistake, there is a key in the\r\nupper righthand corner labelled \"del\", \"delete\", \"backspace\", or with a\r\nbackwards arrow or \"x\" on it that will erase what you typed.\r\n\r\n8.  (logging on) If you see a message like this:\r\n\r\n  Hello.  Welcome to FUBAR system.  Authorized persons only.\r\n\r\n  Username: xxx\r\n  Password:\r\n\r\nthen the computer wants you to give it a username (nickname, handle) and\r\ntype a password.  Type your last name and hit return; then type your\r\npassword and hit return.  If you are sure the system is meant for the\r\ngeneral public--say it is a donor database run by the Red Cross--try\r\nobvious names like \"redcross\", \"anonymous\", or \"public\".  If the account\r\nis meant for general use then:  (1) no password will be required, or (2)\r\nany password at all will work, or (3) the password will be something\r\neasy like \"redcross\" (again) or \"donor\" or \"guest\".\r\n\r\n9.  (system prompts and help) If the computer prints a funny symbol\r\n(called a prompt--often it is a dollar sign, percent sign, question\r\nmark, right angle bracket or some such) and sits there blinking at you,\r\nit is waiting for a command.  Try \"help\" or \"?\" to find out what is\r\npossible.  Or try \"man intro\" (UNIX systems only) to read the online\r\nmanual.  There might be a help key or help command on a menu.\r\n\r\n10.  (text buffers)  At some point you may be composing a message.  You\r\ntype the message, of course.  You may or may not have to type \"return\"\r\nat the end of each line--experiment with this.  You can erase any\r\nmistakes with the delete key.  See if the cursor (blinking marker that\r\nmarks where you type) can be moved around with arrow keys or a mouse.\r\nIf there is a mouse, you can select text by \"dragging\" across it (hold\r\ndown button, move mouse, release mouse).  Once selected a large block of\r\ntext can be deleted with the delete key or moved by issuing the \"cut\"\r\ncommand (look for a function key or command on the \"edit\" menu) and then\r\nthe \"paste\" command.\r\n\r\n11.  (usernames) if you need to know someone's username, try their last\r\nname (goodwin) , first initial or both initials and last name (jgoodwin,\r\njegoodwin), or all three initials (jeg).  Be warned that many sites add\r\nnumbers (goodwin21), use serial numbers (g21135), or use cutesy aliases\r\n(thumper).  Usernames are usually all lowercase.\r\n\r\n12.  (case sensitivity)  if nothing seems to work the way it is supposed\r\nto check your caps lock.  Most systems are either case-sensitive (like\r\nUNIX) or automatically translate commands to all upper case.  Thus\r\n\"help\", \"HELP\", and \"Help\" are either three differnt commands or one and\r\nthe same.\r\n\r\n13.  (saving your work)  With most programs, whatever you do or change\r\nis not permanent unless you write the changes to disk.  You \"save\" your\r\nwork by selecting \"save\" from the \"file\" menu or some other method.\r\nOften there are two commands for exiting--one that saves your work and\r\none that discards it.  For example, \"exit\" might save changes and \"quit\"\r\nignore them.  If your program does not have an \"autosave\" feature--and\r\neven if it does--you should save your work every 15 minutes at least.\r\n\r\n14.  (quitting or logging off)  After you have properly saved your work\r\nyou can quit your program or system by finding the quit command (look at\r\nthe bottom of either the first or last menu on the menu bar), or by\r\ntyping \"quit\", \"exit\", \"q\", \"x\", \"bye\", \"lo\", \"logout\", \"logoff\", or\r\nsomething similar.\r\n\r\n\r\n\r\nAPPENDIX B.  USING A MODEM\r\n\r\nUsing a modem (modulator-demodulator) is relatively easy if you follow\r\nthe instructions that come with the modem and the communications\r\nsoftware.  These instructions cannot\r\n\r\n  BUYING A MODEM:  BASIC FEATURES\r\n\r\nYou should choose a \"Hayes-compatible\" modem.  This is the industry\r\nstandard and works with most software.  The modem is a small computer\r\nthat responds to \"AT\" commands, commands sent by your software beginning\r\nwith \"AT\" for \"Attention Modem\".  The most common are \"ATDT 1 800 555\r\n1212\".  This tells your modem\r\n\r\nSo make sure the modem you buy responds to AT commands.  A 2400 baud\r\nHayes-compatible modem will cost about $50 by mail-order.  You should\r\nconsider buying a FAX modem ($350), however.  The more expensive modem\r\nis faster, has more features, and can turn your computer into a FAX\r\nmachine.  Your connection to the outside world will never be any better\r\nthan your modem allows, so buy a good one.\r\n\r\nThe FAXes can be displayed on your computer screen.  You only print them\r\nif you want to, on an ordinary laser printer.  The other features of a\r\ntop of the line FAX modem include:\r\n\r\n  (1) Up to 14,440 baud rate (7 times faster than 2400 baud)\r\n\r\n  (2) Data compression (V.32bis is the name of the standard)\r\n\r\n  (3) Error correction (V.42bis is the name of the standard)\r\n\r\n  HOOKING UP THE MODEM\r\n\r\nThe modem goes between your computers serial (one-bit-at-a-time)\r\ncommunications port and your telephone line.  Your modem probably\r\nincluded the right kind of cable.  If not, check the manual or call the\r\ndealer who sold you the modem.\r\n\r\nThe modem to phone connection will use standard telephone cable with\r\nmodular jacks on either end.  You unplug your phone from the wall socket\r\nand plug in your modem instead.  If you want to leave your phone,\r\nanswering machine, fax machine, and so on plugged in, you can use dual\r\nplugs that allow one or more cord to be plugged into the same socket.\r\nLook on the bottom of each piece of equipment (including the modem).\r\nThere should be a little sticker that tells how many ringer equivalents\r\nthe equipment is worth.  Don't exceed eight on any one phone line.\r\n\r\nYou can also buy inexpensive boxes that will let you use a single phone\r\nline for faxes and for voice.\r\n\r\nWARNING:  usually your modem--and any other \"peripherals\"--should be\r\nwired to your computer before you turn the computer on.  This is so the\r\ncomputer can look for the modem and confirm that it is hooked up.  Check\r\nyour computer's and modem's manual for precise instructions on hooking\r\nup a modem to your computer.\r\n\r\nIf you are connecting the computer to an office phone that is part of a\r\nPrivate Branch Exchange (PBX) then ...\r\n\r\n  MAKING A CONNECTION\r\n\r\nUsually you call another computer by dialing its phone number.  Either\r\nyou type an AT command like \"ATDT 1 800 555 1212\" or your software does\r\nthis for you when you choose a \"connect\" command or something like that\r\nfrom a menu.\r\n\r\nBefore you get the modem's attention you need to set your software to\r\nthe proper \"modem settings\".  These settings are listed in literature\r\nabout the service.  As a last resort call customer service for the\r\ncomputer you are trying to connect to.  Or else you can try different\r\nsettings until you find one the lets you connect.  The most common modem\r\nsettings today are either 1200 or 2400 baud and \"8N1\", which means 8\r\nbits, no parity, and one stop bit.\r\n\r\nThe most important settings are:\r\n\r\nThe BAUD RATE (300, 1200, and 2400 are typical low speed connections,\r\nwith 2400 being the most common one for modern equipment; 9600 or 14400\r\nare\r\n\r\nFlow control ON or OFF (often labelled XON/XOFF).  If your modem is\r\ngoing to talk with your computer at a faster rate than over the phone\r\nline, then flow control is essential.  Be sure that your software\r\nunderstands that the phone line speed is different from the computer-to-\r\nmodem speed.  The phone line can't go any faster than 14,440 Baud.  Your\r\ncomputer can do four times that or more.\r\n\r\nFull or half duplex connection (LOCAL ECHO ON or OFF).  In a half duplex\r\nconnection the two computers take turns communicating on the same\r\nchannel.  This means that your computer will be the one to \"ECHO\" what\r\n*you* type on your screen (local echo ON), since it doesn't make sense\r\nsay something, have the other computer read it, then send it back, just\r\nso you can see what you type.  In a full duplex connection both\r\ncomputers can talk at once, so local echo is OFF.\r\n\r\n7 or 8 bits per character.  Many computer systems use the last seven\r\nbits of each byte to denote a character (up to 128 characters).  The\r\neighth bit is used for parity, flow control, or some other important\r\nsignal.  Nowadays 8 bits is more common.\r\n\r\nEven, Odd, or No PARITY.  One way to check for errors in transmission is\r\nto tag each byte with a bit that means \"even or odd\", the parity bit.\r\nIf a bit is transmitted incorrectly, then the parity bit won't agree\r\nwith byte sent and the software can ask for that byte or block of data\r\nagain.  NO parity is the most common setting today, however.\r\n\r\n0,1, or 2 STOP BITS. 1 stop bit is the usual setting these days.\r\n\r\nIf your modem has its speaker on, you will here a dial tone, then the\r\nmodem will dial, and then there will be a lot of squeals as the two\r\ncomputers \"negotiate\" about the transmission.  If you are lucky, both\r\ncomputers will establish a \"carrier\" tone or hum that is then modulated\r\nto send data.  At this point most modems turn of the speaker, but a\r\n\"carrier detect\" light should be on.  As long as you have the carrier\r\nyou have the connection.  The carrier is present--to your modem, at\r\nleast--even if you tell your software to \"go off line\" for a while.  If\r\nyou hang up, however, the carrier is dropped.\r\n\r\nNow that you have a carrier, whatever you type is sent to the other\r\ncomputer (and the \"transmit\" light flashes), and you can receive data as\r\nwell.  Pay attention to any banner the service you are connecting to may\r\nprint.  In particular you need to know what \"escape character\" your\r\nsystem recognizes.  Typing this character or sequence of characters\r\nallows you to stop tranmitting everything and give your own system a\r\ncommand.  This is especially important if are transferring a file and\r\nhave to \"escape back to your own system\" to tell it what to do with the\r\nincoming data.\r\n\r\n  FIRST STEPS ON A NEW SYSTEM\r\n\r\n  Many services let you sign up by connecting your computer to a\r\n\r\n  TRANSFERRING DATA\r\n\r\n  Getting data from one computer to another is a matter of running *two*\r\nprograms--one on each computer.  These programs use a common protocol,\r\nor procedure, to communicate.  The most common protocols are XMODEM,\r\nYMODEM, ZMODEM, and KERMIT (for UNIX systems and some others).  The\r\nsteps involved--using KERMIT as an example--are:\r\n\r\n  1. Run KERMIT on the sending machine\r\n\r\n  2. Escape to the receiving machine\r\n\r\n  3. Run KERMIT on the recieving machine\r\n\r\n  4. Wait for the transfer to finish.\r\n\r\nYou will have to read your software manual for more specific\r\ninstructions, unless you have a direct internet connection or SLIP\r\nconnection.  In these cases you can issue a File Transfer Protocol (FTP)\r\ncommand to whichever computer and the details at the other end are\r\nautomatically taken care of.  See Chapter X for more detail on\r\ntransferring data.\r\n\r\n  DISCONNECTING\r\n\r\nYou will want to use whatever \"logoff\" procedure the remote computer\r\nwants.  If your manual or other literature doesn't tell you, and you\r\ncan't get any information by trying \"help\" or \"?\", try the following\r\ncommands:  \"logout\", \"logoff\", \"lo\", \"bye\", \"exit\", \"quit\".\r\n\r\nIf all else fails you can drop the carrier using the \"hangup\" command\r\n(or escape back to your system and send \"ATH\" to your modem--attention,\r\nhangup).\r\n\r\nAs a last resort pull the plug and your telephone company will\r\ndisconnect you, then exit your software and turn off your computer.\r\n\r\n  You may have to get your modem's attention by typing the \"escape\r\nsequence\", which varies from modem to modem or connection to connection.\r\n\r\n\r\n\r\n<Appendix C>  Technical Details of Internet Connections\r\n\r\n[This chapter is under construction]\r\n\r\n\r\n\r\n<Appendix D>  Just enough UNIX\r\n\r\nSince the UNIX operating system may be unfamiliar to many of you, and\r\nsince many workstations on the net use UNIX, it may help some readers to\r\nsummarize some of the peculiarities of UNIX.  One day you may be logged\r\non to a UNIX machine.  Nowadays, like many operating systems, UNIX hides\r\nbehind a graphical user interface like the X Windows system.\r\nOccasionally--and networking is unfortunately one of those occasions--\r\nits quirks like file-naming and directory hierarchy peek through.\r\n\r\nThis Appendix gives you just enough UNIX to avoid some pitfalls and\r\nissue commands needed to transfer files.  The basic commands you need to\r\nknow for any system are how to display directories and list the contents\r\nof files, how to name files, and how to get help about the system.  UNIX\r\ncommands are just as quirky as MS-DOS, VMS, RSX, VM, or any other\r\noperating system that uses a command language.  Fortunately, they are no\r\nharder.\r\n\r\n\r\n<Section D.1>  Basic Commands for Getting Around\r\n\r\nls          : list current directory\r\n\r\nls -l       : longer listing, with file length in bytes\r\n\r\ncd mydir    : move down one level in the hierarchy to directory \"mydir\"\r\n\r\ncd ..       : move up one directory in the hierarchy\r\n\r\n\r\n<Section D.2>  Hierarchical File System\r\n\r\nFiles in UNIX are arranged in a hierarchy or tree structure.\r\n\r\n\r\n<Appendix E>  The Top 10 Things to Get by E-mail\r\n\r\nThis Appendix may be distributed separately from the rest of this\r\ncourse.\r\n\r\n----------(cut here)----------\r\nTHE FREELORE PROJECT's LIST OF THE TOP 10 THINGS TO GET BY E-MAIL\r\n\r\nCopyright (c) 1993 by John E. Goodwin.  All Rights Reserved.\r\nYou may make and distribute verbatim copies of this document for non-\r\ncommercial purposes provided this notice is preserved on all such\r\ncopies.\r\n\r\nThis is a list of ten fun and useful things you can get by electronic\r\nmail.  In all cases your request is handled by an automated system that\r\nsends the materials by return mail.  Systems change frequently, so some\r\ncommands may be out of date.  All were tested and working as of mid-June\r\n1993.\r\n\r\nA typical, old-fashioned E-mail system works like this\r\n\r\n     % mail     <type the command to enter the E-mail program>\r\n\r\n     mail> send  <or type \"help\" to find out what commands work>\r\n\r\n     To: president@whitehouse.gov       <This is an Internet address\r\n                                        --may look different on your\r\n                                        system>\r\n     Cc: vice.president@whitehouse.gov\r\n\r\n     Subj: Your Stance on Nuclear Power\r\n\r\n     Enter Message.  When Done, hit Control-Z, Control-C to quit:\r\n     Dear Mr. President:\r\n\r\n     I was disappointed to see that . . . <etc., until you type CTRL-Z>\r\n\r\n     Message sent 23:05:44 14-JUN-1993.\r\n\r\n     mail> exit\r\n\r\nModern automated mailservers expect your command in the body of the\r\nmessage.  But some old-fashioned ones expect it as part of the *subject*\r\nline!  I always tell if this is the case.\r\n\r\nIn most cases you will get a response in a few minutes.  For systems\r\nthat wait to off-peak hours to send responses you may have to wait a\r\nday.\r\n\r\nHere are some more hints:\r\n\r\n  o  Most automated systems respond to the single command \"help\".\r\n\r\n  o  People change their directory systems around everyday it seems.  If\r\nthe commands given don't work, try to locate what you want by Archie\r\n(see below) before requesting it by mail.\r\n\r\n  o  The Double quotes around some commands aren't part of the command\r\nitself (so don't type them!).\r\n\r\nWith that advice, here's the list. . . .\r\n\r\n\r\n  [10]  The CPET (Catalog of Projects in Electronic Text) supplies\r\ninformation about E-text archives for scholars.  They have an online\r\ndatabase.  For detailed instructions, send the message:\r\n\r\n     connect guvax.acc.georgetown.edu\r\n     cd cpet_projects_in_electronic_text\r\n     get cpet_user_guide.txt\r\n\r\nto \"ftpmail@decwrl.dec.com\".  [This is a service that provides Internet\r\nFile Transfer Protocol (FTP) by E-mail.  See next entry].\r\n\r\n     Anonymous FTP reference for CPET user's guide:\r\n\r\n\"guvax.acc.georgetown.edu:/cpet_projects_in_electronic_text/cpet_user_gu\r\nide.txt\"\r\n\r\n\r\n  [9]  Instructions for using Archie by Mail and FTP by Mail.\r\n\r\nArchie is a lookup service for finding software or documents in\r\nAnonymous FTP archives on the Internet.  Anonymous FTP is a method for\r\nmaking materials on certain computers available to the public.  Anyone\r\nis allowed to log in with the username \"anonymous\" You give your real\r\nname as the password.  Anonymous FTP is not available if you just have\r\nE-mail, not a full Internet connection.\r\n\r\nTo help E-mail users access Anonymous FTP archives, an FTP by Mail\r\nserver has been set up at decwrl.dec.com.  It will send you materials\r\nyou find using Archie.  Binary files (pictures and programs) are encoded\r\nas text files using the programs \"btoa\" or \"uuencode\".  You need these\r\nfreeware programs if you want to get anything besides text files, i.e.\r\nASCII.\r\n\r\nA.  To get started with Archie, send the message \"help\" to\r\n\"archie@archie.rutgers.edu\".  There are many Archie servers around the\r\nworld.  Any Archie will give you a complete list.\r\n\r\nB.  To get started with FTP Mail, send the message\r\n\r\n     help\r\n     quit\r\n\r\nto \"ftpmail@decwrl.dec.com\".\r\n\r\n\r\n  [8]  A list of book-length Public Domain texts Produced by Project\r\nGutenberg.\r\n\r\nYou may either get these texts from the Almanac server at \"oes.orst.edu\"\r\nor direct from Project Gutenberg at \"mrcnext.cso.uiuc.edu\".\r\n\r\nSend message \"help\" to \"almanac@oes.orst.edu\".  After reading the guide,\r\nsend the message \"send gutenberg catalog\".  To get an E-text by mail\r\n(e.g. _Alice in Wonderland_), send the message:\r\n\r\n     send etext alice\r\n\r\nTo see the contents of project gutenberg archivesj, send the message\r\n\r\n     connect mrcnext.cso.uiuc.edu\r\n     cd etext/articles\r\n     get index\r\n     quit\r\n\r\nto \"ftpmail@decwrl.dec.com\".\r\n\r\nTo get the actual texts,\r\n\r\n     connect mrcnext.cso.uiuc.edu\r\n     cd etext/etext93\r\n     get\r\n     quit\r\n\r\nAnonymous FTP Archive references:\r\n\r\n     oes.orst.edu:/pub/data/etext\r\n\r\n     mrcnext.cso.uiuc.edu:/etext/articles (general info)\r\n\r\n     mrcnext.cso.uiuc.edu:/etext/etext93 (the texts)\r\n\r\n\r\n  [7]  A list of E-mail mailing lists, posted to the \"Frequently Asked\r\nQuestions\" or FAQ part of the Usenet newsgroups.\r\n\r\nA typical mailing list works like this:  to join, say, a mailing list on\r\npolitics, you send the request \"subscribe\" to \"politics-\r\nrequest@whitehouse.gov\".  Thereafter, any message sent to\r\n\"politics@whitehouse.gov\" will send you message to all members of the\r\nlist.  You get all the postings from other members as well [The\r\nWhitehouse list on politics is a fake example].\r\n\r\nAside:  Usenet newsgroup FAQ's are archived at \"rtfm.mit.edu\".  They\r\ncover every conceivable subject (but are especially good with\r\ncomputers).  To access the archive by E-mail, send the message \"help\" to\r\n\"mail-server@rtfm.mit.edu\".  For an index of materials available, send\r\nthe message \"index\".\r\n\r\nHere are the specific commands for getting the Mailing Lists:\r\n\r\n     send mail/mailing-lists/part1\r\n     send mail/mailing-lists/part2\r\n     send mail/mailing-lists/part3\r\n     send mail/mailing-lists/part4\r\n     send mail/mailing-lists/part5\r\n\r\nto \"mail-server@rtfm.mit.edu\".\r\n\r\nOther good publications in the same location:\r\n\r\n  A Guide to Social Newsgroups and Mailing_Lists:\r\n\r\n     send social-newsgroups/part1\r\n\r\n  List of Periodic Informational Postings:\r\n\r\n     send periodic-postings/part1\r\n\r\n(six parts).\r\n\r\nFor a more complete list of FAQs, send the commands:\r\n\r\n     send usenet/news.answers/index\r\n     send usenet/news.announce.newusers/index\r\n\r\n\r\nAnonymous FTP archive reference:\r\n\r\n     rtfm.mit.edu:/pub/usenet-by-group/news.answers; and\r\n     rtfm.mit.edu:/pub/usenet-by-group/news.announce.newusers.\r\n\r\nAlso posted as an FAQs to the Usenet newsgroup news.answers.\r\n\r\n\r\n  [6]  LISTSERVERS are the best thing going for persons with E-mail but\r\nwithout full Internet service.  You can send mail to an entire list and\r\nget a digest of \"articles\" posted on a given day.  Lists are espcecially\r\ngood for anyone with an interest in the Humanities.  A list of all\r\nlistservers known to any one listserver can be obtained by sending a\r\nmessage to that listserver (see below).\r\n\r\nSend the message \"help\" to any listserver address, e.g.\r\n\r\n      \"listserv@brownvm.brown.edu\"\r\n\r\nto get started.\r\n\r\nThe listserver at Brown does not respond to the global command (but is\r\nworthwhile anyway).  Try sending the command \"lists global\" to one of\r\nthe other listservers like \"listserv@auvm.american.edu\".\r\n\r\nFor lists with lots of traffic you should consider the \"set <listname>\r\ndigest\" command to get *one* mail message a day with a compendium of\r\narticles.\r\n\r\n\r\n  [5]  Automatically supplied information about PSI's Internet service:\r\n\r\n     Send any message at all to address \"all-info@psi.com\".  There are\r\nlots of other files on their service available instantly.  E.g., for\r\ninformation on their version of telnet, send any message to \"gds-\r\ninfo@psi.com\"; for their version of FTP, any message to \"psilink-\r\ninfo@psi.com\".\r\n\r\n\r\n  [4]  Scott Yanoff's list of Internet Resources.  At last count, there\r\nwere 75 free things to do on the Internet.\r\n\r\nSend the message:\r\n\r\n     send usenet/news.answers/internet-services/faq\r\n     send usenet/news.answers/internet-services/list\r\n\r\nto \"mail-server@rtfm.mit.edu\".\r\n\r\nAnother method is to request the materials by delayed FTP with the\r\nmessage:\r\n\r\n     connect csd4.csd.uwm.edu\r\n     cd pub\r\n     get inet.services.txt\r\n     quit\r\n\r\nto \"ftpmail@decwrl.dec.com\".\r\n\r\nIt is also worth adding the line \"get internetwork-mail-guide\" to the\r\nabove request for a file on send E-mail between any two E-mail systems\r\n(file is 22k).\r\n\r\nAnonymous FTP archive references:\r\n\r\n     csd4.csd.uwm.edu:/pub/inet.services.txt\r\n\r\n     rtfm.mit.edu:/pub/usenet-by-group/news.anwsers/internet-services\r\n\r\n\r\n  [3]  SURFING THE INTERNET, by librarian Jean Armour Polly.  This must-\r\nhave publication is still the best basic orientation to the Internet.\r\nThe nearest thing to the \"how to use the library card catalogue\" speech\r\nthat opened up that other world for us when we were kids.\r\n\r\nSend the message\r\n\r\n     connect nysernet.org\r\n     cd pub/resources/guides\r\n     get surfing.2.0.3.txt     <that's a zero not an \"oh\">\r\n     quit\r\n\r\nto \"ftpmail@decwrl.dec.com\".  Other interesting files in the same\r\ndirectory are:\r\n\r\n     ftp.list\r\n     whatis.internet\r\n     new.user.guide.v2.2.txt\r\n     speakers_on_internet.txt\r\n\r\nAnonymous FTP archive reference:\r\n\r\n     nysernet.org:/pub/resources/guides\r\n\r\n\r\n  [2]  The NIXPUB listing of public access UNIX systems (so you can read\r\nUsenet news!):\r\n\r\nSend the message\r\n\r\n     connect vfl.paramax.com\r\n     cd pub/nixpub\r\n     get long\r\n     quit\r\n\r\nto \"ftpmail@decwrl.dec.com\".\r\n\r\n\r\nAnonymous FTP archive reference:\r\n\r\n     vfl.paramax.com:pub/nixpub/long\r\n\r\nIt is also posted as a FAQ (Frequently Asked Questions) to the Usenet\r\nnewsgroup alt.bbs.\r\n\r\n\r\nAnd the critics' choice is . . .\r\n\r\n  [1]  The PDIAL listing, a listing of dialup methods of connecting to\r\nthe Internet for the general public.\r\n\r\n     Send a message to \"info-deli-server@netcom.com\" with the command\r\n\"send pdial\" in the *subject* line.\r\n\r\nAlternatively, send the message \"send usenet/news.answers/pdial\" to\r\n\"mail-server@rtfm.mit.edu\".\r\n----------\r\n\r\n                        +    +    +\r\n\r\n\"What this country needs is a good 50 cent education.\"\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nEnd of the Project Gutenberg EBook of Email 101, by John Goodwin\r\n",
    "textIndexes": {
        "header": 20,
        "footer": 2996
    },
    "buildPath": "./json//pg75.json",
    "wordcount": 20954
}