{
    "id": "93",
    "formats": [
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "93.kindle.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/93.kindle.noimages",
            "extension": "noimages"
        },
        {
            "format": "application/rdf+xml",
            "fileName": "93.rdf",
            "filePath": "http://www.gutenberg.org/ebooks/93.rdf",
            "extension": "rdf"
        },
        {
            "format": "text/plain; charset=us-ascii",
            "fileName": "93/93.txt",
            "filePath": "http://www.gutenberg.org/files/93/93.txt",
            "extension": "txt"
        },
        {
            "format": "application/epub+zip",
            "fileName": "93.epub.images",
            "filePath": "http://www.gutenberg.org/ebooks/93.epub.images",
            "extension": "images"
        },
        {
            "format": "application/zip",
            "fileName": "93/93-h.zip",
            "filePath": "http://www.gutenberg.org/files/93/93-h.zip",
            "extension": "zip"
        },
        {
            "format": "text/plain",
            "fileName": "93.txt.utf-8",
            "filePath": "http://www.gutenberg.org/ebooks/93.txt.utf-8",
            "extension": "utf-8"
        },
        {
            "format": "text/plain; charset=us-ascii",
            "fileName": "93/93.zip",
            "filePath": "http://www.gutenberg.org/files/93/93.zip",
            "extension": "zip"
        },
        {
            "format": "application/epub+zip",
            "fileName": "93.epub.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/93.epub.noimages",
            "extension": "noimages"
        },
        {
            "format": "text/html; charset=us-ascii",
            "fileName": "93/93-h/93-h.htm",
            "filePath": "http://www.gutenberg.org/files/93/93-h/93-h.htm",
            "extension": "htm"
        },
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "93.kindle.images",
            "filePath": "http://www.gutenberg.org/ebooks/93.kindle.images",
            "extension": "images"
        }
    ],
    "languages": [
        "en"
    ],
    "title": [
        "Tom Sawyer, Detective"
    ],
    "author": "Twain, Mark",
    "issued": "2004-09-14",
    "text": "*** START OF THIS PROJECT GUTENBERG EBOOK TOM SAWYER, DETECTIVE ***\r\n\r\n\r\n\r\nProduced by An Anonymous Volunteer, and David Widger\r\n\r\n\r\n\r\n\r\n\r\nTOM SAWYER, DETECTIVE\r\n\r\nBy Mark Twain\r\n\r\n\r\nContents\r\n\r\n   CHAPTER I.    AN INVITATION FOR TOM AND HUCK\r\n   CHAPTER II.   JAKE DUNLAP\r\n   CHAPTER III.  A DIAMOND ROBBERY\r\n   CHAPTER IV.   THE THREE SLEEPERS\r\n   CHAPTER V.    A TRAGEDY IN THE WOODS\r\n   CHAPTER VI.   PLANS TO SECURE THE DIAMONDS\r\n   CHAPTER VII.  A NIGHT'S VIGIL\r\n   CHAPTER VIII. TALKING WITH THE GHOST\r\n   CHAPTER IX.   FINDING OF JUBITER DUNLAP\r\n   CHAPTER X.    THE ARREST OF UNCLE SILAS\r\n   CHAPTER XI.   TOM SAWYER DISCOVERS THE MURDERERS\r\n\r\n\r\n\r\n\r\nCHAPTER I. AN INVITATION FOR TOM AND HUCK\r\n\r\n\r\n     [Note: Strange as the incidents of this story are, they\r\n     are not inventions, but facts--even to the public confession\r\n     of the accused.  I take them from an old-time Swedish\r\n     criminal trial, change the actors, and transfer the scenes\r\n     to America.  I have added some details, but only a couple of\r\n     them are important ones. -- M. T.]\r\n\r\nWELL, it was the next spring after me and Tom Sawyer set our old nigger\r\nJim free, the time he was chained up for a runaway slave down there on\r\nTom's uncle Silas's farm in Arkansaw. The frost was working out of the\r\nground, and out of the air, too, and it was getting closer and closer\r\nonto barefoot time every day; and next it would be marble time, and next\r\nmumbletypeg, and next tops and hoops, and next kites, and then right\r\naway it would be summer and going in a-swimming. It just makes a boy\r\nhomesick to look ahead like that and see how far off summer is. Yes, and\r\nit sets him to sighing and saddening around, and there's something the\r\nmatter with him, he don't know what. But anyway, he gets out by himself\r\nand mopes and thinks; and mostly he hunts for a lonesome place high up\r\non the hill in the edge of the woods, and sets there and looks away off\r\non the big Mississippi down there a-reaching miles and miles around the\r\npoints where the timber looks smoky and dim it's so far off and still,\r\nand everything's so solemn it seems like everybody you've loved is dead\r\nand gone, and you 'most wish you was dead and gone too, and done with it\r\nall.\r\n\r\nDon't you know what that is? It's spring fever. That is what the name of\r\nit is. And when you've got it, you want--oh, you don't quite know what\r\nit is you DO want, but it just fairly makes your heart ache, you want it\r\nso! It seems to you that mainly what you want is to get away; get away\r\nfrom the same old tedious things you're so used to seeing and so tired\r\nof, and set something new. That is the idea; you want to go and be a\r\nwanderer; you want to go wandering far away to strange countries where\r\neverything is mysterious and wonderful and romantic. And if you can't do\r\nthat, you'll put up with considerable less; you'll go anywhere you CAN\r\ngo, just so as to get away, and be thankful of the chance, too.\r\n\r\nWell, me and Tom Sawyer had the spring fever, and had it bad, too; but\r\nit warn't any use to think about Tom trying to get away, because, as he\r\nsaid, his Aunt Polly wouldn't let him quit school and go traipsing off\r\nsomers wasting time; so we was pretty blue. We was setting on the front\r\nsteps one day about sundown talking this way, when out comes his aunt\r\nPolly with a letter in her hand and says:\r\n\r\n\"Tom, I reckon you've got to pack up and go down to Arkansaw--your aunt\r\nSally wants you.\"\r\n\r\nI 'most jumped out of my skin for joy. I reckoned Tom would fly at his\r\naunt and hug her head off; but if you believe me he set there like a\r\nrock, and never said a word. It made me fit to cry to see him act so\r\nfoolish, with such a noble chance as this opening up. Why, we might lose\r\nit if he didn't speak up and show he was thankful and grateful. But he\r\nset there and studied and studied till I was that distressed I didn't\r\nknow what to do; then he says, very ca'm, and I could a shot him for it:\r\n\r\n\"Well,\" he says, \"I'm right down sorry, Aunt Polly, but I reckon I got\r\nto be excused--for the present.\"\r\n\r\nHis aunt Polly was knocked so stupid and so mad at the cold impudence of\r\nit that she couldn't say a word for as much as a half a minute, and this\r\ngave me a chance to nudge Tom and whisper:\r\n\r\n\"Ain't you got any sense? Sp'iling such a noble chance as this and\r\nthrowing it away?\"\r\n\r\nBut he warn't disturbed. He mumbled back:\r\n\r\n\"Huck Finn, do you want me to let her SEE how bad I want to go? Why,\r\nshe'd begin to doubt, right away, and imagine a lot of sicknesses and\r\ndangers and objections, and first you know she'd take it all back. You\r\nlemme alone; I reckon I know how to work her.\"\r\n\r\nNow I never would 'a' thought of that. But he was right. Tom Sawyer was\r\nalways right--the levelest head I ever see, and always AT himself and\r\nready for anything you might spring on him. By this time his aunt Polly\r\nwas all straight again, and she let fly. She says:\r\n\r\n\"You'll be excused! YOU will! Well, I never heard the like of it in all\r\nmy days! The idea of you talking like that to ME! Now take yourself off\r\nand pack your traps; and if I hear another word out of you about what\r\nyou'll be excused from and what you won't, I lay I'LL excuse you--with a\r\nhickory!\"\r\n\r\nShe hit his head a thump with her thimble as we dodged by, and he let on\r\nto be whimpering as we struck for the stairs. Up in his room he\r\nhugged me, he was so out of his head for gladness because he was going\r\ntraveling. And he says:\r\n\r\n\"Before we get away she'll wish she hadn't let me go, but she won't know\r\nany way to get around it now. After what she's said, her pride won't let\r\nher take it back.\"\r\n\r\nTom was packed in ten minutes, all except what his aunt and Mary would\r\nfinish up for him; then we waited ten more for her to get cooled down\r\nand sweet and gentle again; for Tom said it took her ten minutes to\r\nunruffle in times when half of her feathers was up, but twenty when they\r\nwas all up, and this was one of the times when they was all up. Then we\r\nwent down, being in a sweat to know what the letter said.\r\n\r\nShe was setting there in a brown study, with it laying in her lap. We\r\nset down, and she says:\r\n\r\n\"They're in considerable trouble down there, and they think you and\r\nHuck'll be a kind of diversion for them--'comfort,' they say. Much of\r\nthat they'll get out of you and Huck Finn, I reckon. There's a neighbor\r\nnamed Brace Dunlap that's been wanting to marry their Benny for three\r\nmonths, and at last they told him point blank and once for all, he\r\nCOULDN'T; so he has soured on them, and they're worried about it. I\r\nreckon he's somebody they think they better be on the good side of, for\r\nthey've tried to please him by hiring his no-account brother to help\r\non the farm when they can't hardly afford it, and don't want him around\r\nanyhow. Who are the Dunlaps?\"\r\n\r\n\"They live about a mile from Uncle Silas's place, Aunt Polly--all the\r\nfarmers live about a mile apart down there--and Brace Dunlap is a long\r\nsight richer than any of the others, and owns a whole grist of niggers.\r\nHe's a widower, thirty-six years old, without any children, and is proud\r\nof his money and overbearing, and everybody is a little afraid of him. I\r\njudge he thought he could have any girl he wanted, just for the asking,\r\nand it must have set him back a good deal when he found he couldn't get\r\nBenny. Why, Benny's only half as old as he is, and just as sweet and\r\nlovely as--well, you've seen her. Poor old Uncle Silas--why, it's pitiful,\r\nhim trying to curry favor that way--so hard pushed and poor, and yet\r\nhiring that useless Jubiter Dunlap to please his ornery brother.\"\r\n\r\n\"What a name--Jubiter! Where'd he get it?\"\r\n\r\n\"It's only just a nickname. I reckon they've forgot his real name long\r\nbefore this. He's twenty-seven, now, and has had it ever since the first\r\ntime he ever went in swimming. The school teacher seen a round brown\r\nmole the size of a dime on his left leg above his knee, and four little\r\nbits of moles around it, when he was naked, and he said it minded him\r\nof Jubiter and his moons; and the children thought it was funny, and so\r\nthey got to calling him Jubiter, and he's Jubiter yet. He's tall,\r\nand lazy, and sly, and sneaky, and ruther cowardly, too, but kind of\r\ngood-natured, and wears long brown hair and no beard, and hasn't got a\r\ncent, and Brace boards him for nothing, and gives him his old clothes to\r\nwear, and despises him. Jubiter is a twin.\"\r\n\r\n\"What's t'other twin like?\"\r\n\r\n\"Just exactly like Jubiter--so they say; used to was, anyway, but he\r\nhain't been seen for seven years. He got to robbing when he was nineteen\r\nor twenty, and they jailed him; but he broke jail and got away--up North\r\nhere, somers. They used to hear about him robbing and burglaring now and\r\nthen, but that was years ago. He's dead, now. At least that's what they\r\nsay. They don't hear about him any more.\"\r\n\r\n\"What was his name?\"\r\n\r\n\"Jake.\"\r\n\r\nThere wasn't anything more said for a considerable while; the old lady\r\nwas thinking. At last she says:\r\n\r\n\"The thing that is mostly worrying your aunt Sally is the tempers that\r\nthat man Jubiter gets your uncle into.\"\r\n\r\nTom was astonished, and so was I. Tom says:\r\n\r\n\"Tempers? Uncle Silas? Land, you must be joking! I didn't know he HAD\r\nany temper.\"\r\n\r\n\"Works him up into perfect rages, your aunt Sally says; says he acts as\r\nif he would really hit the man, sometimes.\"\r\n\r\n\"Aunt Polly, it beats anything I ever heard of. Why, he's just as gentle\r\nas mush.\"\r\n\r\n\"Well, she's worried, anyway. Says your uncle Silas is like a changed\r\nman, on account of all this quarreling. And the neighbors talk about it,\r\nand lay all the blame on your uncle, of course, because he's a preacher\r\nand hain't got any business to quarrel. Your aunt Sally says he hates\r\nto go into the pulpit he's so ashamed; and the people have begun to cool\r\ntoward him, and he ain't as popular now as he used to was.\"\r\n\r\n\"Well, ain't it strange? Why, Aunt Polly, he was always so good and kind\r\nand moony and absent-minded and chuckle-headed and lovable--why, he was\r\njust an angel! What CAN be the matter of him, do you reckon?\"\r\n\r\n\r\n\r\n\r\n\r\nCHAPTER II. JAKE DUNLAP\r\n\r\nWE had powerful good luck; because we got a chance in a stern-wheeler\r\nfrom away North which was bound for one of them bayous or one-horse\r\nrivers away down Louisiana way, and so we could go all the way down the\r\nUpper Mississippi and all the way down the Lower Mississippi to that\r\nfarm in Arkansaw without having to change steamboats at St. Louis; not\r\nso very much short of a thousand miles at one pull.\r\n\r\nA pretty lonesome boat; there warn't but few passengers, and all old\r\nfolks, that set around, wide apart, dozing, and was very quiet. We was\r\nfour days getting out of the \"upper river,\" because we got aground so\r\nmuch. But it warn't dull--couldn't be for boys that was traveling, of\r\ncourse.\r\n\r\nFrom the very start me and Tom allowed that there was somebody sick in\r\nthe stateroom next to ourn, because the meals was always toted in there\r\nby the waiters. By and by we asked about it--Tom did and the waiter said\r\nit was a man, but he didn't look sick.\r\n\r\n\"Well, but AIN'T he sick?\"\r\n\r\n\"I don't know; maybe he is, but 'pears to me he's just letting on.\"\r\n\r\n\"What makes you think that?\"\r\n\r\n\"Because if he was sick he would pull his clothes off SOME time or\r\nother--don't you reckon he would? Well, this one don't. At least he don't\r\never pull off his boots, anyway.\"\r\n\r\n\"The mischief he don't! Not even when he goes to bed?\"\r\n\r\n\"No.\"\r\n\r\nIt was always nuts for Tom Sawyer--a mystery was. If you'd lay out a\r\nmystery and a pie before me and him, you wouldn't have to say take your\r\nchoice; it was a thing that would regulate itself. Because in my nature\r\nI have always run to pie, whilst in his nature he has always run to\r\nmystery. People are made different. And it is the best way. Tom says to\r\nthe waiter:\r\n\r\n\"What's the man's name?\"\r\n\r\n\"Phillips.\"\r\n\r\n\"Where'd he come aboard?\"\r\n\r\n\"I think he got aboard at Elexandria, up on the Iowa line.\"\r\n\r\n\"What do you reckon he's a-playing?\"\r\n\r\n\"I hain't any notion--I never thought of it.\"\r\n\r\nI says to myself, here's another one that runs to pie.\r\n\r\n\"Anything peculiar about him?--the way he acts or talks?\"\r\n\r\n\"No--nothing, except he seems so scary, and keeps his doors locked night\r\nand day both, and when you knock he won't let you in till he opens the\r\ndoor a crack and sees who it is.\"\r\n\r\n\"By jimminy, it's int'resting! I'd like to get a look at him. Say--the\r\nnext time you're going in there, don't you reckon you could spread the\r\ndoor and--\"\r\n\r\n\"No, indeedy! He's always behind it. He would block that game.\"\r\n\r\nTom studied over it, and then he says:\r\n\r\n\"Looky here. You lend me your apern and let me take him his breakfast in\r\nthe morning. I'll give you a quarter.\"\r\n\r\nThe boy was plenty willing enough, if the head steward wouldn't mind.\r\nTom says that's all right, he reckoned he could fix it with the head\r\nsteward; and he done it. He fixed it so as we could both go in with\r\naperns on and toting vittles.\r\n\r\nHe didn't sleep much, he was in such a sweat to get in there and find\r\nout the mystery about Phillips; and moreover he done a lot of guessing\r\nabout it all night, which warn't no use, for if you are going to find\r\nout the facts of a thing, what's the sense in guessing out what ain't\r\nthe facts and wasting ammunition? I didn't lose no sleep. I wouldn't\r\ngive a dern to know what's the matter of Phillips, I says to myself.\r\n\r\nWell, in the morning we put on the aperns and got a couple of trays of\r\ntruck, and Tom he knocked on the door. The man opened it a crack, and\r\nthen he let us in and shut it quick. By Jackson, when we got a sight of\r\nhim, we 'most dropped the trays! and Tom says:\r\n\r\n\"Why, Jubiter Dunlap, where'd YOU come from?\"\r\n\r\nWell, the man was astonished, of course; and first off he looked like\r\nhe didn't know whether to be scared, or glad, or both, or which, but\r\nfinally he settled down to being glad; and then his color come back,\r\nthough at first his face had turned pretty white. So we got to talking\r\ntogether while he et his breakfast. And he says:\r\n\r\n\"But I aint Jubiter Dunlap. I'd just as soon tell you who I am, though,\r\nif you'll swear to keep mum, for I ain't no Phillips, either.\"\r\n\r\nTom says:\r\n\r\n\"We'll keep mum, but there ain't any need to tell who you are if you\r\nain't Jubiter Dunlap.\"\r\n\r\n\"Why?\"\r\n\r\n\"Because if you ain't him you're t'other twin, Jake. You're the spit'n\r\nimage of Jubiter.\"\r\n\r\n\"Well, I'm Jake. But looky here, how do you come to know us Dunlaps?\"\r\n\r\nTom told about the adventures we'd had down there at his uncle Silas's\r\nlast summer, and when he see that there warn't anything about his\r\nfolks--or him either, for that matter--that we didn't know, he opened out\r\nand talked perfectly free and candid. He never made any bones about his\r\nown case; said he'd been a hard lot, was a hard lot yet, and reckoned\r\nhe'd be a hard lot plumb to the end. He said of course it was a\r\ndangerous life, and--He give a kind of gasp, and set his head like a\r\nperson that's listening. We didn't say anything, and so it was very\r\nstill for a second or so, and there warn't no sounds but the screaking\r\nof the woodwork and the chug-chugging of the machinery down below.\r\n\r\nThen we got him comfortable again, telling him about his people, and how\r\nBrace's wife had been dead three years, and Brace wanted to marry Benny\r\nand she shook him, and Jubiter was working for Uncle Silas, and him and\r\nUncle Silas quarreling all the time--and then he let go and laughed.\r\n\r\n\"Land!\" he says, \"it's like old times to hear all this tittle-tattle,\r\nand does me good. It's been seven years and more since I heard any. How\r\ndo they talk about me these days?\"\r\n\r\n\"Who?\"\r\n\r\n\"The farmers--and the family.\"\r\n\r\n\"Why, they don't talk about you at all--at least only just a mention,\r\nonce in a long time.\"\r\n\r\n\"The nation!\" he says, surprised; \"why is that?\"\r\n\r\n\"Because they think you are dead long ago.\"\r\n\r\n\"No! Are you speaking true?--honor bright, now.\" He jumped up, excited.\r\n\r\n\"Honor bright. There ain't anybody thinks you are alive.\"\r\n\r\n\"Then I'm saved, I'm saved, sure! I'll go home. They'll hide me and save\r\nmy life. You keep mum. Swear you'll keep mum--swear you'll never, never\r\ntell on me. Oh, boys, be good to a poor devil that's being hunted day\r\nand night, and dasn't show his face! I've never done you any harm; I'll\r\nnever do you any, as God is in the heavens; swear you'll be good to me\r\nand help me save my life.\"\r\n\r\nWe'd a swore it if he'd been a dog; and so we done it. Well, he couldn't\r\nlove us enough for it or be grateful enough, poor cuss; it was all he\r\ncould do to keep from hugging us.\r\n\r\nWe talked along, and he got out a little hand-bag and begun to open it,\r\nand told us to turn our backs. We done it, and when he told us to turn\r\nagain he was perfectly different to what he was before. He had on blue\r\ngoggles and the naturalest-looking long brown whiskers and mustashes\r\nyou ever see. His own mother wouldn't 'a' knowed him. He asked us if he\r\nlooked like his brother Jubiter, now.\r\n\r\n\"No,\" Tom said; \"there ain't anything left that's like him except the\r\nlong hair.\"\r\n\r\n\"All right, I'll get that cropped close to my head before I get there;\r\nthen him and Brace will keep my secret, and I'll live with them as\r\nbeing a stranger, and the neighbors won't ever guess me out. What do you\r\nthink?\"\r\n\r\nTom he studied awhile, then he says:\r\n\r\n\"Well, of course me and Huck are going to keep mum there, but if you\r\ndon't keep mum yourself there's going to be a little bit of a risk--it\r\nain't much, maybe, but it's a little. I mean, if you talk, won't people\r\nnotice that your voice is just like Jubiter's; and mightn't it make them\r\nthink of the twin they reckoned was dead, but maybe after all was hid\r\nall this time under another name?\"\r\n\r\n\"By George,\" he says, \"you're a sharp one! You're perfectly right.\r\nI've got to play deef and dumb when there's a neighbor around. If I'd a\r\nstruck for home and forgot that little detail--However, I wasn't striking\r\nfor home. I was breaking for any place where I could get away from these\r\nfellows that are after me; then I was going to put on this disguise and\r\nget some different clothes, and--\"\r\n\r\nHe jumped for the outside door and laid his ear against it and listened,\r\npale and kind of panting. Presently he whispers:\r\n\r\n\"Sounded like cocking a gun! Lord, what a life to lead!\"\r\n\r\nThen he sunk down in a chair all limp and sick like, and wiped the sweat\r\noff of his face.\r\n\r\n\r\n\r\n\r\n\r\nCHAPTER III. A DIAMOND ROBBERY\r\n\r\nFROM that time out, we was with him 'most all the time, and one or\r\nt'other of us slept in his upper berth. He said he had been so lonesome,\r\nand it was such a comfort to him to have company, and somebody to talk\r\nto in his troubles. We was in a sweat to find out what his secret was,\r\nbut Tom said the best way was not to seem anxious, then likely he\r\nwould drop into it himself in one of his talks, but if we got to asking\r\nquestions he would get suspicious and shet up his shell. It turned out\r\njust so. It warn't no trouble to see that he WANTED to talk about it,\r\nbut always along at first he would scare away from it when he got on the\r\nvery edge of it, and go to talking about something else. The way it come\r\nabout was this: He got to asking us, kind of indifferent like, about\r\nthe passengers down on deck. We told him about them. But he warn't\r\nsatisfied; we warn't particular enough. He told us to describe them\r\nbetter. Tom done it. At last, when Tom was describing one of the\r\nroughest and raggedest ones, he gave a shiver and a gasp and says:\r\n\r\n\"Oh, lordy, that's one of them! They're aboard sure--I just knowed it. I\r\nsort of hoped I had got away, but I never believed it. Go on.\"\r\n\r\nPresently when Tom was describing another mangy, rough deck passenger,\r\nhe give that shiver again and says:\r\n\r\n\"That's him!--that's the other one. If it would only come a good black\r\nstormy night and I could get ashore. You see, they've got spies on me.\r\nThey've got a right to come up and buy drinks at the bar yonder forrard,\r\nand they take that chance to bribe somebody to keep watch on me--porter\r\nor boots or somebody. If I was to slip ashore without anybody seeing me,\r\nthey would know it inside of an hour.\"\r\n\r\nSo then he got to wandering along, and pretty soon, sure enough, he was\r\ntelling! He was poking along through his ups and downs, and when he come\r\nto that place he went right along. He says:\r\n\r\n\"It was a confidence game. We played it on a julery-shop in St.\r\nLouis. What we was after was a couple of noble big di'monds as big as\r\nhazel-nuts, which everybody was running to see. We was dressed up fine,\r\nand we played it on them in broad daylight. We ordered the di'monds\r\nsent to the hotel for us to see if we wanted to buy, and when we was\r\nexamining them we had paste counterfeits all ready, and THEM was the\r\nthings that went back to the shop when we said the water wasn't quite\r\nfine enough for twelve thousand dollars.\"\r\n\r\n\"Twelve-thousand-dollars!\" Tom says. \"Was they really worth all that\r\nmoney, do you reckon?\"\r\n\r\n\"Every cent of it.\"\r\n\r\n\"And you fellows got away with them?\"\r\n\r\n\"As easy as nothing. I don't reckon the julery people know they've been\r\nrobbed yet. But it wouldn't be good sense to stay around St. Louis, of\r\ncourse, so we considered where we'd go. One was for going one way, one\r\nanother, so we throwed up, heads or tails, and the Upper Mississippi\r\nwon. We done up the di'monds in a paper and put our names on it and put\r\nit in the keep of the hotel clerk, and told him not to ever let either\r\nof us have it again without the others was on hand to see it done; then\r\nwe went down town, each by his own self--because I reckon maybe we all\r\nhad the same notion. I don't know for certain, but I reckon maybe we\r\nhad.\"\r\n\r\n\"What notion?\" Tom says.\r\n\r\n\"To rob the others.\"\r\n\r\n\"What--one take everything, after all of you had helped to get it?\"\r\n\r\n\"Cert'nly.\"\r\n\r\nIt disgusted Tom Sawyer, and he said it was the orneriest, low-downest\r\nthing he ever heard of. But Jake Dunlap said it warn't unusual in the\r\nprofession. Said when a person was in that line of business he'd got to\r\nlook out for his own intrust, there warn't nobody else going to do it\r\nfor him. And then he went on. He says:\r\n\r\n\"You see, the trouble was, you couldn't divide up two di'monds amongst\r\nthree. If there'd been three--But never mind about that, there warn't\r\nthree. I loafed along the back streets studying and studying. And I says\r\nto myself, I'll hog them di'monds the first chance I get, and I'll have\r\na disguise all ready, and I'll give the boys the slip, and when I'm safe\r\naway I'll put it on, and then let them find me if they can. So I got the\r\nfalse whiskers and the goggles and this countrified suit of clothes,\r\nand fetched them along back in a hand-bag; and when I was passing a shop\r\nwhere they sell all sorts of things, I got a glimpse of one of my pals\r\nthrough the window. It was Bud Dixon. I was glad, you bet. I says to\r\nmyself, I'll see what he buys. So I kept shady, and watched. Now what do\r\nyou reckon it was he bought?\"\r\n\r\n\"Whiskers?\" said I.\r\n\r\n\"No.\"\r\n\r\n\"Goggles?\"\r\n\r\n\"No.\"\r\n\r\n\"Oh, keep still, Huck Finn, can't you, you're only just hendering all\r\nyou can. What WAS it he bought, Jake?\"\r\n\r\n\"You'd never guess in the world. It was only just a screwdriver--just a\r\nwee little bit of a screwdriver.\"\r\n\r\n\"Well, I declare! What did he want with that?\"\r\n\r\n\"That's what I thought. It was curious. It clean stumped me. I says to\r\nmyself, what can he want with that thing? Well, when he come out I stood\r\nback out of sight, and then tracked him to a second-hand slop-shop and\r\nsee him buy a red flannel shirt and some old ragged clothes--just the\r\nones he's got on now, as you've described. Then I went down to the wharf\r\nand hid my things aboard the up-river boat that we had picked out, and\r\nthen started back and had another streak of luck. I seen our other pal\r\nlay in HIS stock of old rusty second-handers. We got the di'monds and\r\nwent aboard the boat.\r\n\r\n\"But now we was up a stump, for we couldn't go to bed. We had to set up\r\nand watch one another. Pity, that was; pity to put that kind of a strain\r\non us, because there was bad blood between us from a couple of weeks\r\nback, and we was only friends in the way of business. Bad anyway, seeing\r\nthere was only two di'monds betwixt three men. First we had supper, and\r\nthen tramped up and down the deck together smoking till most midnight;\r\nthen we went and set down in my stateroom and locked the doors and\r\nlooked in the piece of paper to see if the di'monds was all right, then\r\nlaid it on the lower berth right in full sight; and there we set, and\r\nset, and by-and-by it got to be dreadful hard to keep awake. At last Bud\r\nDixon he dropped off. As soon as he was snoring a good regular gait that\r\nwas likely to last, and had his chin on his breast and looked permanent,\r\nHal Clayton nodded towards the di'monds and then towards the outside\r\ndoor, and I understood. I reached and got the paper, and then we stood\r\nup and waited perfectly still; Bud never stirred; I turned the key of\r\nthe outside door very soft and slow, then turned the knob the same way,\r\nand we went tiptoeing out onto the guard, and shut the door very soft\r\nand gentle.\r\n\r\n\"There warn't nobody stirring anywhere, and the boat was slipping along,\r\nswift and steady, through the big water in the smoky moonlight. We never\r\nsaid a word, but went straight up onto the hurricane-deck and plumb back\r\naft, and set down on the end of the sky-light. Both of us knowed what\r\nthat meant, without having to explain to one another. Bud Dixon would\r\nwake up and miss the swag, and would come straight for us, for he ain't\r\nafeard of anything or anybody, that man ain't. He would come, and we\r\nwould heave him overboard, or get killed trying. It made me shiver,\r\nbecause I ain't as brave as some people, but if I showed the white\r\nfeather--well, I knowed better than do that. I kind of hoped the boat\r\nwould land somers, and we could skip ashore and not have to run the risk\r\nof this row, I was so scared of Bud Dixon, but she was an upper-river\r\ntub and there warn't no real chance of that.\r\n\r\n\"Well, the time strung along and along, and that fellow never come!\r\nWhy, it strung along till dawn begun to break, and still he never come.\r\n'Thunder,' I says, 'what do you make out of this?--ain't it suspicious?'\r\n'Land!' Hal says, 'do you reckon he's playing us?--open the paper!' I\r\ndone it, and by gracious there warn't anything in it but a couple of\r\nlittle pieces of loaf-sugar! THAT'S the reason he could set there and\r\nsnooze all night so comfortable. Smart? Well, I reckon! He had had them\r\ntwo papers all fixed and ready, and he had put one of them in place of\r\nt'other right under our noses.\r\n\r\n\"We felt pretty cheap. But the thing to do, straight off, was to make\r\na plan; and we done it. We would do up the paper again, just as it was,\r\nand slip in, very elaborate and soft, and lay it on the bunk again,\r\nand let on WE didn't know about any trick, and hadn't any idea he was\r\na-laughing at us behind them bogus snores of his'n; and we would stick\r\nby him, and the first night we was ashore we would get him drunk and\r\nsearch him, and get the di'monds; and DO for him, too, if it warn't too\r\nrisky. If we got the swag, we'd GOT to do for him, or he would hunt us\r\ndown and do for us, sure. But I didn't have no real hope. I knowed we\r\ncould get him drunk--he was always ready for that--but what's the good\r\nof it? You might search him a year and never find--Well, right there I\r\ncatched my breath and broke off my thought! For an idea went ripping\r\nthrough my head that tore my brains to rags--and land, but I felt gay and\r\ngood! You see, I had had my boots off, to unswell my feet, and just\r\nthen I took up one of them to put it on, and I catched a glimpse of the\r\nheel-bottom, and it just took my breath away. You remember about that\r\npuzzlesome little screwdriver?\"\r\n\r\n\"You bet I do,\" says Tom, all excited.\r\n\r\n\"Well, when I catched that glimpse of that boot heel, the idea that went\r\nsmashing through my head was, I know where he's hid the di'monds! You\r\nlook at this boot heel, now. See, it's bottomed with a steel plate, and\r\nthe plate is fastened on with little screws. Now there wasn't a screw\r\nabout that feller anywhere but in his boot heels; so, if he needed a\r\nscrewdriver, I reckoned I knowed why.\"\r\n\r\n\"Huck, ain't it bully!\" says Tom.\r\n\r\n\"Well, I got my boots on, and we went down and slipped in and laid the\r\npaper of sugar on the berth, and sat down soft and sheepish and went to\r\nlistening to Bud Dixon snore. Hal Clayton dropped off pretty soon, but\r\nI didn't; I wasn't ever so wide awake in my life. I was spying out from\r\nunder the shade of my hat brim, searching the floor for leather. It took\r\nme a long time, and I begun to think maybe my guess was wrong, but at\r\nlast I struck it. It laid over by the bulkhead, and was nearly the color\r\nof the carpet. It was a little round plug about as thick as the end of\r\nyour little finger, and I says to myself there's a di'mond in the nest\r\nyou've come from. Before long I spied out the plug's mate.\r\n\r\n\"Think of the smartness and coolness of that blatherskite! He put up\r\nthat scheme on us and reasoned out what we would do, and we went ahead\r\nand done it perfectly exact, like a couple of pudd'nheads. He set there\r\nand took his own time to unscrew his heelplates and cut out his plugs\r\nand stick in the di'monds and screw on his plates again. He allowed we\r\nwould steal the bogus swag and wait all night for him to come up and get\r\ndrownded, and by George it's just what we done! I think it was powerful\r\nsmart.\"\r\n\r\n\"You bet your life it was!\" says Tom, just full of admiration.\r\n\r\n\r\n\r\n\r\n\r\nCHAPTER IV. THE THREE SLEEPERS\r\n\r\nWELL, all day we went through the humbug of watching one another, and it\r\nwas pretty sickly business for two of us and hard to act out, I can tell\r\nyou. About night we landed at one of them little Missouri towns high up\r\ntoward Iowa, and had supper at the tavern, and got a room upstairs with\r\na cot and a double bed in it, but I dumped my bag under a deal table in\r\nthe dark hall while we was moving along it to bed, single file, me last,\r\nand the landlord in the lead with a tallow candle. We had up a lot of\r\nwhisky, and went to playing high-low-jack for dimes, and as soon as the\r\nwhisky begun to take hold of Bud we stopped drinking, but we didn't let\r\nhim stop. We loaded him till he fell out of his chair and laid there\r\nsnoring.\r\n\r\n\"We was ready for business now. I said we better pull our boots off, and\r\nhis'n too, and not make any noise, then we could pull him and haul him\r\naround and ransack him without any trouble. So we done it. I set my\r\nboots and Bud's side by side, where they'd be handy. Then we stripped\r\nhim and searched his seams and his pockets and his socks and the inside\r\nof his boots, and everything, and searched his bundle. Never found any\r\ndi'monds. We found the screwdriver, and Hal says, 'What do you reckon\r\nhe wanted with that?' I said I didn't know; but when he wasn't looking I\r\nhooked it. At last Hal he looked beat and discouraged, and said we'd got\r\nto give it up. That was what I was waiting for. I says:\r\n\r\n\"'There's one place we hain't searched.'\r\n\r\n\"'What place is that?' he says.\r\n\r\n\"'His stomach.'\r\n\r\n\"'By gracious, I never thought of that! NOW we're on the homestretch, to\r\na dead moral certainty. How'll we manage?'\r\n\r\n\"'Well,' I says, 'just stay by him till I turn out and hunt up a drug\r\nstore, and I reckon I'll fetch something that'll make them di'monds\r\ntired of the company they're keeping.'\r\n\r\n\"He said that's the ticket, and with him looking straight at me I slid\r\nmyself into Bud's boots instead of my own, and he never noticed. They\r\nwas just a shade large for me, but that was considerable better than\r\nbeing too small. I got my bag as I went a-groping through the hall, and\r\nin about a minute I was out the back way and stretching up the river\r\nroad at a five-mile gait.\r\n\r\n\"And not feeling so very bad, neither--walking on di'monds don't have no\r\nsuch effect. When I had gone fifteen minutes I says to myself, there's\r\nmore'n a mile behind me, and everything quiet. Another five minutes and\r\nI says there's considerable more land behind me now, and there's a man\r\nback there that's begun to wonder what's the trouble. Another five and\r\nI says to myself he's getting real uneasy--he's walking the floor now.\r\nAnother five, and I says to myself, there's two mile and a half behind\r\nme, and he's AWFUL uneasy--beginning to cuss, I reckon. Pretty soon I\r\nsays to myself, forty minutes gone--he KNOWS there's something up! Fifty\r\nminutes--the truth's a-busting on him now! he is reckoning I found the\r\ndi'monds whilst we was searching, and shoved them in my pocket and never\r\nlet on--yes, and he's starting out to hunt for me. He'll hunt for new\r\ntracks in the dust, and they'll as likely send him down the river as up.\r\n\r\n\"Just then I see a man coming down on a mule, and before I thought I\r\njumped into the bush. It was stupid! When he got abreast he stopped and\r\nwaited a little for me to come out; then he rode on again. But I didn't\r\nfeel gay any more. I says to myself I've botched my chances by that; I\r\nsurely have, if he meets up with Hal Clayton.\r\n\r\n\"Well, about three in the morning I fetched Elexandria and see this\r\nstern-wheeler laying there, and was very glad, because I felt perfectly\r\nsafe, now, you know. It was just daybreak. I went aboard and got this\r\nstateroom and put on these clothes and went up in the pilot-house--to\r\nwatch, though I didn't reckon there was any need of it. I set there and\r\nplayed with my di'monds and waited and waited for the boat to start, but\r\nshe didn't. You see, they was mending her machinery, but I didn't know\r\nanything about it, not being very much used to steamboats.\r\n\r\n\"Well, to cut the tale short, we never left there till plumb noon; and\r\nlong before that I was hid in this stateroom; for before breakfast I see\r\na man coming, away off, that had a gait like Hal Clayton's, and it made\r\nme just sick. I says to myself, if he finds out I'm aboard this boat,\r\nhe's got me like a rat in a trap. All he's got to do is to have me\r\nwatched, and wait--wait till I slip ashore, thinking he is a thousand\r\nmiles away, then slip after me and dog me to a good place and make me\r\ngive up the di'monds, and then he'll--oh, I know what he'll do! Ain't it\r\nawful--awful! And now to think the OTHER one's aboard, too! Oh, ain't it\r\nhard luck, boys--ain't it hard! But you'll help save me, WON'T you?--oh,\r\nboys, be good to a poor devil that's being hunted to death, and save\r\nme--I'll worship the very ground you walk on!\"\r\n\r\nWe turned in and soothed him down and told him we would plan for him\r\nand help him, and he needn't be so afeard; and so by and by he got to\r\nfeeling kind of comfortable again, and unscrewed his heelplates and held\r\nup his di'monds this way and that, admiring them and loving them; and\r\nwhen the light struck into them they WAS beautiful, sure; why, they\r\nseemed to kind of bust, and snap fire out all around. But all the same I\r\njudged he was a fool. If I had been him I would a handed the di'monds to\r\nthem pals and got them to go ashore and leave me alone. But he was made\r\ndifferent. He said it was a whole fortune and he couldn't bear the idea.\r\n\r\nTwice we stopped to fix the machinery and laid a good while, once in\r\nthe night; but it wasn't dark enough, and he was afeard to skip. But the\r\nthird time we had to fix it there was a better chance. We laid up at\r\na country woodyard about forty mile above Uncle Silas's place a little\r\nafter one at night, and it was thickening up and going to storm. So Jake\r\nhe laid for a chance to slide. We begun to take in wood. Pretty soon the\r\nrain come a-drenching down, and the wind blowed hard. Of course every\r\nboat-hand fixed a gunny sack and put it on like a bonnet, the way they\r\ndo when they are toting wood, and we got one for Jake, and he slipped\r\ndown aft with his hand-bag and come tramping forrard just like the rest,\r\nand walked ashore with them, and when we see him pass out of the light\r\nof the torch-basket and get swallowed up in the dark, we got our breath\r\nagain and just felt grateful and splendid. But it wasn't for long.\r\nSomebody told, I reckon; for in about eight or ten minutes them two pals\r\ncome tearing forrard as tight as they could jump and darted ashore and\r\nwas gone. We waited plumb till dawn for them to come back, and\r\nkept hoping they would, but they never did. We was awful sorry and\r\nlow-spirited. All the hope we had was that Jake had got such a start\r\nthat they couldn't get on his track, and he would get to his brother's\r\nand hide there and be safe.\r\n\r\nHe was going to take the river road, and told us to find out if Brace\r\nand Jubiter was to home and no strangers there, and then slip out about\r\nsundown and tell him. Said he would wait for us in a little bunch of\r\nsycamores right back of Tom's uncle Silas's tobacker field on the river\r\nroad, a lonesome place.\r\n\r\nWe set and talked a long time about his chances, and Tom said he was\r\nall right if the pals struck up the river instead of down, but it wasn't\r\nlikely, because maybe they knowed where he was from; more likely they\r\nwould go right, and dog him all day, him not suspecting, and kill him\r\nwhen it come dark, and take the boots. So we was pretty sorrowful.\r\n\r\n\r\n\r\n\r\n\r\nCHAPTER V. A TRAGEDY IN THE WOODS\r\n\r\nWE didn't get done tinkering the machinery till away late in the\r\nafternoon, and so it was so close to sundown when we got home that we\r\nnever stopped on our road, but made a break for the sycamores as tight\r\nas we could go, to tell Jake what the delay was, and have him wait till\r\nwe could go to Brace's and find out how things was there. It was getting\r\npretty dim by the time we turned the corner of the woods, sweating and\r\npanting with that long run, and see the sycamores thirty yards ahead of\r\nus; and just then we see a couple of men run into the bunch and heard\r\ntwo or three terrible screams for help. \"Poor Jake is killed, sure,\"\r\nwe says. We was scared through and through, and broke for the tobacker\r\nfield and hid there, trembling so our clothes would hardly stay on; and\r\njust as we skipped in there, a couple of men went tearing by, and into\r\nthe bunch they went, and in a second out jumps four men and took out up\r\nthe road as tight as they could go, two chasing two.\r\n\r\nWe laid down, kind of weak and sick, and listened for more sounds, but\r\ndidn't hear none for a good while but just our hearts. We was thinking\r\nof that awful thing laying yonder in the sycamores, and it seemed like\r\nbeing that close to a ghost, and it give me the cold shudders. The moon\r\ncome a-swelling up out of the ground, now, powerful big and round and\r\nbright, behind a comb of trees, like a face looking through prison bars,\r\nand the black shadders and white places begun to creep around, and it\r\nwas miserable quiet and still and night-breezy and graveyardy and scary.\r\nAll of a sudden Tom whispers:\r\n\r\n\"Look!--what's that?\"\r\n\r\n\"Don't!\" I says. \"Don't take a person by surprise that way. I'm 'most\r\nready to die, anyway, without you doing that.\"\r\n\r\n\"Look, I tell you. It's something coming out of the sycamores.\"\r\n\r\n\"Don't, Tom!\"\r\n\r\n\"It's terrible tall!\"\r\n\r\n\"Oh, lordy-lordy! let's--\"\r\n\r\n\"Keep still--it's a-coming this way.\"\r\n\r\nHe was so excited he could hardly get breath enough to whisper. I had to\r\nlook. I couldn't help it. So now we was both on our knees with our chins\r\non a fence rail and gazing--yes, and gasping too. It was coming down the\r\nroad--coming in the shadder of the trees, and you couldn't see it good;\r\nnot till it was pretty close to us; then it stepped into a bright\r\nsplotch of moonlight and we sunk right down in our tracks--it was Jake\r\nDunlap's ghost! That was what we said to ourselves.\r\n\r\nWe couldn't stir for a minute or two; then it was gone. We talked about\r\nit in low voices. Tom says:\r\n\r\n\"They're mostly dim and smoky, or like they're made out of fog, but this\r\none wasn't.\"\r\n\r\n\"No,\" I says; \"I seen the goggles and the whiskers perfectly plain.\"\r\n\r\n\"Yes, and the very colors in them loud countrified Sunday clothes--plaid\r\nbreeches, green and black--\"\r\n\r\n\"Cotton velvet westcot, fire-red and yaller squares--\"\r\n\r\n\"Leather straps to the bottoms of the breeches legs and one of them\r\nhanging unbottoned--\"\r\n\r\n\"Yes, and that hat--\"\r\n\r\n\"What a hat for a ghost to wear!\"\r\n\r\nYou see it was the first season anybody wore that kind--a black\r\nstiff-brim stove-pipe, very high, and not smooth, with a round top--just\r\nlike a sugar-loaf.\r\n\r\n\"Did you notice if its hair was the same, Huck?\"\r\n\r\n\"No--seems to me I did, then again it seems to me I didn't.\"\r\n\r\n\"I didn't either; but it had its bag along, I noticed that.\"\r\n\r\n\"So did I. How can there be a ghost-bag, Tom?\"\r\n\r\n\"Sho! I wouldn't be as ignorant as that if I was you, Huck Finn.\r\nWhatever a ghost has, turns to ghost-stuff. They've got to have their\r\nthings, like anybody else. You see, yourself, that its clothes was\r\nturned to ghost-stuff. Well, then, what's to hender its bag from\r\nturning, too? Of course it done it.\"\r\n\r\nThat was reasonable. I couldn't find no fault with it. Bill Withers and\r\nhis brother Jack come along by, talking, and Jack says:\r\n\r\n\"What do you reckon he was toting?\"\r\n\r\n\"I dunno; but it was pretty heavy.\"\r\n\r\n\"Yes, all he could lug. Nigger stealing corn from old Parson Silas, I\r\njudged.\"\r\n\r\n\"So did I. And so I allowed I wouldn't let on to see him.\"\r\n\r\n\"That's me, too.\"\r\n\r\nThen they both laughed, and went on out of hearing. It showed how\r\nunpopular old Uncle Silas had got to be now. They wouldn't 'a' let a\r\nnigger steal anybody else's corn and never done anything to him.\r\n\r\nWe heard some more voices mumbling along towards us and getting louder,\r\nand sometimes a cackle of a laugh. It was Lem Beebe and Jim Lane. Jim\r\nLane says:\r\n\r\n\"Who?--Jubiter Dunlap?\"\r\n\r\n\"Yes.\"\r\n\r\n\"Oh, I don't know. I reckon so. I seen him spading up some ground along\r\nabout an hour ago, just before sundown--him and the parson. Said he\r\nguessed he wouldn't go to-night, but we could have his dog if we wanted\r\nhim.\"\r\n\r\n\"Too tired, I reckon.\"\r\n\r\n\"Yes--works so hard!\"\r\n\r\n\"Oh, you bet!\"\r\n\r\nThey cackled at that, and went on by. Tom said we better jump out and\r\ntag along after them, because they was going our way and it wouldn't be\r\ncomfortable to run across the ghost all by ourselves. So we done it, and\r\ngot home all right.\r\n\r\nThat night was the second of September--a Saturday. I sha'n't ever forget\r\nit. You'll see why, pretty soon.\r\n\r\n\r\n\r\n\r\n\r\nCHAPTER VI. PLANS TO SECURE THE DIAMONDS\r\n\r\nWE tramped along behind Jim and Lem till we come to the back stile where\r\nold Jim's cabin was that he was captivated in, the time we set him free,\r\nand here come the dogs piling around us to say howdy, and there was the\r\nlights of the house, too; so we warn't afeard any more, and was going to\r\nclimb over, but Tom says:\r\n\r\n\"Hold on; set down here a minute. By George!\"\r\n\r\n\"What's the matter?\" says I.\r\n\r\n\"Matter enough!\" he says. \"Wasn't you expecting we would be the first\r\nto tell the family who it is that's been killed yonder in the sycamores,\r\nand all about them rapscallions that done it, and about the di'monds\r\nthey've smouched off of the corpse, and paint it up fine, and have the\r\nglory of being the ones that knows a lot more about it than anybody\r\nelse?\"\r\n\r\n\"Why, of course. It wouldn't be you, Tom Sawyer, if you was to let\r\nsuch a chance go by. I reckon it ain't going to suffer none for lack of\r\npaint,\" I says, \"when you start in to scollop the facts.\"\r\n\r\n\"Well, now,\" he says, perfectly ca'm, \"what would you say if I was to\r\ntell you I ain't going to start in at all?\"\r\n\r\nI was astonished to hear him talk so. I says:\r\n\r\n\"I'd say it's a lie. You ain't in earnest, Tom Sawyer?\"\r\n\r\n\"You'll soon see. Was the ghost barefooted?\"\r\n\r\n\"No, it wasn't. What of it?\"\r\n\r\n\"You wait--I'll show you what. Did it have its boots on?\"\r\n\r\n\"Yes. I seen them plain.\"\r\n\r\n\"Swear it?\"\r\n\r\n\"Yes, I swear it.\"\r\n\r\n\"So do I. Now do you know what that means?\"\r\n\r\n\"No. What does it mean?\"\r\n\r\n\"Means that them thieves DIDN'T GET THE DI'MONDS.\"\r\n\r\n\"Jimminy! What makes you think that?\"\r\n\r\n\"I don't only think it, I know it. Didn't the breeches and goggles\r\nand whiskers and hand-bag and every blessed thing turn to ghost-stuff?\r\nEverything it had on turned, didn't it? It shows that the reason its\r\nboots turned too was because it still had them on after it started to go\r\nha'nting around, and if that ain't proof that them blatherskites didn't\r\nget the boots, I'd like to know what you'd CALL proof.\"\r\n\r\nThink of that now. I never see such a head as that boy had. Why, I had\r\neyes and I could see things, but they never meant nothing to me. But Tom\r\nSawyer was different. When Tom Sawyer seen a thing it just got up on its\r\nhind legs and TALKED to him--told him everything it knowed. I never see\r\nsuch a head.\r\n\r\n\"Tom Sawyer,\" I says, \"I'll say it again as I've said it a many a time\r\nbefore: I ain't fitten to black your boots. But that's all right--that's\r\nneither here nor there. God Almighty made us all, and some He gives eyes\r\nthat's blind, and some He gives eyes that can see, and I reckon it ain't\r\nnone of our lookout what He done it for; it's all right, or He'd 'a'\r\nfixed it some other way. Go on--I see plenty plain enough, now, that\r\nthem thieves didn't get way with the di'monds. Why didn't they, do you\r\nreckon?\"\r\n\r\n\"Because they got chased away by them other two men before they could\r\npull the boots off of the corpse.\"\r\n\r\n\"That's so! I see it now. But looky here, Tom, why ain't we to go and\r\ntell about it?\"\r\n\r\n\"Oh, shucks, Huck Finn, can't you see? Look at it. What's a-going to\r\nhappen? There's going to be an inquest in the morning. Them two men will\r\ntell how they heard the yells and rushed there just in time to not save\r\nthe stranger. Then the jury'll twaddle and twaddle and twaddle, and\r\nfinally they'll fetch in a verdict that he got shot or stuck or busted\r\nover the head with something, and come to his death by the inspiration\r\nof God. And after they've buried him they'll auction off his things for\r\nto pay the expenses, and then's OUR chance.\" \"How, Tom?\"\r\n\r\n\"Buy the boots for two dollars!\"\r\n\r\nWell, it 'most took my breath.\r\n\r\n\"My land! Why, Tom, WE'LL get the di'monds!\"\r\n\r\n\"You bet. Some day there'll be a big reward offered for them--a thousand\r\ndollars, sure. That's our money! Now we'll trot in and see the folks.\r\nAnd mind you we don't know anything about any murder, or any di'monds,\r\nor any thieves--don't you forget that.\"\r\n\r\nI had to sigh a little over the way he had got it fixed. I'd 'a' SOLD\r\nthem di'monds--yes, sir--for twelve thousand dollars; but I didn't say\r\nanything. It wouldn't done any good. I says:\r\n\r\n\"But what are we going to tell your aunt Sally has made us so long\r\ngetting down here from the village, Tom?\"\r\n\r\n\"Oh, I'll leave that to you,\" he says. \"I reckon you can explain it\r\nsomehow.\"\r\n\r\nHe was always just that strict and delicate. He never would tell a lie\r\nhimself.\r\n\r\nWe struck across the big yard, noticing this, that, and t'other thing\r\nthat was so familiar, and we so glad to see it again, and when we got to\r\nthe roofed big passageway betwixt the double log house and the kitchen\r\npart, there was everything hanging on the wall just as it used to was,\r\neven to Uncle Silas's old faded green baize working-gown with the hood\r\nto it, and raggedy white patch between the shoulders that always looked\r\nlike somebody had hit him with a snowball; and then we lifted the latch\r\nand walked in. Aunt Sally she was just a-ripping and a-tearing around,\r\nand the children was huddled in one corner, and the old man he was\r\nhuddled in the other and praying for help in time of need. She jumped\r\nfor us with joy and tears running down her face and give us a whacking\r\nbox on the ear, and then hugged us and kissed us and boxed us again, and\r\njust couldn't seem to get enough of it, she was so glad to see us; and\r\nshe says:\r\n\r\n\"Where HAVE you been a-loafing to, you good-for-nothing trash! I've been\r\nthat worried about you I didn't know what to do. Your traps has been\r\nhere ever so long, and I've had supper cooked fresh about four times so\r\nas to have it hot and good when you come, till at last my patience is\r\njust plumb wore out, and I declare I--I--why I could skin you alive! You\r\nmust be starving, poor things!--set down, set down, everybody; don't lose\r\nno more time.\"\r\n\r\nIt was good to be there again behind all that noble corn-pone and\r\nspareribs, and everything that you could ever want in this world. Old\r\nUncle Silas he peeled off one of his bulliest old-time blessings, with\r\nas many layers to it as an onion, and whilst the angels was hauling in\r\nthe slack of it I was trying to study up what to say about what kept\r\nus so long. When our plates was all loadened and we'd got a-going, she\r\nasked me, and I says:\r\n\r\n\"Well, you see,--er--Mizzes--\"\r\n\r\n\"Huck Finn! Since when am I Mizzes to you? Have I ever been stingy of\r\ncuffs or kisses for you since the day you stood in this room and I took\r\nyou for Tom Sawyer and blessed God for sending you to me, though you\r\ntold me four thousand lies and I believed every one of them like a\r\nsimpleton? Call me Aunt Sally--like you always done.\"\r\n\r\nSo I done it. And I says:\r\n\r\n\"Well, me and Tom allowed we would come along afoot and take a smell of\r\nthe woods, and we run across Lem Beebe and Jim Lane, and they asked\r\nus to go with them blackberrying to-night, and said they could borrow\r\nJubiter Dunlap's dog, because he had told them just that minute--\"\r\n\r\n\"Where did they see him?\" says the old man; and when I looked up to see\r\nhow HE come to take an intrust in a little thing like that, his eyes was\r\njust burning into me, he was that eager. It surprised me so it kind of\r\nthrowed me off, but I pulled myself together again and says:\r\n\r\n\"It was when he was spading up some ground along with you, towards\r\nsundown or along there.\"\r\n\r\nHe only said, \"Um,\" in a kind of a disappointed way, and didn't take no\r\nmore intrust. So I went on. I says:\r\n\r\n\"Well, then, as I was a-saying--\"\r\n\r\n\"That'll do, you needn't go no furder.\" It was Aunt Sally. She was\r\nboring right into me with her eyes, and very indignant. \"Huck Finn,\"\r\nshe says, \"how'd them men come to talk about going a-black-berrying in\r\nSeptember--in THIS region?\"\r\n\r\nI see I had slipped up, and I couldn't say a word. She waited, still\r\na-gazing at me, then she says:\r\n\r\n\"And how'd they come to strike that idiot idea of going a-blackberrying\r\nin the night?\"\r\n\r\n\"Well, m'm, they--er--they told us they had a lantern, and--\"\r\n\r\n\"Oh, SHET up--do! Looky here; what was they going to do with a dog?--hunt\r\nblackberries with it?\"\r\n\r\n\"I think, m'm, they--\"\r\n\r\n\"Now, Tom Sawyer, what kind of a lie are you fixing YOUR mouth to\r\ncontribit to this mess of rubbage? Speak out--and I warn you before you\r\nbegin, that I don't believe a word of it. You and Huck's been up to\r\nsomething you no business to--I know it perfectly well; I know you,\r\nBOTH of you. Now you explain that dog, and them blackberries, and the\r\nlantern, and the rest of that rot--and mind you talk as straight as a\r\nstring--do you hear?\"\r\n\r\nTom he looked considerable hurt, and says, very dignified:\r\n\r\n\"It is a pity if Huck is to be talked to that way, just for making a\r\nlittle bit of a mistake that anybody could make.\"\r\n\r\n\"What mistake has he made?\"\r\n\r\n\"Why, only the mistake of saying blackberries when of course he meant\r\nstrawberries.\"\r\n\r\n\"Tom Sawyer, I lay if you aggravate me a little more, I'll--\"\r\n\r\n\"Aunt Sally, without knowing it--and of course without intending it--you\r\nare in the wrong. If you'd 'a' studied natural history the way you\r\nought, you would know that all over the world except just here in\r\nArkansaw they ALWAYS hunt strawberries with a dog--and a lantern--\"\r\n\r\nBut she busted in on him there and just piled into him and snowed him\r\nunder. She was so mad she couldn't get the words out fast enough, and\r\nshe gushed them out in one everlasting freshet. That was what Tom Sawyer\r\nwas after. He allowed to work her up and get her started and then leave\r\nher alone and let her burn herself out. Then she would be so aggravated\r\nwith that subject that she wouldn't say another word about it, nor let\r\nanybody else. Well, it happened just so. When she was tuckered out and\r\nhad to hold up, he says, quite ca'm:\r\n\r\n\"And yet, all the same, Aunt Sally--\"\r\n\r\n\"Shet up!\" she says, \"I don't want to hear another word out of you.\"\r\n\r\nSo we was perfectly safe, then, and didn't have no more trouble about\r\nthat delay. Tom done it elegant.\r\n\r\n\r\n\r\n\r\n\r\nCHAPTER VII. A NIGHT'S VIGIL\r\n\r\nBENNY she was looking pretty sober, and she sighed some, now and then;\r\nbut pretty soon she got to asking about Mary, and Sid, and Tom's aunt\r\nPolly, and then Aunt Sally's clouds cleared off and she got in a good\r\nhumor and joined in on the questions and was her lovingest best self,\r\nand so the rest of the supper went along gay and pleasant. But the old\r\nman he didn't take any hand hardly, and was absent-minded and\r\nrestless, and done a considerable amount of sighing; and it was kind of\r\nheart-breaking to see him so sad and troubled and worried.\r\n\r\nBy and by, a spell after supper, come a nigger and knocked on the\r\ndoor and put his head in with his old straw hat in his hand bowing and\r\nscraping, and said his Marse Brace was out at the stile and wanted his\r\nbrother, and was getting tired waiting supper for him, and would Marse\r\nSilas please tell him where he was? I never see Uncle Silas speak up so\r\nsharp and fractious before. He says:\r\n\r\n\"Am I his brother's keeper?\" And then he kind of wilted together,\r\nand looked like he wished he hadn't spoken so, and then he says,\r\nvery gentle: \"But you needn't say that, Billy; I was took sudden and\r\nirritable, and I ain't very well these days, and not hardly responsible.\r\nTell him he ain't here.\"\r\n\r\nAnd when the nigger was gone he got up and walked the floor, backwards\r\nand forwards, mumbling and muttering to himself and plowing his hands\r\nthrough his hair. It was real pitiful to see him. Aunt Sally she\r\nwhispered to us and told us not to take notice of him, it embarrassed\r\nhim. She said he was always thinking and thinking, since these troubles\r\ncome on, and she allowed he didn't more'n about half know what he was\r\nabout when the thinking spells was on him; and she said he walked in\r\nhis sleep considerable more now than he used to, and sometimes wandered\r\naround over the house and even outdoors in his sleep, and if we catched\r\nhim at it we must let him alone and not disturb him. She said she\r\nreckoned it didn't do him no harm, and may be it done him good. She said\r\nBenny was the only one that was much help to him these days. Said Benny\r\nappeared to know just when to try to soothe him and when to leave him\r\nalone.\r\n\r\nSo he kept on tramping up and down the floor and muttering, till by and\r\nby he begun to look pretty tired; then Benny she went and snuggled up to\r\nhis side and put one hand in his and one arm around his waist and walked\r\nwith him; and he smiled down on her, and reached down and kissed her;\r\nand so, little by little the trouble went out of his face and she\r\npersuaded him off to his room. They had very petting ways together, and\r\nit was uncommon pretty to see.\r\n\r\nAunt Sally she was busy getting the children ready for bed; so by and\r\nby it got dull and tedious, and me and Tom took a turn in the moonlight,\r\nand fetched up in the watermelon-patch and et one, and had a good deal\r\nof talk. And Tom said he'd bet the quarreling was all Jubiter's fault,\r\nand he was going to be on hand the first time he got a chance, and see;\r\nand if it was so, he was going to do his level best to get Uncle Silas\r\nto turn him off.\r\n\r\nAnd so we talked and smoked and stuffed watermelons much as two hours,\r\nand then it was pretty late, and when we got back the house was quiet\r\nand dark, and everybody gone to bed.\r\n\r\nTom he always seen everything, and now he see that the old green baize\r\nwork-gown was gone, and said it wasn't gone when he went out; so he\r\nallowed it was curious, and then we went up to bed.\r\n\r\nWe could hear Benny stirring around in her room, which was next to ourn,\r\nand judged she was worried a good deal about her father and couldn't\r\nsleep. We found we couldn't, neither. So we set up a long time, and\r\nsmoked and talked in a low voice, and felt pretty dull and down-hearted.\r\nWe talked the murder and the ghost over and over again, and got so\r\ncreepy and crawly we couldn't get sleepy nohow and noway.\r\n\r\nBy and by, when it was away late in the night and all the sounds was\r\nlate sounds and solemn, Tom nudged me and whispers to me to look, and I\r\ndone it, and there we see a man poking around in the yard like he didn't\r\nknow just what he wanted to do, but it was pretty dim and we couldn't\r\nsee him good. Then he started for the stile, and as he went over it\r\nthe moon came out strong, and he had a long-handled shovel over his\r\nshoulder, and we see the white patch on the old work-gown. So Tom says:\r\n\r\n\"He's a-walking in his sleep. I wish we was allowed to follow him and\r\nsee where he's going to. There, he's turned down by the tobacker-field.\r\nOut of sight now. It's a dreadful pity he can't rest no better.\"\r\n\r\nWe waited a long time, but he didn't come back any more, or if he did\r\nhe come around the other way; so at last we was tuckered out and went\r\nto sleep and had nightmares, a million of them. But before dawn we was\r\nawake again, because meantime a storm had come up and been raging, and\r\nthe thunder and lightning was awful, and the wind was a-thrashing the\r\ntrees around, and the rain was driving down in slanting sheets, and the\r\ngullies was running rivers. Tom says:\r\n\r\n\"Looky here, Huck, I'll tell you one thing that's mighty curious. Up\r\nto the time we went out last night the family hadn't heard about Jake\r\nDunlap being murdered. Now the men that chased Hal Clayton and Bud Dixon\r\naway would spread the thing around in a half an hour, and every neighbor\r\nthat heard it would shin out and fly around from one farm to t'other and\r\ntry to be the first to tell the news. Land, they don't have such a big\r\nthing as that to tell twice in thirty year! Huck, it's mighty strange; I\r\ndon't understand it.\"\r\n\r\nSo then he was in a fidget for the rain to let up, so we could turn out\r\nand run across some of the people and see if they would say anything\r\nabout it to us. And he said if they did we must be horribly surprised\r\nand shocked.\r\n\r\nWe was out and gone the minute the rain stopped. It was just broad day\r\nthen. We loafed along up the road, and now and then met a person and\r\nstopped and said howdy, and told them when we come, and how we left the\r\nfolks at home, and how long we was going to stay, and all that, but none\r\nof them said a word about that thing; which was just astonishing, and no\r\nmistake. Tom said he believed if we went to the sycamores we would find\r\nthat body laying there solitary and alone, and not a soul around. Said\r\nhe believed the men chased the thieves so far into the woods that the\r\nthieves prob'ly seen a good chance and turned on them at last, and maybe\r\nthey all killed each other, and so there wasn't anybody left to tell.\r\n\r\nFirst we knowed, gabbling along that away, we was right at the\r\nsycamores. The cold chills trickled down my back and I wouldn't budge\r\nanother step, for all Tom's persuading. But he couldn't hold in; he'd\r\nGOT to see if the boots was safe on that body yet. So he crope in--and\r\nthe next minute out he come again with his eyes bulging he was so\r\nexcited, and says:\r\n\r\n\"Huck, it's gone!\"\r\n\r\nI WAS astonished! I says:\r\n\r\n\"Tom, you don't mean it.\"\r\n\r\n\"It's gone, sure. There ain't a sign of it. The ground is trampled some,\r\nbut if there was any blood it's all washed away by the storm, for it's\r\nall puddles and slush in there.\"\r\n\r\nAt last I give in, and went and took a look myself; and it was just as\r\nTom said--there wasn't a sign of a corpse.\r\n\r\n\"Dern it,\" I says, \"the di'monds is gone. Don't you reckon the thieves\r\nslunk back and lugged him off, Tom?\"\r\n\r\n\"Looks like it. It just does. Now where'd they hide him, do you reckon?\"\r\n\r\n\"I don't know,\" I says, disgusted, \"and what's more I don't care.\r\nThey've got the boots, and that's all I cared about. He'll lay around\r\nthese woods a long time before I hunt him up.\"\r\n\r\nTom didn't feel no more intrust in him neither, only curiosity to know\r\nwhat come of him; but he said we'd lay low and keep dark and it wouldn't\r\nbe long till the dogs or somebody rousted him out.\r\n\r\nWe went back home to breakfast ever so bothered and put out and\r\ndisappointed and swindled. I warn't ever so down on a corpse before.\r\n\r\n\r\n\r\n\r\n\r\nCHAPTER VIII. TALKING WITH THE GHOST\r\n\r\nIT warn't very cheerful at breakfast. Aunt Sally she looked old and\r\ntired and let the children snarl and fuss at one another and didn't seem\r\nto notice it was going on, which wasn't her usual style; me and Tom\r\nhad a plenty to think about without talking; Benny she looked like she\r\nhadn't had much sleep, and whenever she'd lift her head a little and\r\nsteal a look towards her father you could see there was tears in her\r\neyes; and as for the old man, his things stayed on his plate and got\r\ncold without him knowing they was there, I reckon, for he was thinking\r\nand thinking all the time, and never said a word and never et a bite.\r\n\r\nBy and by when it was stillest, that nigger's head was poked in at the\r\ndoor again, and he said his Marse Brace was getting powerful uneasy\r\nabout Marse Jubiter, which hadn't come home yet, and would Marse Silas\r\nplease--He was looking at Uncle Silas, and he stopped there, like the\r\nrest of his words was froze; for Uncle Silas he rose up shaky and\r\nsteadied himself leaning his fingers on the table, and he was panting,\r\nand his eyes was set on the nigger, and he kept swallowing, and put his\r\nother hand up to his throat a couple of times, and at last he got his\r\nwords started, and says:\r\n\r\n\"Does he--does he--think--WHAT does he think! Tell him--tell him--\" Then he\r\nsunk down in his chair limp and weak, and says, so as you could hardly\r\nhear him: \"Go away--go away!\"\r\n\r\nThe nigger looked scared and cleared out, and we all felt--well, I don't\r\nknow how we felt, but it was awful, with the old man panting there, and\r\nhis eyes set and looking like a person that was dying. None of us could\r\nbudge; but Benny she slid around soft, with her tears running down,\r\nand stood by his side, and nestled his old gray head up against her and\r\nbegun to stroke it and pet it with her hands, and nodded to us to go\r\naway, and we done it, going out very quiet, like the dead was there.\r\n\r\nMe and Tom struck out for the woods mighty solemn, and saying how\r\ndifferent it was now to what it was last summer when we was here and\r\neverything was so peaceful and happy and everybody thought so much of\r\nUncle Silas, and he was so cheerful and simple-hearted and pudd'n-headed\r\nand good--and now look at him. If he hadn't lost his mind he wasn't much\r\nshort of it. That was what we allowed.\r\n\r\nIt was a most lovely day now, and bright and sunshiny; and the further\r\nand further we went over the hills towards the prairie the lovelier and\r\nlovelier the trees and flowers got to be and the more it seemed strange\r\nand somehow wrong that there had to be trouble in such a world as this.\r\nAnd then all of a sudden I catched my breath and grabbed Tom's arm, and\r\nall my livers and lungs and things fell down into my legs.\r\n\r\n\"There it is!\" I says. We jumped back behind a bush shivering, and Tom\r\nsays:\r\n\r\n\"'Sh!--don't make a noise.\"\r\n\r\nIt was setting on a log right in the edge of a little prairie, thinking.\r\nI tried to get Tom to come away, but he wouldn't, and I dasn't budge by\r\nmyself. He said we mightn't ever get another chance to see one, and he\r\nwas going to look his fill at this one if he died for it. So I looked\r\ntoo, though it give me the fan-tods to do it. Tom he HAD to talk, but he\r\ntalked low. He says:\r\n\r\n\"Poor Jakey, it's got all its things on, just as he said he would. NOW\r\nyou see what we wasn't certain about--its hair. It's not long now the way\r\nit was: it's got it cropped close to its head, the way he said he would.\r\nHuck, I never see anything look any more naturaler than what It does.\"\r\n\r\n\"Nor I neither,\" I says; \"I'd recognize it anywheres.\"\r\n\r\n\"So would I. It looks perfectly solid and genuwyne, just the way it done\r\nbefore it died.\"\r\n\r\nSo we kept a-gazing. Pretty soon Tom says:\r\n\r\n\"Huck, there's something mighty curious about this one, don't you know?\r\nIT oughtn't to be going around in the daytime.\"\r\n\r\n\"That's so, Tom--I never heard the like of it before.\"\r\n\r\n\"No, sir, they don't ever come out only at night--and then not till after\r\ntwelve. There's something wrong about this one, now you mark my words. I\r\ndon't believe it's got any right to be around in the daytime. But don't\r\nit look natural! Jake was going to play deef and dumb here, so the\r\nneighbors wouldn't know his voice. Do you reckon it would do that if we\r\nwas to holler at it?\"\r\n\r\n\"Lordy, Tom, don't talk so! If you was to holler at it I'd die in my\r\ntracks.\"\r\n\r\n\"Don't you worry, I ain't going to holler at it. Look, Huck, it's\r\na-scratching its head--don't you see?\"\r\n\r\n\"Well, what of it?\"\r\n\r\n\"Why, this. What's the sense of it scratching its head? There ain't\r\nanything there to itch; its head is made out of fog or something like\r\nthat, and can't itch. A fog can't itch; any fool knows that.\"\r\n\r\n\"Well, then, if it don't itch and can't itch, what in the nation is it\r\nscratching it for? Ain't it just habit, don't you reckon?\"\r\n\r\n\"No, sir, I don't. I ain't a bit satisfied about the way this one\r\nacts. I've a blame good notion it's a bogus one--I have, as sure as I'm\r\na-sitting here. Because, if it--Huck!\"\r\n\r\n\"Well, what's the matter now?\"\r\n\r\n\"YOU CAN'T SEE THE BUSHES THROUGH IT!\"\r\n\r\n\"Why, Tom, it's so, sure! It's as solid as a cow. I sort of begin to think--\"\r\n\r\n\"Huck, it's biting off a chaw of tobacker! By George, THEY don't\r\nchaw--they hain't got anything to chaw WITH. Huck!\"\r\n\r\n\"I'm a-listening.\"\r\n\r\n\"It ain't a ghost at all. It's Jake Dunlap his own self!\"\r\n\r\n\"Oh your granny!\" I says.\r\n\r\n\"Huck Finn, did we find any corpse in the sycamores?\"\r\n\r\n\"No.\"\r\n\r\n\"Or any sign of one?\"\r\n\r\n\"No.\"\r\n\r\n\"Mighty good reason. Hadn't ever been any corpse there.\"\r\n\r\n\"Why, Tom, you know we heard--\"\r\n\r\n\"Yes, we did--heard a howl or two. Does that prove anybody was killed?\r\nCourse it don't. And we seen four men run, then this one come walking\r\nout and we took it for a ghost. No more ghost than you are. It was Jake\r\nDunlap his own self, and it's Jake Dunlap now. He's been and got his\r\nhair cropped, the way he said he would, and he's playing himself for a\r\nstranger, just the same as he said he would. Ghost? Hum!--he's as sound\r\nas a nut.\"\r\n\r\nThen I see it all, and how we had took too much for granted. I was\r\npowerful glad he didn't get killed, and so was Tom, and we wondered\r\nwhich he would like the best--for us to never let on to know him, or how?\r\nTom reckoned the best way would be to go and ask him. So he started; but\r\nI kept a little behind, because I didn't know but it might be a ghost,\r\nafter all. When Tom got to where he was, he says:\r\n\r\n\"Me and Huck's mighty glad to see you again, and you needn't be afeared\r\nwe'll tell. And if you think it'll be safer for you if we don't let on\r\nto know you when we run across you, say the word and you'll see you can\r\ndepend on us, and would ruther cut our hands off than get you into the\r\nleast little bit of danger.\"\r\n\r\nFirst off he looked surprised to see us, and not very glad, either; but\r\nas Tom went on he looked pleasanter, and when he was done he smiled, and\r\nnodded his head several times, and made signs with his hands, and says:\r\n\r\n\"Goo-goo--goo-goo,\" the way deef and dummies does.\r\n\r\nJust then we see some of Steve Nickerson's people coming that lived\r\nt'other side of the prairie, so Tom says:\r\n\r\n\"You do it elegant; I never see anybody do it better. You're right;\r\nplay it on us, too; play it on us same as the others; it'll keep you in\r\npractice and prevent you making blunders. We'll keep away from you and\r\nlet on we don't know you, but any time we can be any help, you just let\r\nus know.\"\r\n\r\nThen we loafed along past the Nickersons, and of course they asked if\r\nthat was the new stranger yonder, and where'd he come from, and what was\r\nhis name, and which communion was he, Babtis' or Methodis', and which\r\npolitics, Whig or Democrat, and how long is he staying, and all them\r\nother questions that humans always asks when a stranger comes, and\r\nanimals does, too. But Tom said he warn't able to make anything out of\r\ndeef and dumb signs, and the same with goo-gooing. Then we watched them\r\ngo and bullyrag Jake; because we was pretty uneasy for him. Tom said it\r\nwould take him days to get so he wouldn't forget he was a deef and dummy\r\nsometimes, and speak out before he thought. When we had watched long\r\nenough to see that Jake was getting along all right and working\r\nhis signs very good, we loafed along again, allowing to strike the\r\nschoolhouse about recess time, which was a three-mile tramp.\r\n\r\nI was so disappointed not to hear Jake tell about the row in the\r\nsycamores, and how near he come to getting killed, that I couldn't seem\r\nto get over it, and Tom he felt the same, but said if we was in Jake's\r\nfix we would want to go careful and keep still and not take any chances.\r\n\r\nThe boys and girls was all glad to see us again, and we had a real good\r\ntime all through recess. Coming to school the Henderson boys had come\r\nacross the new deef and dummy and told the rest; so all the scholars was\r\nchuck full of him and couldn't talk about anything else, and was in a\r\nsweat to get a sight of him because they hadn't ever seen a deef and\r\ndummy in their lives, and it made a powerful excitement.\r\n\r\nTom said it was tough to have to keep mum now; said we would be heroes\r\nif we could come out and tell all we knowed; but after all, it was still\r\nmore heroic to keep mum, there warn't two boys in a million could do it.\r\nThat was Tom Sawyer's idea about it, and I reckoned there warn't anybody\r\ncould better it.\r\n\r\n\r\n\r\n\r\n\r\nCHAPTER IX. FINDING OF JUBITER DUNLAP\r\n\r\nIN the next two or three days Dummy he got to be powerful popular. He\r\nwent associating around with the neighbors, and they made much of him,\r\nand was proud to have such a rattling curiosity among them. They had him\r\nto breakfast, they had him to dinner, they had him to supper; they kept\r\nhim loaded up with hog and hominy, and warn't ever tired staring at him\r\nand wondering over him, and wishing they knowed more about him, he was\r\nso uncommon and romantic. His signs warn't no good; people couldn't\r\nunderstand them and he prob'ly couldn't himself, but he done a sight of\r\ngoo-gooing, and so everybody was satisfied, and admired to hear him go\r\nit. He toted a piece of slate around, and a pencil; and people wrote\r\nquestions on it and he wrote answers; but there warn't anybody could\r\nread his writing but Brace Dunlap. Brace said he couldn't read it very\r\ngood, but he could manage to dig out the meaning most of the time. He\r\nsaid Dummy said he belonged away off somers and used to be well off,\r\nbut got busted by swindlers which he had trusted, and was poor now, and\r\nhadn't any way to make a living.\r\n\r\nEverybody praised Brace Dunlap for being so good to that stranger. He\r\nlet him have a little log-cabin all to himself, and had his niggers take\r\ncare of it, and fetch him all the vittles he wanted.\r\n\r\nDummy was at our house some, because old Uncle Silas was so afflicted\r\nhimself, these days, that anybody else that was afflicted was a comfort\r\nto him. Me and Tom didn't let on that we had knowed him before, and\r\nhe didn't let on that he had knowed us before. The family talked their\r\ntroubles out before him the same as if he wasn't there, but we reckoned\r\nit wasn't any harm for him to hear what they said. Generly he didn't\r\nseem to notice, but sometimes he did.\r\n\r\nWell, two or three days went along, and everybody got to getting uneasy\r\nabout Jubiter Dunlap. Everybody was asking everybody if they had any\r\nidea what had become of him. No, they hadn't, they said: and they shook\r\ntheir heads and said there was something powerful strange about it.\r\nAnother and another day went by; then there was a report got around that\r\npraps he was murdered. You bet it made a big stir! Everybody's tongue\r\nwas clacking away after that. Saturday two or three gangs turned out and\r\nhunted the woods to see if they could run across his remainders. Me\r\nand Tom helped, and it was noble good times and exciting. Tom he was so\r\nbrimful of it he couldn't eat nor rest. He said if we could find that\r\ncorpse we would be celebrated, and more talked about than if we got\r\ndrownded.\r\n\r\nThe others got tired and give it up; but not Tom Sawyer--that warn't his\r\nstyle. Saturday night he didn't sleep any, hardly, trying to think up a\r\nplan; and towards daylight in the morning he struck it. He snaked me out\r\nof bed and was all excited, and says:\r\n\r\n\"Quick, Huck, snatch on your clothes--I've got it! Bloodhound!\"\r\n\r\nIn two minutes we was tearing up the river road in the dark towards the\r\nvillage. Old Jeff Hooker had a bloodhound, and Tom was going to borrow\r\nhim. I says:\r\n\r\n\"The trail's too old, Tom--and besides, it's rained, you know.\"\r\n\r\n\"It don't make any difference, Huck. If the body's hid in the woods\r\nanywhere around the hound will find it. If he's been murdered and\r\nburied, they wouldn't bury him deep, it ain't likely, and if the dog\r\ngoes over the spot he'll scent him, sure. Huck, we're going to be\r\ncelebrated, sure as you're born!\"\r\n\r\nHe was just a-blazing; and whenever he got afire he was most likely to\r\nget afire all over. That was the way this time. In two minutes he\r\nhad got it all ciphered out, and wasn't only just going to find the\r\ncorpse--no, he was going to get on the track of that murderer and hunt\r\nHIM down, too; and not only that, but he was going to stick to him\r\ntill--\"Well,\" I says, \"you better find the corpse first; I reckon that's\r\na-plenty for to-day. For all we know, there AIN'T any corpse and nobody\r\nhain't been murdered. That cuss could 'a' gone off somers and not been\r\nkilled at all.\"\r\n\r\nThat graveled him, and he says:\r\n\r\n\"Huck Finn, I never see such a person as you to want to spoil\r\neverything. As long as YOU can't see anything hopeful in a thing, you\r\nwon't let anybody else. What good can it do you to throw cold water on\r\nthat corpse and get up that selfish theory that there ain't been any\r\nmurder? None in the world. I don't see how you can act so. I wouldn't\r\ntreat you like that, and you know it. Here we've got a noble good\r\nopportunity to make a ruputation, and--\"\r\n\r\n\"Oh, go ahead,\" I says. \"I'm sorry, and I take it all back. I didn't\r\nmean nothing. Fix it any way you want it. HE ain't any consequence to\r\nme. If he's killed, I'm as glad of it as you are; and if he--\"\r\n\r\n\"I never said anything about being glad; I only--\"\r\n\r\n\"Well, then, I'm as SORRY as you are. Any way you druther have it, that\r\nis the way I druther have it. He--\"\r\n\r\n\"There ain't any druthers ABOUT it, Huck Finn; nobody said anything\r\nabout druthers. And as for--\"\r\n\r\nHe forgot he was talking, and went tramping along, studying. He begun to\r\nget excited again, and pretty soon he says:\r\n\r\n\"Huck, it'll be the bulliest thing that ever happened if we find the\r\nbody after everybody else has quit looking, and then go ahead and hunt\r\nup the murderer. It won't only be an honor to us, but it'll be an honor\r\nto Uncle Silas because it was us that done it. It'll set him up again,\r\nyou see if it don't.\"\r\n\r\nBut Old Jeff Hooker he throwed cold water on the whole business when we\r\ngot to his blacksmith shop and told him what we come for.\r\n\r\n\"You can take the dog,\" he says, \"but you ain't a-going to find any\r\ncorpse, because there ain't any corpse to find. Everybody's quit\r\nlooking, and they're right. Soon as they come to think, they knowed\r\nthere warn't no corpse. And I'll tell you for why. What does a person\r\nkill another person for, Tom Sawyer?--answer me that.\"\r\n\r\n\"Why, he--er--\"\r\n\r\n\"Answer up! You ain't no fool. What does he kill him FOR?\"\r\n\r\n\"Well, sometimes it's for revenge, and--\"\r\n\r\n\"Wait. One thing at a time. Revenge, says you; and right you are. Now\r\nwho ever had anything agin that poor trifling no-account? Who do you\r\nreckon would want to kill HIM?--that rabbit!\"\r\n\r\nTom was stuck. I reckon he hadn't thought of a person having to have\r\na REASON for killing a person before, and now he sees it warn't likely\r\nanybody would have that much of a grudge against a lamb like Jubiter\r\nDunlap. The blacksmith says, by and by:\r\n\r\n\"The revenge idea won't work, you see. Well, then, what's next? Robbery?\r\nB'gosh, that must 'a' been it, Tom! Yes, sirree, I reckon we've struck\r\nit this time. Some feller wanted his gallus-buckles, and so he--\"\r\n\r\nBut it was so funny he busted out laughing, and just went on laughing\r\nand laughing and laughing till he was 'most dead, and Tom looked so put\r\nout and cheap that I knowed he was ashamed he had come, and he wished\r\nhe hadn't. But old Hooker never let up on him. He raked up everything a\r\nperson ever could want to kill another person about, and any fool could\r\nsee they didn't any of them fit this case, and he just made no end of\r\nfun of the whole business and of the people that had been hunting the\r\nbody; and he said:\r\n\r\n\"If they'd had any sense they'd 'a' knowed the lazy cuss slid out\r\nbecause he wanted a loafing spell after all this work. He'll come\r\npottering back in a couple of weeks, and then how'll you fellers feel?\r\nBut, laws bless you, take the dog, and go and hunt his remainders. Do,\r\nTom.\"\r\n\r\nThen he busted out, and had another of them forty-rod laughs of hisn.\r\nTom couldn't back down after all this, so he said, \"All right, unchain\r\nhim;\" and the blacksmith done it, and we started home and left that old\r\nman laughing yet.\r\n\r\nIt was a lovely dog. There ain't any dog that's got a lovelier\r\ndisposition than a bloodhound, and this one knowed us and liked us. He\r\ncapered and raced around ever so friendly, and powerful glad to be free\r\nand have a holiday; but Tom was so cut up he couldn't take any intrust\r\nin him, and said he wished he'd stopped and thought a minute before he\r\never started on such a fool errand. He said old Jeff Hooker would tell\r\neverybody, and we'd never hear the last of it.\r\n\r\nSo we loafed along home down the back lanes, feeling pretty glum and\r\nnot talking. When we was passing the far corner of our tobacker field we\r\nheard the dog set up a long howl in there, and we went to the place and\r\nhe was scratching the ground with all his might, and every now and then\r\ncanting up his head sideways and fetching another howl.\r\n\r\nIt was a long square, the shape of a grave; the rain had made it sink\r\ndown and show the shape. The minute we come and stood there we looked at\r\none another and never said a word. When the dog had dug down only a few\r\ninches he grabbed something and pulled it up, and it was an arm and a\r\nsleeve. Tom kind of gasped out, and says:\r\n\r\n\"Come away, Huck--it's found.\"\r\n\r\nI just felt awful. We struck for the road and fetched the first men that\r\ncome along. They got a spade at the crib and dug out the body, and you\r\nnever see such an excitement. You couldn't make anything out of the\r\nface, but you didn't need to. Everybody said:\r\n\r\n\"Poor Jubiter; it's his clothes, to the last rag!\"\r\n\r\nSome rushed off to spread the news and tell the justice of the peace and\r\nhave an inquest, and me and Tom lit out for the house. Tom was all afire\r\nand 'most out of breath when we come tearing in where Uncle Silas and\r\nAunt Sally and Benny was. Tom sung out:\r\n\r\n\"Me and Huck's found Jubiter Dunlap's corpse all by ourselves with a\r\nbloodhound, after everybody else had quit hunting and given it up; and\r\nif it hadn't a been for us it never WOULD 'a' been found; and he WAS\r\nmurdered too--they done it with a club or something like that; and I'm\r\ngoing to start in and find the murderer, next, and I bet I'll do it!\"\r\n\r\nAunt Sally and Benny sprung up pale and astonished, but Uncle Silas fell\r\nright forward out of his chair on to the floor and groans out:\r\n\r\n\"Oh, my God, you've found him NOW!\"\r\n\r\n\r\n\r\n\r\n\r\nCHAPTER X. THE ARREST OF UNCLE SILAS\r\n\r\nTHEM awful words froze us solid. We couldn't move hand or foot for as\r\nmuch as half a minute. Then we kind of come to, and lifted the old man\r\nup and got him into his chair, and Benny petted him and kissed him and\r\ntried to comfort him, and poor old Aunt Sally she done the same; but,\r\npoor things, they was so broke up and scared and knocked out of their\r\nright minds that they didn't hardly know what they was about. With Tom\r\nit was awful; it 'most petrified him to think maybe he had got his uncle\r\ninto a thousand times more trouble than ever, and maybe it wouldn't ever\r\nhappened if he hadn't been so ambitious to get celebrated, and let the\r\ncorpse alone the way the others done. But pretty soon he sort of come to\r\nhimself again and says:\r\n\r\n\"Uncle Silas, don't you say another word like that. It's dangerous, and\r\nthere ain't a shadder of truth in it.\"\r\n\r\nAunt Sally and Benny was thankful to hear him say that, and they said\r\nthe same; but the old man he wagged his head sorrowful and hopeless, and\r\nthe tears run down his face, and he says;\r\n\r\n\"No--I done it; poor Jubiter, I done it!\"\r\n\r\nIt was dreadful to hear him say it. Then he went on and told about it,\r\nand said it happened the day me and Tom come--along about sundown. He\r\nsaid Jubiter pestered him and aggravated him till he was so mad he just\r\nsort of lost his mind and grabbed up a stick and hit him over the head\r\nwith all his might, and Jubiter dropped in his tracks. Then he was\r\nscared and sorry, and got down on his knees and lifted his head up, and\r\nbegged him to speak and say he wasn't dead; and before long he come to,\r\nand when he see who it was holding his head, he jumped like he was 'most\r\nscared to death, and cleared the fence and tore into the woods, and was\r\ngone. So he hoped he wasn't hurt bad.\r\n\r\n\"But laws,\" he says, \"it was only just fear that gave him that last\r\nlittle spurt of strength, and of course it soon played out and he laid\r\ndown in the bush, and there wasn't anybody to help him, and he died.\"\r\n\r\nThen the old man cried and grieved, and said he was a murderer and the\r\nmark of Cain was on him, and he had disgraced his family and was going\r\nto be found out and hung. But Tom said:\r\n\r\n\"No, you ain't going to be found out. You DIDN'T kill him. ONE lick\r\nwouldn't kill him. Somebody else done it.\"\r\n\r\n\"Oh, yes,\" he says, \"I done it--nobody else. Who else had anything\r\nagainst him? Who else COULD have anything against him?\"\r\n\r\nHe looked up kind of like he hoped some of us could mention somebody\r\nthat could have a grudge against that harmless no-account, but of course\r\nit warn't no use--he HAD us; we couldn't say a word. He noticed that,\r\nand he saddened down again, and I never see a face so miserable and so\r\npitiful to see. Tom had a sudden idea, and says:\r\n\r\n\"But hold on!--somebody BURIED him. Now who--\"\r\n\r\nHe shut off sudden. I knowed the reason. It give me the cold shudders\r\nwhen he said them words, because right away I remembered about us seeing\r\nUncle Silas prowling around with a long-handled shovel away in the night\r\nthat night. And I knowed Benny seen him, too, because she was talking\r\nabout it one day. The minute Tom shut off he changed the subject and\r\nwent to begging Uncle Silas to keep mum, and the rest of us done the\r\nsame, and said he MUST, and said it wasn't his business to tell on\r\nhimself, and if he kept mum nobody would ever know; but if it was found\r\nout and any harm come to him it would break the family's hearts and kill\r\nthem, and yet never do anybody any good. So at last he promised. We was\r\nall of us more comfortable, then, and went to work to cheer up the old\r\nman. We told him all he'd got to do was to keep still, and it wouldn't\r\nbe long till the whole thing would blow over and be forgot. We all said\r\nthere wouldn't anybody ever suspect Uncle Silas, nor ever dream of such\r\na thing, he being so good and kind, and having such a good character;\r\nand Tom says, cordial and hearty, he says:\r\n\r\n\"Why, just look at it a minute; just consider. Here is Uncle Silas, all\r\nthese years a preacher--at his own expense; all these years doing good\r\nwith all his might and every way he can think of--at his own expense,\r\nall the time; always been loved by everybody, and respected; always been\r\npeaceable and minding his own business, the very last man in this whole\r\ndeestrict to touch a person, and everybody knows it. Suspect HIM? Why,\r\nit ain't any more possible than--\"\r\n\r\n\"By authority of the State of Arkansaw, I arrest you for the murder of\r\nJubiter Dunlap!\" shouts the sheriff at the door.\r\n\r\nIt was awful. Aunt Sally and Benny flung themselves at Uncle Silas,\r\nscreaming and crying, and hugged him and hung to him, and Aunt Sally\r\nsaid go away, she wouldn't ever give him up, they shouldn't have him,\r\nand the niggers they come crowding and crying to the door and--well, I\r\ncouldn't stand it; it was enough to break a person's heart; so I got\r\nout.\r\n\r\nThey took him up to the little one-horse jail in the village, and we all\r\nwent along to tell him good-bye; and Tom was feeling elegant, and says\r\nto me, \"We'll have a most noble good time and heaps of danger some\r\ndark night getting him out of there, Huck, and it'll be talked about\r\neverywheres and we will be celebrated;\" but the old man busted that\r\nscheme up the minute he whispered to him about it. He said no, it was\r\nhis duty to stand whatever the law done to him, and he would stick to\r\nthe jail plumb through to the end, even if there warn't no door to it.\r\nIt disappointed Tom and graveled him a good deal, but he had to put up\r\nwith it.\r\n\r\nBut he felt responsible and bound to get his uncle Silas free; and he\r\ntold Aunt Sally, the last thing, not to worry, because he was going to\r\nturn in and work night and day and beat this game and fetch Uncle Silas\r\nout innocent; and she was very loving to him and thanked him and said\r\nshe knowed he would do his very best. And she told us to help Benny take\r\ncare of the house and the children, and then we had a good-bye cry all\r\naround and went back to the farm, and left her there to live with the\r\njailer's wife a month till the trial in October.\r\n\r\n\r\n\r\n\r\n\r\nCHAPTER XI. TOM SAWYER DISCOVERS THE MURDERERS\r\n\r\nWELL, that was a hard month on us all. Poor Benny, she kept up the best\r\nshe could, and me and Tom tried to keep things cheerful there at the\r\nhouse, but it kind of went for nothing, as you may say. It was the same\r\nup at the jail. We went up every day to see the old people, but it was\r\nawful dreary, because the old man warn't sleeping much, and was walking\r\nin his sleep considerable and so he got to looking fagged and miserable,\r\nand his mind got shaky, and we all got afraid his troubles would break\r\nhim down and kill him. And whenever we tried to persuade him to feel\r\ncheerfuler, he only shook his head and said if we only knowed what it\r\nwas to carry around a murderer's load in your heart we wouldn't talk\r\nthat way. Tom and all of us kept telling him it WASN'T murder, but just\r\naccidental killing! but it never made any difference--it was murder, and\r\nhe wouldn't have it any other way. He actu'ly begun to come out plain\r\nand square towards trial time and acknowledge that he TRIED to kill the\r\nman. Why, that was awful, you know. It made things seem fifty times as\r\ndreadful, and there warn't no more comfort for Aunt Sally and Benny.\r\nBut he promised he wouldn't say a word about his murder when others was\r\naround, and we was glad of that.\r\n\r\nTom Sawyer racked the head off of himself all that month trying to plan\r\nsome way out for Uncle Silas, and many's the night he kept me up 'most\r\nall night with this kind of tiresome work, but he couldn't seem to get\r\non the right track no way. As for me, I reckoned a body might as well\r\ngive it up, it all looked so blue and I was so downhearted; but he\r\nwouldn't. He stuck to the business right along, and went on planning and\r\nthinking and ransacking his head.\r\n\r\nSo at last the trial come on, towards the middle of October, and we was\r\nall in the court. The place was jammed, of course. Poor old Uncle Silas,\r\nhe looked more like a dead person than a live one, his eyes was so\r\nhollow and he looked so thin and so mournful. Benny she set on one side\r\nof him and Aunt Sally on the other, and they had veils on, and was\r\nfull of trouble. But Tom he set by our lawyer, and had his finger in\r\neverywheres, of course. The lawyer let him, and the judge let him. He\r\n'most took the business out of the lawyer's hands sometimes; which was\r\nwell enough, because that was only a mud-turtle of a back-settlement\r\nlawyer and didn't know enough to come in when it rains, as the saying\r\nis.\r\n\r\nThey swore in the jury, and then the lawyer for the prostitution got up\r\nand begun. He made a terrible speech against the old man, that made him\r\nmoan and groan, and made Benny and Aunt Sally cry. The way HE told about\r\nthe murder kind of knocked us all stupid it was so different from the\r\nold man's tale. He said he was going to prove that Uncle Silas was SEEN\r\nto kill Jubiter Dunlap by two good witnesses, and done it deliberate,\r\nand SAID he was going to kill him the very minute he hit him with the\r\nclub; and they seen him hide Jubiter in the bushes, and they seen that\r\nJubiter was stone-dead. And said Uncle Silas come later and lugged\r\nJubiter down into the tobacker field, and two men seen him do it. And\r\nsaid Uncle Silas turned out, away in the night, and buried Jubiter, and\r\na man seen him at it.\r\n\r\nI says to myself, poor old Uncle Silas has been lying about it because\r\nhe reckoned nobody seen him and he couldn't bear to break Aunt Sally's\r\nheart and Benny's; and right he was: as for me, I would 'a' lied the\r\nsame way, and so would anybody that had any feeling, to save them such\r\nmisery and sorrow which THEY warn't no ways responsible for. Well, it\r\nmade our lawyer look pretty sick; and it knocked Tom silly, too, for\r\na little spell, but then he braced up and let on that he warn't\r\nworried--but I knowed he WAS, all the same. And the people--my, but it\r\nmade a stir amongst them!\r\n\r\nAnd when that lawyer was done telling the jury what he was going to\r\nprove, he set down and begun to work his witnesses.\r\n\r\nFirst, he called a lot of them to show that there was bad blood betwixt\r\nUncle Silas and the diseased; and they told how they had heard Uncle\r\nSilas threaten the diseased, at one time and another, and how it got\r\nworse and worse and everybody was talking about it, and how diseased got\r\nafraid of his life, and told two or three of them he was certain Uncle\r\nSilas would up and kill him some time or another.\r\n\r\nTom and our lawyer asked them some questions; but it warn't no use, they\r\nstuck to what they said.\r\n\r\nNext, they called up Lem Beebe, and he took the stand. It come into\r\nmy mind, then, how Lem and Jim Lane had come along talking, that time,\r\nabout borrowing a dog or something from Jubiter Dunlap; and that brought\r\nup the blackberries and the lantern; and that brought up Bill and Jack\r\nWithers, and how they passed by, talking about a nigger stealing Uncle\r\nSilas's corn; and that fetched up our old ghost that come along about\r\nthe same time and scared us so--and here HE was too, and a privileged\r\ncharacter, on accounts of his being deef and dumb and a stranger, and\r\nthey had fixed him a chair inside the railing, where he could cross his\r\nlegs and be comfortable, whilst the other people was all in a jam so\r\nthey couldn't hardly breathe. So it all come back to me just the way it\r\nwas that day; and it made me mournful to think how pleasant it was up to\r\nthen, and how miserable ever since.\r\n\r\n\r\n     LEM BEEBE, sworn, said--\"I was a-coming along, that day,\r\n     second of September, and Jim Lane was with me, and it was\r\n     towards sundown, and we heard loud talk, like quarrelling,\r\n     and we was very close, only the hazel bushes between (that's\r\n     along the fence); and we heard a voice say, 'I've told you\r\n     more'n once I'd kill you,' and knowed it was this prisoner's\r\n     voice; and then we see a club come up above the bushes and\r\n     down out of sight again, and heard a smashing thump and then\r\n     a groan or two: and then we crope soft to where we could\r\n     see, and there laid Jupiter Dunlap dead, and this prisoner\r\n     standing over him with the club; and the next he hauled the\r\n     dead man into a clump of bushes and hid him, and then we\r\n     stooped low, to be out of sight, and got away.\"\r\n\r\nWell, it was awful. It kind of froze everybody's blood to hear it, and\r\nthe house was 'most as still whilst he was telling it as if there warn't\r\nnobody in it. And when he was done, you could hear them gasp and sigh,\r\nall over the house, and look at one another the same as to say, \"Ain't\r\nit perfectly terrible--ain't it awful!\"\r\n\r\nNow happened a thing that astonished me. All the time the first\r\nwitnesses was proving the bad blood and the threats and all that, Tom\r\nSawyer was alive and laying for them; and the minute they was through,\r\nhe went for them, and done his level best to catch them in lies and\r\nspile their testimony. But now, how different. When Lem first begun to\r\ntalk, and never said anything about speaking to Jubiter or trying to\r\nborrow a dog off of him, he was all alive and laying for Lem, and you\r\ncould see he was getting ready to cross-question him to death pretty\r\nsoon, and then I judged him and me would go on the stand by and by and\r\ntell what we heard him and Jim Lane say. But the next time I looked at\r\nTom I got the cold shivers. Why, he was in the brownest study you ever\r\nsee--miles and miles away. He warn't hearing a word Lem Beebe was saying;\r\nand when he got through he was still in that brown-study, just the same.\r\nOur lawyer joggled him, and then he looked up startled, and says, \"Take\r\nthe witness if you want him. Lemme alone--I want to think.\"\r\n\r\nWell, that beat me. I couldn't understand it. And Benny and her\r\nmother--oh, they looked sick, they was so troubled. They shoved their\r\nveils to one side and tried to get his eye, but it warn't any use, and\r\nI couldn't get his eye either. So the mud-turtle he tackled the witness,\r\nbut it didn't amount to nothing; and he made a mess of it.\r\n\r\nThen they called up Jim Lane, and he told the very same story over\r\nagain, exact. Tom never listened to this one at all, but set there\r\nthinking and thinking, miles and miles away. So the mud-turtle went in\r\nalone again and come out just as flat as he done before. The lawyer\r\nfor the prostitution looked very comfortable, but the judge looked\r\ndisgusted. You see, Tom was just the same as a regular lawyer, nearly,\r\nbecause it was Arkansaw law for a prisoner to choose anybody he wanted\r\nto help his lawyer, and Tom had had Uncle Silas shove him into the case,\r\nand now he was botching it and you could see the judge didn't like it\r\nmuch. All that the mud-turtle got out of Lem and Jim was this: he asked\r\nthem:\r\n\r\n\"Why didn't you go and tell what you saw?\"\r\n\r\n\"We was afraid we would get mixed up in it ourselves. And we was just\r\nstarting down the river a-hunting for all the week besides; but as soon\r\nas we come back we found out they'd been searching for the body, so then\r\nwe went and told Brace Dunlap all about it.\"\r\n\r\n\"When was that?\"\r\n\r\n\"Saturday night, September 9th.\"\r\n\r\nThe judge he spoke up and says:\r\n\r\n\"Mr. Sheriff, arrest these two witnesses on suspicions of being\r\naccessionary after the fact to the murder.\"\r\n\r\nThe lawyer for the prostitution jumps up all excited, and says:\r\n\r\n\"Your honor! I protest against this extraordi--\"\r\n\r\n\"Set down!\" says the judge, pulling his bowie and laying it on his\r\npulpit. \"I beg you to respect the Court.\"\r\n\r\nSo he done it. Then he called Bill Withers.\r\n\r\n\r\n     BILL WITHERS, sworn, said: \"I was coming along about sundown,\r\n     Saturday, September 2d, by the prisoner's field, and my\r\n     brother Jack was with me and we seen a man toting off\r\n     something heavy on his back and allowed it was a nigger\r\n     stealing corn; we couldn't see distinct; next we made out that\r\n     it was one man carrying another; and the way it hung, so kind\r\n     of limp, we judged it was somebody that was drunk; and by the\r\n     man's walk we said it was Parson Silas, and we judged he had\r\n     found Sam Cooper drunk in the road, which he was always trying\r\n     to reform him, and was toting him out of danger.\"\r\n\r\nIt made the people shiver to think of poor old Uncle Silas toting off\r\nthe diseased down to the place in his tobacker field where the dog dug\r\nup the body, but there warn't much sympathy around amongst the faces,\r\nand I heard one cuss say \"'Tis the coldest blooded work I ever struck,\r\nlugging a murdered man around like that, and going to bury him like a\r\nanimal, and him a preacher at that.\"\r\n\r\nTom he went on thinking, and never took no notice; so our lawyer took\r\nthe witness and done the best he could, and it was plenty poor enough.\r\n\r\nThen Jack Withers he come on the stand and told the same tale, just like\r\nBill done.\r\n\r\nAnd after him comes Brace Dunlap, and he was looking very mournful, and\r\nmost crying; and there was a rustle and a stir all around, and everybody\r\ngot ready to listen, and lots of the women folks said, \"Poor cretur,\r\npoor cretur,\" and you could see a many of them wiping their eyes.\r\n\r\n\r\n     BRACE DUNLAP, sworn, said: \"I was in considerable trouble a\r\n     long time about my poor brother, but I reckoned things warn't\r\n     near so bad as he made out, and I couldn't make myself believe\r\n     anybody would have the heart to hurt a poor harmless cretur\r\n     like that\"--[by jings, I was sure I seen Tom give a kind of a\r\n     faint little start, and then look disappointed again]--\"and\r\n     you know I COULDN'T think a preacher would hurt him--it warn't\r\n     natural to think such an onlikely thing--so I never paid much\r\n     attention, and now I sha'n't ever, ever forgive myself; for if\r\n     I had a done different, my poor brother would be with me this\r\n     day, and not laying yonder murdered, and him so harmless.\" He\r\n     kind of broke down there and choked up, and waited to get his\r\n     voice; and people all around said the most pitiful things, and\r\n     women cried; and it was very still in there, and solemn, and\r\n     old Uncle Silas, poor thing, he give a groan right out so\r\n     everybody heard him.  Then Brace he went on, \"Saturday,\r\n     September 2d, he didn't come home to supper. By-and-by I got a\r\n     little uneasy, and one of my niggers went over to this\r\n     prisoner's place, but come back and said he warn't there.  So\r\n     I got uneasier and uneasier, and couldn't rest.  I went to\r\n     bed, but I couldn't sleep; and turned out, away late in the\r\n     night, and went wandering over to this prisoner's place and\r\n     all around about there a good while, hoping I would run across\r\n     my poor brother, and never knowing he was out of his troubles\r\n     and gone to a better shore--\" So he broke down and choked up\r\n     again, and most all the women was crying now.  Pretty soon he\r\n     got another start and says: \"But it warn't no use; so at last\r\n     I went home and tried to get some sleep, but couldn't. Well,\r\n     in a day or two everybody was uneasy, and they got to talking\r\n     about this prisoner's threats, and took to the idea, which I\r\n     didn't take no stock in, that my brother was murdered so they\r\n     hunted around and tried to find his body, but couldn't and\r\n     give it up.  And so I reckoned he was gone off somers to have\r\n     a little peace, and would come back to us when his troubles\r\n     was kind of healed.  But late Saturday night, the 9th, Lem\r\n     Beebe and Jim Lane come to my house and told me all--told me\r\n     the whole awful 'sassination, and my heart was broke. And THEN\r\n     I remembered something that hadn't took no hold of me at the\r\n     time, because reports said this prisoner had took to walking\r\n     in his sleep and doing all kind of things of no consequence,\r\n     not knowing what he was about.  I will tell you what that\r\n     thing was that come back into my memory. Away late that awful\r\n     Saturday night when I was wandering around about this\r\n     prisoner's place, grieving and troubled, I was down by the\r\n     corner of the tobacker-field and I heard a sound like digging\r\n     in a gritty soil; and I crope nearer and peeped through the\r\n     vines that hung on the rail fence and seen this prisoner\r\n     SHOVELING--shoveling with a long-handled shovel--heaving earth\r\n     into a big hole that was most filled up; his back was to me,\r\n     but it was bright moonlight and I knowed him by his old green\r\n     baize work-gown with a splattery white patch in the middle of\r\n     the back like somebody had hit him with a snowball. HE WAS\r\n     BURYING THE MAN HE'D MURDERED!\"\r\n\r\nAnd he slumped down in his chair crying and sobbing, and 'most everybody\r\nin the house busted out wailing, and crying, and saying, \"Oh, it's\r\nawful--awful--horrible!\" and there was a most tremendous excitement, and\r\nyou couldn't hear yourself think; and right in the midst of it up jumps\r\nold Uncle Silas, white as a sheet, and sings out:\r\n\r\n\"IT'S TRUE, EVERY WORD--I MURDERED HIM IN COLD BLOOD!\"\r\n\r\nBy Jackson, it petrified them! People rose up wild all over the house,\r\nstraining and staring for a better look at him, and the judge was\r\nhammering with his mallet and the sheriff yelling \"Order--order in the\r\ncourt--order!\"\r\n\r\nAnd all the while the old man stood there a-quaking and his eyes\r\na-burning, and not looking at his wife and daughter, which was clinging\r\nto him and begging him to keep still, but pawing them off with his hands\r\nand saying he WOULD clear his black soul from crime, he WOULD heave\r\noff this load that was more than he could bear, and he WOULDN'T bear\r\nit another hour! And then he raged right along with his awful tale,\r\neverybody a-staring and gasping, judge, jury, lawyers, and everybody,\r\nand Benny and Aunt Sally crying their hearts out. And by George, Tom\r\nSawyer never looked at him once! Never once--just set there gazing with\r\nall his eyes at something else, I couldn't tell what. And so the old man\r\nraged right along, pouring his words out like a stream of fire:\r\n\r\n\"I killed him! I am guilty! But I never had the notion in my life to\r\nhurt him or harm him, spite of all them lies about my threatening him,\r\ntill the very minute I raised the club--then my heart went cold!--then the\r\npity all went out of it, and I struck to kill! In that one moment all\r\nmy wrongs come into my mind; all the insults that that man and the\r\nscoundrel his brother, there, had put upon me, and how they laid in\r\ntogether to ruin me with the people, and take away my good name, and\r\nDRIVE me to some deed that would destroy me and my family that hadn't\r\never done THEM no harm, so help me God! And they done it in a mean\r\nrevenge--for why? Because my innocent pure girl here at my side wouldn't\r\nmarry that rich, insolent, ignorant coward, Brace Dunlap, who's been\r\nsniveling here over a brother he never cared a brass farthing for--\" [I\r\nsee Tom give a jump and look glad THIS time, to a dead certainty] \"--and\r\nin that moment I've told you about, I forgot my God and remembered only\r\nmy heart's bitterness, God forgive me, and I struck to kill. In one\r\nsecond I was miserably sorry--oh, filled with remorse; but I thought of\r\nmy poor family, and I MUST hide what I'd done for their sakes; and I\r\ndid hide that corpse in the bushes; and presently I carried it to the\r\ntobacker field; and in the deep night I went with my shovel and buried\r\nit where--\"\r\n\r\nUp jumps Tom and shouts:\r\n\r\n\"NOW, I've got it!\" and waves his hand, oh, ever so fine and starchy,\r\ntowards the old man, and says:\r\n\r\n\"Set down! A murder WAS done, but you never had no hand in it!\"\r\n\r\nWell, sir, you could a heard a pin drop. And the old man he sunk down\r\nkind of bewildered in his seat and Aunt Sally and Benny didn't know it,\r\nbecause they was so astonished and staring at Tom with their mouths open\r\nand not knowing what they was about. And the whole house the same. I\r\nnever seen people look so helpless and tangled up, and I hain't ever\r\nseen eyes bug out and gaze without a blink the way theirn did. Tom says,\r\nperfectly ca'm:\r\n\r\n\"Your honor, may I speak?\"\r\n\r\n\"For God's sake, yes--go on!\" says the judge, so astonished and mixed up\r\nhe didn't know what he was about hardly.\r\n\r\nThen Tom he stood there and waited a second or two--that was for to work\r\nup an \"effect,\" as he calls it--then he started in just as ca'm as ever,\r\nand says:\r\n\r\n\"For about two weeks now there's been a little bill sticking on the\r\nfront of this courthouse offering two thousand dollars reward for a\r\ncouple of big di'monds--stole at St. Louis. Them di'monds is worth twelve\r\nthousand dollars. But never mind about that till I get to it. Now about\r\nthis murder. I will tell you all about it--how it happened--who done\r\nit--every DEtail.\"\r\n\r\nYou could see everybody nestle now, and begin to listen for all they was\r\nworth.\r\n\r\n\"This man here, Brace Dunlap, that's been sniveling so about his dead\r\nbrother that YOU know he never cared a straw for, wanted to marry that\r\nyoung girl there, and she wouldn't have him. So he told Uncle Silas he\r\nwould make him sorry. Uncle Silas knowed how powerful he was, and how\r\nlittle chance he had against such a man, and he was scared and worried,\r\nand done everything he could think of to smooth him over and get him to\r\nbe good to him: he even took his no-account brother Jubiter on the farm\r\nand give him wages and stinted his own family to pay them; and Jubiter\r\ndone everything his brother could contrive to insult Uncle Silas, and\r\nfret and worry him, and try to drive Uncle Silas into doing him a hurt,\r\nso as to injure Uncle Silas with the people. And it done it. Everybody\r\nturned against him and said the meanest kind of things about him, and it\r\ngraduly broke his heart--yes, and he was so worried and distressed that\r\noften he warn't hardly in his right mind.\r\n\r\n\"Well, on that Saturday that we've had so much trouble about, two of\r\nthese witnesses here, Lem Beebe and Jim Lane, come along by where Uncle\r\nSilas and Jubiter Dunlap was at work--and that much of what they've said\r\nis true, the rest is lies. They didn't hear Uncle Silas say he would\r\nkill Jubiter; they didn't hear no blow struck; they didn't see no dead\r\nman, and they didn't see Uncle Silas hide anything in the bushes. Look\r\nat them now--how they set there, wishing they hadn't been so handy with\r\ntheir tongues; anyway, they'll wish it before I get done.\r\n\r\n\"That same Saturday evening Bill and Jack Withers DID see one man\r\nlugging off another one. That much of what they said is true, and the\r\nrest is lies. First off they thought it was a nigger stealing Uncle\r\nSilas's corn--you notice it makes them look silly, now, to find out\r\nsomebody overheard them say that. That's because they found out by and\r\nby who it was that was doing the lugging, and THEY know best why they\r\nswore here that they took it for Uncle Silas by the gait--which it\r\nWASN'T, and they knowed it when they swore to that lie.\r\n\r\n\"A man out in the moonlight DID see a murdered person put under ground\r\nin the tobacker field--but it wasn't Uncle Silas that done the burying.\r\nHe was in his bed at that very time.\r\n\r\n\"Now, then, before I go on, I want to ask you if you've ever noticed\r\nthis: that people, when they're thinking deep, or when they're worried,\r\nare most always doing something with their hands, and they don't know\r\nit, and don't notice what it is their hands are doing, some stroke their\r\nchins; some stroke their noses; some stroke up UNDER their chin with\r\ntheir hand; some twirl a chain, some fumble a button, then there's some\r\nthat draws a figure or a letter with their finger on their cheek,\r\nor under their chin or on their under lip. That's MY way. When I'm\r\nrestless, or worried, or thinking hard, I draw capital V's on my cheek\r\nor on my under lip or under my chin, and never anything BUT capital\r\nV's--and half the time I don't notice it and don't know I'm doing it.\"\r\n\r\nThat was odd. That is just what I do; only I make an O. And I could see\r\npeople nodding to one another, same as they do when they mean \"THAT's\r\nso.\"\r\n\r\n\"Now, then, I'll go on. That same Saturday--no, it was the night\r\nbefore--there was a steamboat laying at Flagler's Landing, forty miles\r\nabove here, and it was raining and storming like the nation. And there\r\nwas a thief aboard, and he had them two big di'monds that's advertised\r\nout here on this courthouse door; and he slipped ashore with his\r\nhand-bag and struck out into the dark and the storm, and he was a-hoping\r\nhe could get to this town all right and be safe. But he had two pals\r\naboard the boat, hiding, and he knowed they was going to kill him the\r\nfirst chance they got and take the di'monds; because all three stole\r\nthem, and then this fellow he got hold of them and skipped.\r\n\r\n\"Well, he hadn't been gone more'n ten minutes before his pals found it\r\nout, and they jumped ashore and lit out after him. Prob'ly they burnt\r\nmatches and found his tracks. Anyway, they dogged along after him all\r\nday Saturday and kept out of his sight; and towards sundown he come to\r\nthe bunch of sycamores down by Uncle Silas's field, and he went in there\r\nto get a disguise out of his hand-bag and put it on before he showed\r\nhimself here in the town--and mind you he done that just a little after\r\nthe time that Uncle Silas was hitting Jubiter Dunlap over the head with\r\na club--for he DID hit him.\r\n\r\n\"But the minute the pals see that thief slide into the bunch of\r\nsycamores, they jumped out of the bushes and slid in after him.\r\n\r\n\"They fell on him and clubbed him to death.\r\n\r\n\"Yes, for all he screamed and howled so, they never had no mercy on him,\r\nbut clubbed him to death. And two men that was running along the road\r\nheard him yelling that way, and they made a rush into the sycamore\r\nbunch--which was where they was bound for, anyway--and when the pals saw\r\nthem they lit out and the two new men after them a-chasing them as\r\ntight as they could go. But only a minute or two--then these two new men\r\nslipped back very quiet into the sycamores.\r\n\r\n\"THEN what did they do? I will tell you what they done. They found where\r\nthe thief had got his disguise out of his carpet-sack to put on; so one\r\nof them strips and puts on that disguise.\"\r\n\r\nTom waited a little here, for some more \"effect\"--then he says, very\r\ndeliberate:\r\n\r\n\"The man that put on that dead man's disguise was--JUBITER DUNLAP!\"\r\n\r\n\"Great Scott!\" everybody shouted, all over the house, and old Uncle\r\nSilas he looked perfectly astonished.\r\n\r\n\"Yes, it was Jubiter Dunlap. Not dead, you see. Then they pulled off the\r\ndead man's boots and put Jubiter Dunlap's old ragged shoes on the corpse\r\nand put the corpse's boots on Jubiter Dunlap. Then Jubiter Dunlap\r\nstayed where he was, and the other man lugged the dead body off in the\r\ntwilight; and after midnight he went to Uncle Silas's house, and took\r\nhis old green work-robe off of the peg where it always hangs in the\r\npassage betwixt the house and the kitchen and put it on, and stole the\r\nlong-handled shovel and went off down into the tobacker field and buried\r\nthe murdered man.\"\r\n\r\nHe stopped, and stood half a minute. Then--\"And who do you reckon the\r\nmurdered man WAS? It was--JAKE Dunlap, the long-lost burglar!\"\r\n\r\n\"Great Scott!\"\r\n\r\n\"And the man that buried him was--BRACE Dunlap, his brother!\"\r\n\r\n\"Great Scott!\"\r\n\r\n\"And who do you reckon is this mowing idiot here that's letting on all\r\nthese weeks to be a deef and dumb stranger? It's--JUBITER Dunlap!\"\r\n\r\nMy land, they all busted out in a howl, and you never see the like of\r\nthat excitement since the day you was born. And Tom he made a jump for\r\nJubiter and snaked off his goggles and his false whiskers, and there was\r\nthe murdered man, sure enough, just as alive as anybody! And Aunt Sally\r\nand Benny they went to hugging and crying and kissing and smothering old\r\nUncle Silas to that degree he was more muddled and confused and mushed\r\nup in his mind than he ever was before, and that is saying considerable.\r\nAnd next, people begun to yell:\r\n\r\n\"Tom Sawyer! Tom Sawyer! Shut up everybody, and let him go on! Go on,\r\nTom Sawyer!\"\r\n\r\nWhich made him feel uncommon bully, for it was nuts for Tom Sawyer to be\r\na public character that-away, and a hero, as he calls it. So when it was\r\nall quiet, he says:\r\n\r\n\"There ain't much left, only this. When that man there, Bruce Dunlap,\r\nhad most worried the life and sense out of Uncle Silas till at last he\r\nplumb lost his mind and hit this other blatherskite, his brother, with a\r\nclub, I reckon he seen his chance. Jubiter broke for the woods to hide,\r\nand I reckon the game was for him to slide out, in the night, and leave\r\nthe country. Then Brace would make everybody believe Uncle Silas killed\r\nhim and hid his body somers; and that would ruin Uncle Silas and drive\r\nHIM out of the country--hang him, maybe; I dunno. But when they found\r\ntheir dead brother in the sycamores without knowing him, because he was\r\nso battered up, they see they had a better thing; disguise BOTH and bury\r\nJake and dig him up presently all dressed up in Jubiter's clothes, and\r\nhire Jim Lane and Bill Withers and the others to swear to some handy\r\nlies--which they done. And there they set, now, and I told them they\r\nwould be looking sick before I got done, and that is the way they're\r\nlooking now.\r\n\r\n\"Well, me and Huck Finn here, we come down on the boat with the thieves,\r\nand the dead one told us all about the di'monds, and said the others\r\nwould murder him if they got the chance; and we was going to help him\r\nall we could. We was bound for the sycamores when we heard them killing\r\nhim in there; but we was in there in the early morning after the storm\r\nand allowed nobody hadn't been killed, after all. And when we see\r\nJubiter Dunlap here spreading around in the very same disguise Jake told\r\nus HE was going to wear, we thought it was Jake his own self--and he was\r\ngoo-gooing deef and dumb, and THAT was according to agreement.\r\n\r\n\"Well, me and Huck went on hunting for the corpse after the others quit,\r\nand we found it. And was proud, too; but Uncle Silas he knocked us crazy\r\nby telling us HE killed the man. So we was mighty sorry we found the\r\nbody, and was bound to save Uncle Silas's neck if we could; and it was\r\ngoing to be tough work, too, because he wouldn't let us break him out of\r\nprison the way we done with our old nigger Jim.\r\n\r\n\"I done everything I could the whole month to think up some way to save\r\nUncle Silas, but I couldn't strike a thing. So when we come into court\r\nto-day I come empty, and couldn't see no chance anywheres. But by and\r\nby I had a glimpse of something that set me thinking--just a little wee\r\nglimpse--only that, and not enough to make sure; but it set me thinking\r\nhard--and WATCHING, when I was only letting on to think; and by and\r\nby, sure enough, when Uncle Silas was piling out that stuff about HIM\r\nkilling Jubiter Dunlap, I catched that glimpse again, and this time I\r\njumped up and shut down the proceedings, because I KNOWED Jubiter Dunlap\r\nwas a-setting here before me. I knowed him by a thing which I seen him\r\ndo--and I remembered it. I'd seen him do it when I was here a year ago.\"\r\n\r\nHe stopped then, and studied a minute--laying for an \"effect\"--I knowed\r\nit perfectly well. Then he turned off like he was going to leave the\r\nplatform, and says, kind of lazy and indifferent:\r\n\r\n\"Well, I believe that is all.\"\r\n\r\nWhy, you never heard such a howl!--and it come from the whole house:\r\n\r\n\"What WAS it you seen him do? Stay where you are, you little devil! You\r\nthink you are going to work a body up till his mouth's a-watering and\r\nstop there? What WAS it he done?\"\r\n\r\nThat was it, you see--he just done it to get an \"effect\"; you couldn't\r\n'a' pulled him off of that platform with a yoke of oxen.\r\n\r\n\"Oh, it wasn't anything much,\" he says. \"I seen him looking a little\r\nexcited when he found Uncle Silas was actually fixing to hang himself\r\nfor a murder that warn't ever done; and he got more and more nervous and\r\nworried, I a-watching him sharp but not seeming to look at him--and all\r\nof a sudden his hands begun to work and fidget, and pretty soon his\r\nleft crept up and HIS FINGER DRAWED A CROSS ON HIS CHEEK, and then I HAD\r\nhim!\"\r\n\r\nWell, then they ripped and howled and stomped and clapped their hands\r\ntill Tom Sawyer was that proud and happy he didn't know what to do with\r\nhimself.\r\n\r\nAnd then the judge he looked down over his pulpit and says:\r\n\r\n\"My boy, did you SEE all the various details of this strange conspiracy\r\nand tragedy that you've been describing?\"\r\n\r\n\"No, your honor, I didn't see any of them.\"\r\n\r\n\"Didn't see any of them! Why, you've told the whole history straight\r\nthrough, just the same as if you'd seen it with your eyes. How did you\r\nmanage that?\"\r\n\r\nTom says, kind of easy and comfortable:\r\n\r\n\"Oh, just noticing the evidence and piecing this and that together, your\r\nhonor; just an ordinary little bit of detective work; anybody could 'a'\r\ndone it.\"\r\n\r\n\"Nothing of the kind! Not two in a million could 'a' done it. You are a\r\nvery remarkable boy.\"\r\n\r\nThen they let go and give Tom another smashing round, and he--well, he\r\nwouldn't 'a' sold out for a silver mine. Then the judge says:\r\n\r\n\"But are you certain you've got this curious history straight?\"\r\n\r\n\"Perfectly, your honor. Here is Brace Dunlap--let him deny his share\r\nof it if he wants to take the chance; I'll engage to make him wish he\r\nhadn't said anything...... Well, you see HE'S pretty quiet. And his\r\nbrother's pretty quiet, and them four witnesses that lied so and got\r\npaid for it, they're pretty quiet. And as for Uncle Silas, it ain't any\r\nuse for him to put in his oar, I wouldn't believe him under oath!\"\r\n\r\nWell, sir, that fairly made them shout; and even the judge he let go\r\nand laughed. Tom he was just feeling like a rainbow. When they was done\r\nlaughing he looks up at the judge and says:\r\n\r\n\"Your honor, there's a thief in this house.\"\r\n\r\n\"A thief?\"\r\n\r\n\"Yes, sir. And he's got them twelve-thousand-dollar di'monds on him.\"\r\n\r\nBy gracious, but it made a stir! Everybody went shouting:\r\n\r\n\"Which is him? which is him? p'int him out!\"\r\n\r\nAnd the judge says:\r\n\r\n\"Point him out, my lad. Sheriff, you will arrest him. Which one is it?\"\r\n\r\nTom says:\r\n\r\n\"This late dead man here--Jubiter Dunlap.\"\r\n\r\nThen there was another thundering let-go of astonishment and excitement;\r\nbut Jubiter, which was astonished enough before, was just fairly\r\nputrified with astonishment this time. And he spoke up, about half\r\ncrying, and says:\r\n\r\n\"Now THAT'S a lie. Your honor, it ain't fair; I'm plenty bad enough\r\nwithout that. I done the other things--Brace he put me up to it, and\r\npersuaded me, and promised he'd make me rich, some day, and I done it,\r\nand I'm sorry I done it, and I wisht I hadn't; but I hain't stole no\r\ndi'monds, and I hain't GOT no di'monds; I wisht I may never stir if it\r\nain't so. The sheriff can search me and see.\"\r\n\r\nTom says:\r\n\r\n\"Your honor, it wasn't right to call him a thief, and I'll let up on\r\nthat a little. He did steal the di'monds, but he didn't know it. He\r\nstole them from his brother Jake when he was laying dead, after Jake\r\nhad stole them from the other thieves; but Jubiter didn't know he was\r\nstealing them; and he's been swelling around here with them a month;\r\nyes, sir, twelve thousand dollars' worth of di'monds on him--all that\r\nriches, and going around here every day just like a poor man. Yes, your\r\nhonor, he's got them on him now.\"\r\n\r\nThe judge spoke up and says:\r\n\r\n\"Search him, sheriff.\"\r\n\r\nWell, sir, the sheriff he ransacked him high and low, and everywhere:\r\nsearched his hat, socks, seams, boots, everything--and Tom he stood there\r\nquiet, laying for another of them effects of hisn. Finally the sheriff\r\nhe give it up, and everybody looked disappointed, and Jubiter says:\r\n\r\n\"There, now! what'd I tell you?\"\r\n\r\nAnd the judge says:\r\n\r\n\"It appears you were mistaken this time, my boy.\"\r\n\r\nThen Tom took an attitude and let on to be studying with all his might,\r\nand scratching his head. Then all of a sudden he glanced up chipper, and\r\nsays:\r\n\r\n\"Oh, now I've got it! I'd forgot.\"\r\n\r\nWhich was a lie, and I knowed it. Then he says:\r\n\r\n\"Will somebody be good enough to lend me a little small screwdriver?\r\nThere was one in your brother's hand-bag that you smouched, Jubiter, but\r\nI reckon you didn't fetch it with you.\"\r\n\r\n\"No, I didn't. I didn't want it, and I give it away.\"\r\n\r\n\"That's because you didn't know what it was for.\"\r\n\r\nJubiter had his boots on again, by now, and when the thing Tom wanted\r\nwas passed over the people's heads till it got to him, he says to\r\nJubiter:\r\n\r\n\"Put up your foot on this chair.\" And he kneeled down and begun to\r\nunscrew the heel-plate, everybody watching; and when he got that big\r\ndi'mond out of that boot-heel and held it up and let it flash and blaze\r\nand squirt sunlight everwhichaway, it just took everybody's breath; and\r\nJubiter he looked so sick and sorry you never see the like of it. And\r\nwhen Tom held up the other di'mond he looked sorrier than ever. Land! he\r\nwas thinking how he would 'a' skipped out and been rich and independent\r\nin a foreign land if he'd only had the luck to guess what the\r\nscrewdriver was in the carpet-bag for.\r\n\r\nWell, it was a most exciting time, take it all around, and Tom got cords\r\nof glory. The judge took the di'monds, and stood up in his pulpit, and\r\ncleared his throat, and shoved his spectacles back on his head, and\r\nsays:\r\n\r\n\"I'll keep them and notify the owners; and when they send for them it\r\nwill be a real pleasure to me to hand you the two thousand dollars,\r\nfor you've earned the money--yes, and you've earned the deepest and most\r\nsincerest thanks of this community besides, for lifting a wronged and\r\ninnocent family out of ruin and shame, and saving a good and honorable\r\nman from a felon's death, and for exposing to infamy and the punishment\r\nof the law a cruel and odious scoundrel and his miserable creatures!\"\r\n\r\nWell, sir, if there'd been a brass band to bust out some music, then, it\r\nwould 'a' been just the perfectest thing I ever see, and Tom Sawyer he\r\nsaid the same.\r\n\r\nThen the sheriff he nabbed Brace Dunlap and his crowd, and by and by\r\nnext month the judge had them up for trial and jailed the whole lot. And\r\neverybody crowded back to Uncle Silas's little old church, and was ever\r\nso loving and kind to him and the family and couldn't do enough for\r\nthem; and Uncle Silas he preached them the blamedest jumbledest idiotic\r\nsermons you ever struck, and would tangle you up so you couldn't find\r\nyour way home in daylight; but the people never let on but what they\r\nthought it was the clearest and brightest and elegantest sermons that\r\never was; and they would set there and cry, for love and pity; but, by\r\nGeorge, they give me the jim-jams and the fan-tods and caked up what\r\nbrains I had, and turned them solid; but by and by they loved the old\r\nman's intellects back into him again, and he was as sound in his skull\r\nas ever he was, which ain't no flattery, I reckon. And so the whole\r\nfamily was as happy as birds, and nobody could be gratefuler and\r\nlovinger than what they was to Tom Sawyer; and the same to me, though\r\nI hadn't done nothing. And when the two thousand dollars come, Tom give\r\nhalf of it to me, and never told anybody so, which didn't surprise me,\r\nbecause I knowed him.\r\n\r\n\r\n\r\n\r\n\r\nEnd of the Project Gutenberg EBook of Tom Sawyer, Detective, by Mark\r\nTwain (Samuel Clemens)\r\n",
    "textIndexes": {
        "header": 20,
        "footer": 2539
    },
    "buildPath": "./json//pg93.json",
    "wordcount": 24448
}