{
    "id": "94",
    "formats": [
        {
            "format": "application/epub+zip",
            "fileName": "94.epub.images",
            "filePath": "http://www.gutenberg.org/ebooks/94.epub.images",
            "extension": "images"
        },
        {
            "format": "application/epub+zip",
            "fileName": "94.epub.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/94.epub.noimages",
            "extension": "noimages"
        },
        {
            "format": "application/zip",
            "fileName": "94/94-h.zip",
            "filePath": "http://www.gutenberg.org/files/94/94-h.zip",
            "extension": "zip"
        },
        {
            "format": "text/plain; charset=us-ascii",
            "fileName": "94/94.txt",
            "filePath": "http://www.gutenberg.org/files/94/94.txt",
            "extension": "txt"
        },
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "94.kindle.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/94.kindle.noimages",
            "extension": "noimages"
        },
        {
            "format": "text/plain",
            "fileName": "94.txt.utf-8",
            "filePath": "http://www.gutenberg.org/ebooks/94.txt.utf-8",
            "extension": "utf-8"
        },
        {
            "format": "text/html; charset=us-ascii",
            "fileName": "94/94-h/94-h.htm",
            "filePath": "http://www.gutenberg.org/files/94/94-h/94-h.htm",
            "extension": "htm"
        },
        {
            "format": "application/rdf+xml",
            "fileName": "94.rdf",
            "filePath": "http://www.gutenberg.org/ebooks/94.rdf",
            "extension": "rdf"
        },
        {
            "format": "text/plain; charset=us-ascii",
            "fileName": "94/94.zip",
            "filePath": "http://www.gutenberg.org/files/94/94.zip",
            "extension": "zip"
        },
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "94.kindle.images",
            "filePath": "http://www.gutenberg.org/ebooks/94.kindle.images",
            "extension": "images"
        }
    ],
    "languages": [
        "en"
    ],
    "title": [
        "Alexander's Bridge"
    ],
    "author": "Cather, Willa",
    "issued": "2006-03-08",
    "text": "*** START OF THIS PROJECT GUTENBERG EBOOK ALEXANDER'S BRIDGE ***\r\n\r\n\r\n\r\n\r\nProduced by An Anonymous Volunteer and David Widger\r\n\r\n\r\n\r\n\r\n\r\nALEXANDER'S BRIDGE\r\n\r\nby Willa Cather\r\n\r\n\r\n\r\n\r\nALEXANDER'S BRIDGE  by Willa Cather\r\n\r\n\r\n\r\n\r\nCHAPTER I\r\n\r\n\r\nLate one brilliant April afternoon Professor Lucius Wilson stood at the\r\nhead of Chestnut Street, looking about him with the pleased air of a man\r\nof taste who does not very often get to Boston. He had lived there as a\r\nstudent, but for twenty years and more, since he had been Professor of\r\nPhilosophy in a Western university, he had seldom come East except to\r\ntake a steamer for some foreign port. Wilson was standing quite still,\r\ncontemplating with a whimsical smile the slanting street, with its worn\r\npaving, its irregular, gravely colored houses, and the row of naked\r\ntrees on which the thin sunlight was still shining. The gleam of the\r\nriver at the foot of the hill made him blink a little, not so much\r\nbecause it was too bright as because he found it so pleasant. The few\r\npassers-by glanced at him unconcernedly, and even the children who\r\nhurried along with their school-bags under their arms seemed to find it\r\nperfectly natural that a tall brown gentleman should be standing there,\r\nlooking up through his glasses at the gray housetops.\r\n\r\nThe sun sank rapidly; the silvery light had faded from the bare boughs\r\nand the watery twilight was setting in when Wilson at last walked down\r\nthe hill, descending into cooler and cooler depths of grayish shadow.\r\nHis nostril, long unused to it, was quick to detect the smell of wood\r\nsmoke in the air, blended with the odor of moist spring earth and the\r\nsaltiness that came up the river with the tide. He crossed Charles\r\nStreet between jangling street cars and shelving lumber drays, and after\r\na moment of uncertainty wound into Brimmer Street. The street was quiet,\r\ndeserted, and hung with a thin bluish haze. He had already fixed his\r\nsharp eye upon the house which he reasoned should be his objective\r\npoint, when he noticed a woman approaching rapidly from the opposite\r\ndirection. Always an interested observer of women, Wilson would have\r\nslackened his pace anywhere to follow this one with his impersonal,\r\nappreciative glance. She was a person of distinction he saw at once,\r\nand, moreover, very handsome. She was tall, carried her beautiful head\r\nproudly, and moved with ease and certainty. One immediately took for\r\ngranted the costly privileges and fine spaces that must lie in the\r\nbackground from which such a figure could emerge with this rapid and\r\nelegant gait. Wilson noted her dress, too,--for, in his way, he had an\r\neye for such things,--particularly her brown furs and her hat. He got\r\na blurred impression of her fine color, the violets she wore, her white\r\ngloves, and, curiously enough, of her veil, as she turned up a flight of\r\nsteps in front of him and disappeared.\r\n\r\nWilson was able to enjoy lovely things that passed him on the wing as\r\ncompletely and deliberately as if they had been dug-up marvels, long\r\nanticipated, and definitely fixed at the end of a railway journey. For\r\na few pleasurable seconds he quite forgot where he was going, and only\r\nafter the door had closed behind her did he realize that the young woman\r\nhad entered the house to which he had directed his trunk from the South\r\nStation that morning. He hesitated a moment before mounting the steps.\r\n\"Can that,\" he murmured in amazement,--\"can that possibly have been Mrs.\r\nAlexander?\"\r\n\r\nWhen the servant admitted him, Mrs. Alexander was still standing in the\r\nhallway. She heard him give his name, and came forward holding out her\r\nhand.\r\n\r\n\"Is it you, indeed, Professor Wilson? I was afraid that you might get\r\nhere before I did. I was detained at a concert, and Bartley telephoned\r\nthat he would be late. Thomas will show you your room. Had you rather\r\nhave your tea brought to you there, or will you have it down here with\r\nme, while we wait for Bartley?\"\r\n\r\nWilson was pleased to find that he had been the cause of her rapid walk,\r\nand with her he was even more vastly pleased than before. He followed\r\nher through the drawing-room into the library, where the wide back\r\nwindows looked out upon the garden and the sunset and a fine stretch\r\nof silver-colored river. A harp-shaped elm stood stripped against the\r\npale-colored evening sky, with ragged last year's birds' nests in its\r\nforks, and through the bare branches the evening star quivered in the\r\nmisty air. The long brown room breathed the peace of a rich and amply\r\nguarded quiet. Tea was brought in immediately and placed in front of the\r\nwood fire. Mrs. Alexander sat down in a high-backed chair and began to\r\npour it, while Wilson sank into a low seat opposite her and took his cup\r\nwith a great sense of ease and harmony and comfort.\r\n\r\n\"You have had a long journey, haven't you?\" Mrs. Alexander asked, after\r\nshowing gracious concern about his tea. \"And I am so sorry Bartley is\r\nlate. He's often tired when he's late. He flatters himself that it is\r\na little on his account that you have come to this Congress of\r\nPsychologists.\"\r\n\r\n\"It is,\" Wilson assented, selecting his muffin carefully; \"and I hope he\r\nwon't be tired tonight. But, on my own account, I'm glad to have a few\r\nmoments alone with you, before Bartley comes. I was somehow afraid that\r\nmy knowing him so well would not put me in the way of getting to know\r\nyou.\"\r\n\r\n\"That's very nice of you.\" She nodded at him above her cup and smiled,\r\nbut there was a little formal tightness in her tone which had not been\r\nthere when she greeted him in the hall.\r\n\r\nWilson leaned forward. \"Have I said something awkward? I live very far\r\nout of the world, you know. But I didn't mean that you would exactly\r\nfade dim, even if Bartley were here.\"\r\n\r\nMrs. Alexander laughed relentingly. \"Oh, I'm not so vain! How terribly\r\ndiscerning you are.\"\r\n\r\nShe looked straight at Wilson, and he felt that this quick, frank glance\r\nbrought about an understanding between them.\r\n\r\nHe liked everything about her, he told himself, but he particularly\r\nliked her eyes; when she looked at one directly for a moment they were\r\nlike a glimpse of fine windy sky that may bring all sorts of weather.\r\n\r\n\"Since you noticed something,\" Mrs. Alexander went on, \"it must have\r\nbeen a flash of the distrust I have come to feel whenever I meet any of\r\nthe people who knew Bartley when he was a boy. It is always as if they\r\nwere talking of someone I had never met. Really, Professor Wilson, it\r\nwould seem that he grew up among the strangest people. They usually say\r\nthat he has turned out very well, or remark that he always was a fine\r\nfellow. I never know what reply to make.\"\r\n\r\nWilson chuckled and leaned back in his chair, shaking his left foot\r\ngently. \"I expect the fact is that we none of us knew him very well,\r\nMrs. Alexander. Though I will say for myself that I was always confident\r\nhe'd do something extraordinary.\"\r\n\r\nMrs. Alexander's shoulders gave a slight movement, suggestive of\r\nimpatience. \"Oh, I should think that might have been a safe prediction.\r\nAnother cup, please?\"\r\n\r\n\"Yes, thank you. But predicting, in the case of boys, is not so easy as\r\nyou might imagine, Mrs. Alexander. Some get a bad hurt early and lose\r\ntheir courage; and some never get a fair wind. Bartley\"--he dropped his\r\nchin on the back of his long hand and looked at her admiringly--\"Bartley\r\ncaught the wind early, and it has sung in his sails ever since.\"\r\n\r\nMrs. Alexander sat looking into the fire with intent preoccupation, and\r\nWilson studied her half-averted face. He liked the suggestion of stormy\r\npossibilities in the proud curve of her lip and nostril. Without that,\r\nhe reflected, she would be too cold.\r\n\r\n\"I should like to know what he was really like when he was a boy. I\r\ndon't believe he remembers,\" she said suddenly. \"Won't you smoke, Mr.\r\nWilson?\"\r\n\r\nWilson lit a cigarette. \"No, I don't suppose he does. He was never\r\nintrospective. He was simply the most tremendous response to stimuli I\r\nhave ever known. We didn't know exactly what to do with him.\"\r\n\r\nA servant came in and noiselessly removed the tea-tray. Mrs. Alexander\r\nscreened her face from the firelight, which was beginning to throw\r\nwavering bright spots on her dress and hair as the dusk deepened.\r\n\r\n\"Of course,\" she said, \"I now and again hear stories about things that\r\nhappened when he was in college.\"\r\n\r\n\"But that isn't what you want.\" Wilson wrinkled his brows and looked at\r\nher with the smiling familiarity that had come about so quickly. \"What\r\nyou want is a picture of him, standing back there at the other end of\r\ntwenty years. You want to look down through my memory.\"\r\n\r\nShe dropped her hands in her lap. \"Yes, yes; that's exactly what I\r\nwant.\"\r\n\r\nAt this moment they heard the front door shut with a jar, and Wilson\r\nlaughed as Mrs. Alexander rose quickly. \"There he is. Away with\r\nperspective! No past, no future for Bartley; just the fiery moment. The\r\nonly moment that ever was or will be in the world!\"\r\n\r\nThe door from the hall opened, a voice called \"Winifred?\" hurriedly,\r\nand a big man came through the drawing-room with a quick, heavy tread,\r\nbringing with him a smell of cigar smoke and chill out-of-doors air.\r\nWhen Alexander reached the library door, he switched on the lights\r\nand stood six feet and more in the archway, glowing with strength\r\nand cordiality and rugged, blond good looks. There were other\r\nbridge-builders in the world, certainly, but it was always Alexander's\r\npicture that the Sunday Supplement men wanted, because he looked as a\r\ntamer of rivers ought to look. Under his tumbled sandy hair his head\r\nseemed as hard and powerful as a catapult, and his shoulders looked\r\nstrong enough in themselves to support a span of any one of his ten\r\ngreat bridges that cut the air above as many rivers.\r\n\r\n\r\nAfter dinner Alexander took Wilson up to his study. It was a large room\r\nover the library, and looked out upon the black river and the row of\r\nwhite lights along the Cambridge Embankment. The room was not at all\r\nwhat one might expect of an engineer's study. Wilson felt at once\r\nthe harmony of beautiful things that have lived long together without\r\nobtrusions of ugliness or change. It was none of Alexander's doing, of\r\ncourse; those warm consonances of color had been blending and mellowing\r\nbefore he was born. But the wonder was that he was not out of place\r\nthere,--that it all seemed to glow like the inevitable background for\r\nhis vigor and vehemence. He sat before the fire, his shoulders deep in\r\nthe cushions of his chair, his powerful head upright, his hair rumpled\r\nabove his broad forehead. He sat heavily, a cigar in his large, smooth\r\nhand, a flush of after-dinner color in his face, which wind and sun and\r\nexposure to all sorts of weather had left fair and clear-skinned.\r\n\r\n\"You are off for England on Saturday, Bartley, Mrs. Alexander tells me.\"\r\n\r\n\"Yes, for a few weeks only. There's a meeting of British engineers, and\r\nI'm doing another bridge in Canada, you know.\"\r\n\r\n\"Oh, every one knows about that. And it was in Canada that you met your\r\nwife, wasn't it?\"\r\n\r\n\"Yes, at Allway. She was visiting her great-aunt there. A most remarkable\r\nold lady. I was working with MacKeller then, an old Scotch engineer who\r\nhad picked me up in London and taken me back to Quebec with him. He had\r\nthe contract for the Allway Bridge, but before he began work on it he\r\nfound out that he was going to die, and he advised the committee to turn\r\nthe job over to me. Otherwise I'd never have got anything good so early.\r\nMacKeller was an old friend of Mrs. Pemberton, Winifred's aunt. He had\r\nmentioned me to her, so when I went to Allway she asked me to come to\r\nsee her. She was a wonderful old lady.\"\r\n\r\n\"Like her niece?\" Wilson queried.\r\n\r\nBartley laughed. \"She had been very handsome, but not in Winifred's way.\r\nWhen I knew her she was little and fragile, very pink and white, with\r\na splendid head and a face like fine old lace, somehow,--but perhaps I\r\nalways think of that because she wore a lace scarf on her hair. She had\r\nsuch a flavor of life about her. She had known Gordon and Livingstone\r\nand Beaconsfield when she was young,--every one. She was the first woman\r\nof that sort I'd ever known. You know how it is in the West,--old people\r\nare poked out of the way. Aunt Eleanor fascinated me as few young women\r\nhave ever done. I used to go up from the works to have tea with her, and\r\nsit talking to her for hours. It was very stimulating, for she couldn't\r\ntolerate stupidity.\"\r\n\r\n\"It must have been then that your luck began, Bartley,\" said Wilson,\r\nflicking his cigar ash with his long finger. \"It's curious, watching\r\nboys,\" he went on reflectively. \"I'm sure I did you justice in the\r\nmatter of ability. Yet I always used to feel that there was a weak spot\r\nwhere some day strain would tell. Even after you began to climb, I stood\r\ndown in the crowd and watched you with--well, not with confidence. The\r\nmore dazzling the front you presented, the higher your facade rose, the\r\nmore I expected to see a big crack zigzagging from top to bottom,\"--he\r\nindicated its course in the air with his forefinger,--\"then a crash and\r\nclouds of dust. It was curious. I had such a clear picture of it. And\r\nanother curious thing, Bartley,\" Wilson spoke with deliberateness and\r\nsettled deeper into his chair, \"is that I don't feel it any longer. I am\r\nsure of you.\"\r\n\r\nAlexander laughed. \"Nonsense! It's not I you feel sure of; it's\r\nWinifred. People often make that mistake.\"\r\n\r\n\"No, I'm serious, Alexander. You've changed. You have decided to leave\r\nsome birds in the bushes. You used to want them all.\"\r\n\r\nAlexander's chair creaked. \"I still want a good many,\" he said rather\r\ngloomily. \"After all, life doesn't offer a man much. You work like the\r\ndevil and think you're getting on, and suddenly you discover that you've\r\nonly been getting yourself tied up. A million details drink you dry.\r\nYour life keeps going for things you don't want, and all the while\r\nyou are being built alive into a social structure you don't care a rap\r\nabout. I sometimes wonder what sort of chap I'd have been if I hadn't\r\nbeen this sort; I want to go and live out his potentialities, too. I\r\nhaven't forgotten that there are birds in the bushes.\"\r\n\r\nBartley stopped and sat frowning into the fire, his shoulders thrust\r\nforward as if he were about to spring at something. Wilson watched him,\r\nwondering. His old pupil always stimulated him at first, and then vastly\r\nwearied him. The machinery was always pounding away in this man, and\r\nWilson preferred companions of a more reflective habit of mind. He could\r\nnot help feeling that there were unreasoning and unreasonable activities\r\ngoing on in Alexander all the while; that even after dinner, when most\r\nmen achieve a decent impersonality, Bartley had merely closed the door\r\nof the engine-room and come up for an airing. The machinery itself was\r\nstill pounding on.\r\n\r\nBartley's abstraction and Wilson's reflections were cut short by a\r\nrustle at the door, and almost before they could rise Mrs. Alexander was\r\nstanding by the hearth. Alexander brought a chair for her, but she shook\r\nher head.\r\n\r\n\"No, dear, thank you. I only came in to see whether you and Professor\r\nWilson were quite comfortable. I am going down to the music-room.\"\r\n\r\n\"Why not practice here? Wilson and I are growing very dull. We are tired\r\nof talk.\"\r\n\r\n\"Yes, I beg you, Mrs. Alexander,\" Wilson began, but he got no further.\r\n\r\n\"Why, certainly, if you won't find me too noisy. I am working on the\r\nSchumann `Carnival,' and, though I don't practice a great many hours,\r\nI am very methodical,\" Mrs. Alexander explained, as she crossed to an\r\nupright piano that stood at the back of the room, near the windows.\r\n\r\nWilson followed, and, having seen her seated, dropped into a chair\r\nbehind her. She played brilliantly and with great musical feeling.\r\nWilson could not imagine her permitting herself to do anything badly,\r\nbut he was surprised at the cleanness of her execution. He wondered how\r\na woman with so many duties had managed to keep herself up to a standard\r\nreally professional. It must take a great deal of time, certainly, and\r\nBartley must take a great deal of time. Wilson reflected that he had\r\nnever before known a woman who had been able, for any considerable\r\nwhile, to support both a personal and an intellectual passion. Sitting\r\nbehind her, he watched her with perplexed admiration, shading his eyes\r\nwith his hand. In her dinner dress she looked even younger than in\r\nstreet clothes, and, for all her composure and self-sufficiency, she\r\nseemed to him strangely alert and vibrating, as if in her, too, there\r\nwere something never altogether at rest. He felt that he knew pretty\r\nmuch what she demanded in people and what she demanded from life, and he\r\nwondered how she squared Bartley. After ten years she must know him;\r\nand however one took him, however much one admired him, one had to admit\r\nthat he simply wouldn't square. He was a natural force, certainly, but\r\nbeyond that, Wilson felt, he was not anything very really or for very\r\nlong at a time.\r\n\r\nWilson glanced toward the fire, where Bartley's profile was still\r\nwreathed in cigar smoke that curled up more and more slowly. His\r\nshoulders were sunk deep in the cushions and one hand hung large and\r\npassive over the arm of his chair. He had slipped on a purple velvet\r\nsmoking-coat. His wife, Wilson surmised, had chosen it. She was clearly\r\nvery proud of his good looks and his fine color. But, with the glow of\r\nan immediate interest gone out of it, the engineer's face looked tired,\r\neven a little haggard. The three lines in his forehead, directly above\r\nthe nose, deepened as he sat thinking, and his powerful head drooped\r\nforward heavily. Although Alexander was only forty-three, Wilson thought\r\nthat beneath his vigorous color he detected the dulling weariness of\r\non-coming middle age.\r\n\r\n\r\nThe next afternoon, at the hour when the river was beginning to\r\nredden under the declining sun, Wilson again found himself facing Mrs.\r\nAlexander at the tea-table in the library.\r\n\r\n\"Well,\" he remarked, when he was bidden to give an account of himself,\r\n\"there was a long morning with the psychologists, luncheon with Bartley\r\nat his club, more psychologists, and here I am. I've looked forward to\r\nthis hour all day.\"\r\n\r\nMrs. Alexander smiled at him across the vapor from the kettle. \"And do\r\nyou remember where we stopped yesterday?\"\r\n\r\n\"Perfectly. I was going to show you a picture. But I doubt whether I\r\nhave color enough in me. Bartley makes me feel a faded monochrome. You\r\ncan't get at the young Bartley except by means of color.\" Wilson paused\r\nand deliberated. Suddenly he broke out: \"He wasn't a remarkable student,\r\nyou know, though he was always strong in higher mathematics. His work\r\nin my own department was quite ordinary. It was as a powerfully equipped\r\nnature that I found him interesting. That is the most interesting thing\r\na teacher can find. It has the fascination of a scientific discovery. We\r\ncome across other pleasing and endearing qualities so much oftener than\r\nwe find force.\"\r\n\r\n\"And, after all,\" said Mrs. Alexander, \"that is the thing we all live\r\nupon. It is the thing that takes us forward.\"\r\n\r\nWilson thought she spoke a little wistfully. \"Exactly,\" he assented\r\nwarmly. \"It builds the bridges into the future, over which the feet of\r\nevery one of us will go.\"\r\n\r\n\"How interested I am to hear you put it in that way. The bridges into\r\nthe future--I often say that to myself. Bartley's bridges always seem to\r\nme like that. Have you ever seen his first suspension bridge in Canada,\r\nthe one he was doing when I first knew him? I hope you will see it\r\nsometime. We were married as soon as it was finished, and you will laugh\r\nwhen I tell you that it always has a rather bridal look to me. It is\r\nover the wildest river, with mists and clouds always battling about it,\r\nand it is as delicate as a cobweb hanging in the sky. It really was\r\na bridge into the future. You have only to look at it to feel that it\r\nmeant the beginning of a great career. But I have a photograph of it\r\nhere.\" She drew a portfolio from behind a bookcase. \"And there, you see,\r\non the hill, is my aunt's house.\"\r\n\r\nWilson took up the photograph. \"Bartley was telling me something about\r\nyour aunt last night. She must have been a delightful person.\"\r\n\r\nWinifred laughed. \"The bridge, you see, was just at the foot of the\r\nhill, and the noise of the engines annoyed her very much at first. But\r\nafter she met Bartley she pretended to like it, and said it was a good\r\nthing to be reminded that there were things going on in the world. She\r\nloved life, and Bartley brought a great deal of it in to her when\r\nhe came to the house. Aunt Eleanor was very worldly in a frank,\r\nEarly-Victorian manner. She liked men of action, and disliked young\r\nmen who were careful of themselves and who, as she put it, were always\r\ntrimming their wick as if they were afraid of their oil's giving out.\r\nMacKeller, Bartley's first chief, was an old friend of my aunt, and\r\nhe told her that Bartley was a wild, ill-governed youth, which really\r\npleased her very much. I remember we were sitting alone in the dusk\r\nafter Bartley had been there for the first time. I knew that Aunt\r\nEleanor had found him much to her taste, but she hadn't said anything.\r\nPresently she came out, with a chuckle: `MacKeller found him sowing\r\nwild oats in London, I believe. I hope he didn't stop him too soon. Life\r\ncoquets with dashing fellows. The coming men are always like that. We\r\nmust have him to dinner, my dear.' And we did. She grew much fonder\r\nof Bartley than she was of me. I had been studying in Vienna, and she\r\nthought that absurd. She was interested in the army and in politics, and\r\nshe had a great contempt for music and art and philosophy. She used to\r\ndeclare that the Prince Consort had brought all that stuff over out of\r\nGermany. She always sniffed when Bartley asked me to play for him. She\r\nconsidered that a newfangled way of making a match of it.\"\r\n\r\nWhen Alexander came in a few moments later, he found Wilson and his wife\r\nstill confronting the photograph. \"Oh, let us get that out of the way,\"\r\nhe said, laughing. \"Winifred, Thomas can bring my trunk down. I've\r\ndecided to go over to New York to-morrow night and take a fast boat. I\r\nshall save two days.\"\r\n\r\n\r\n\r\nCHAPTER II\r\n\r\n\r\nOn the night of his arrival in London, Alexander went immediately to the\r\nhotel on the Embankment at which he always stopped, and in the lobby he\r\nwas accosted by an old acquaintance, Maurice Mainhall, who fell upon him\r\nwith effusive cordiality and indicated a willingness to dine with him.\r\nBartley never dined alone if he could help it, and Mainhall was a good\r\ngossip who always knew what had been going on in town; especially, he\r\nknew everything that was not printed in the newspapers. The nephew of\r\none of the standard Victorian novelists, Mainhall bobbed about among the\r\nvarious literary cliques of London and its outlying suburbs, careful to\r\nlose touch with none of them. He had written a number of books himself;\r\namong them a \"History of Dancing,\" a \"History of Costume,\" a \"Key to\r\nShakespeare's Sonnets,\" a study of \"The Poetry of Ernest Dowson,\" etc.\r\nAlthough Mainhall's enthusiasm was often tiresome, and although he was\r\noften unable to distinguish between facts and vivid figments of his\r\nimagination, his imperturbable good nature overcame even the people whom\r\nhe bored most, so that they ended by becoming, in a reluctant manner,\r\nhis friends. In appearance, Mainhall was astonishingly like the\r\nconventional stage-Englishman of American drama: tall and thin, with\r\nhigh, hitching shoulders and a small head glistening with closely\r\nbrushed yellow hair. He spoke with an extreme Oxford accent, and when he\r\nwas talking well, his face sometimes wore the rapt expression of a very\r\nemotional man listening to music. Mainhall liked Alexander because he\r\nwas an engineer. He had preconceived ideas about everything, and his\r\nidea about Americans was that they should be engineers or mechanics. He\r\nhated them when they presumed to be anything else.\r\n\r\nWhile they sat at dinner Mainhall acquainted Bartley with the fortunes\r\nof his old friends in London, and as they left the table he proposed\r\nthat they should go to see Hugh MacConnell's new comedy, \"Bog Lights.\"\r\n\r\n\"It's really quite the best thing MacConnell's done,\" he explained as\r\nthey got into a hansom. \"It's tremendously well put on, too. Florence\r\nMerrill and Cyril Henderson. But Hilda Burgoyne's the hit of the piece.\r\nHugh's written a delightful part for her, and she's quite inexpressible.\r\nIt's been on only two weeks, and I've been half a dozen times already.\r\nI happen to have MacConnell's box for tonight or there'd be no chance of\r\nour getting places. There's everything in seeing Hilda while she's fresh\r\nin a part. She's apt to grow a bit stale after a time. The ones who have\r\nany imagination do.\"\r\n\r\n\"Hilda Burgoyne!\" Alexander exclaimed mildly. \"Why, I haven't heard of\r\nher for--years.\"\r\n\r\nMainhall laughed. \"Then you can't have heard much at all, my dear\r\nAlexander. It's only lately, since MacConnell and his set have got hold\r\nof her, that she's come up. Myself, I always knew she had it in her. If\r\nwe had one real critic in London--but what can one expect? Do you know,\r\nAlexander,\"--Mainhall looked with perplexity up into the top of the\r\nhansom and rubbed his pink cheek with his gloved finger,--\"do you know,\r\nI sometimes think of taking to criticism seriously myself. In a way, it\r\nwould be a sacrifice; but, dear me, we do need some one.\"\r\n\r\nJust then they drove up to the Duke of York's, so Alexander did not\r\ncommit himself, but followed Mainhall into the theatre. When they\r\nentered the stage-box on the left the first act was well under way, the\r\nscene being the interior of a cabin in the south of Ireland. As they sat\r\ndown, a burst of applause drew Alexander's attention to the stage. Miss\r\nBurgoyne and her donkey were thrusting their heads in at the half door.\r\n\"After all,\" he reflected, \"there's small probability of her recognizing\r\nme. She doubtless hasn't thought of me for years.\" He felt the\r\nenthusiasm of the house at once, and in a few moments he was caught up\r\nby the current of MacConnell's irresistible comedy. The audience\r\nhad come forewarned, evidently, and whenever the ragged slip of a\r\ndonkey-girl ran upon the stage there was a deep murmur of approbation,\r\nevery one smiled and glowed, and Mainhall hitched his heavy chair a\r\nlittle nearer the brass railing.\r\n\r\n\"You see,\" he murmured in Alexander's ear, as the curtain fell on\r\nthe first act, \"one almost never sees a part like that done without\r\nsmartness or mawkishness. Of course, Hilda is Irish,--the Burgoynes have\r\nbeen stage people for generations,--and she has the Irish voice. It's\r\ndelightful to hear it in a London theatre. That laugh, now, when she\r\ndoubles over at the hips--who ever heard it out of Galway? She saves\r\nher hand, too. She's at her best in the second act. She's really\r\nMacConnell's poetic motif, you see; makes the whole thing a fairy tale.\"\r\n\r\nThe second act opened before Philly Doyle's underground still, with\r\nPeggy and her battered donkey come in to smuggle a load of potheen\r\nacross the bog, and to bring Philly word of what was doing in the world\r\nwithout, and of what was happening along the roadsides and ditches with\r\nthe first gleam of fine weather. Alexander, annoyed by Mainhall's sighs\r\nand exclamations, watched her with keen, half-skeptical interest. As\r\nMainhall had said, she was the second act; the plot and feeling alike\r\ndepended upon her lightness of foot, her lightness of touch, upon the\r\nshrewdness and deft fancifulness that played alternately, and sometimes\r\ntogether, in her mirthful brown eyes. When she began to dance, by way of\r\nshowing the gossoons what she had seen in the fairy rings at night, the\r\nhouse broke into a prolonged uproar. After her dance she withdrew from\r\nthe dialogue and retreated to the ditch wall back of Philly's burrow,\r\nwhere she sat singing \"The Rising of the Moon\" and making a wreath of\r\nprimroses for her donkey.\r\n\r\nWhen the act was over Alexander and Mainhall strolled out into the\r\ncorridor. They met a good many acquaintances; Mainhall, indeed, knew\r\nalmost every one, and he babbled on incontinently, screwing his small\r\nhead about over his high collar. Presently he hailed a tall, bearded\r\nman, grim-browed and rather battered-looking, who had his opera cloak\r\non his arm and his hat in his hand, and who seemed to be on the point of\r\nleaving the theatre.\r\n\r\n\"MacConnell, let me introduce Mr. Bartley Alexander. I say! It's going\r\nfamously to-night, Mac. And what an audience! You'll never do anything\r\nlike this again, mark me. A man writes to the top of his bent only\r\nonce.\"\r\n\r\nThe playwright gave Mainhall a curious look out of his deep-set faded\r\neyes and made a wry face. \"And have I done anything so fool as that,\r\nnow?\" he asked.\r\n\r\n\"That's what I was saying,\" Mainhall lounged a little nearer and dropped\r\ninto a tone even more conspicuously confidential. \"And you'll never\r\nbring Hilda out like this again. Dear me, Mac, the girl couldn't\r\npossibly be better, you know.\"\r\n\r\nMacConnell grunted. \"She'll do well enough if she keeps her pace and\r\ndoesn't go off on us in the middle of the season, as she's more than\r\nlike to do.\"\r\n\r\nHe nodded curtly and made for the door, dodging acquaintances as he\r\nwent.\r\n\r\n\"Poor old Hugh,\" Mainhall murmured. \"He's hit terribly hard. He's been\r\nwanting to marry Hilda these three years and more. She doesn't take up\r\nwith anybody, you know. Irene Burgoyne, one of her family, told me in\r\nconfidence that there was a romance somewhere back in the beginning. One\r\nof your countrymen, Alexander, by the way; an American student whom she\r\nmet in Paris, I believe. I dare say it's quite true that there's never\r\nbeen any one else.\" Mainhall vouched for her constancy with a loftiness\r\nthat made Alexander smile, even while a kind of rapid excitement was\r\ntingling through him. Blinking up at the lights, Mainhall added in\r\nhis luxurious, worldly way: \"She's an elegant little person, and quite\r\ncapable of an extravagant bit of sentiment like that. Here comes Sir\r\nHarry Towne. He's another who's awfully keen about her. Let me introduce\r\nyou. Sir Harry Towne, Mr. Bartley Alexander, the American engineer.\"\r\n\r\nSir Harry Towne bowed and said that he had met Mr. Alexander and his\r\nwife in Tokyo.\r\n\r\nMainhall cut in impatiently.\r\n\r\n\"I say, Sir Harry, the little girl's going famously to-night, isn't\r\nshe?\"\r\n\r\nSir Harry wrinkled his brows judiciously. \"Do you know, I thought the\r\ndance a bit conscious to-night, for the first time. The fact is, she's\r\nfeeling rather seedy, poor child. Westmere and I were back after the\r\nfirst act, and we thought she seemed quite uncertain of herself. A\r\nlittle attack of nerves, possibly.\"\r\n\r\nHe bowed as the warning bell rang, and Mainhall whispered: \"You know\r\nLord Westmere, of course,--the stooped man with the long gray mustache,\r\ntalking to Lady Dowle. Lady Westmere is very fond of Hilda.\"\r\n\r\nWhen they reached their box the house was darkened and the orchestra\r\nwas playing \"The Cloak of Old Gaul.\" In a moment Peggy was on the stage\r\nagain, and Alexander applauded vigorously with the rest. He even leaned\r\nforward over the rail a little. For some reason he felt pleased and\r\nflattered by the enthusiasm of the audience. In the half-light he looked\r\nabout at the stalls and boxes and smiled a little consciously, recalling\r\nwith amusement Sir Harry's judicial frown. He was beginning to feel a\r\nkeen interest in the slender, barefoot donkey-girl who slipped in and\r\nout of the play, singing, like some one winding through a hilly field.\r\nHe leaned forward and beamed felicitations as warmly as Mainhall himself\r\nwhen, at the end of the play, she came again and again before the\r\ncurtain, panting a little and flushed, her eyes dancing and her eager,\r\nnervous little mouth tremulous with excitement.\r\n\r\nWhen Alexander returned to his hotel--he shook Mainhall at the door of\r\nthe theatre--he had some supper brought up to his room, and it was late\r\nbefore he went to bed. He had not thought of Hilda Burgoyne for years;\r\nindeed, he had almost forgotten her. He had last written to her from\r\nCanada, after he first met Winifred, telling her that everything was\r\nchanged with him--that he had met a woman whom he would marry if he\r\ncould; if he could not, then all the more was everything changed for\r\nhim. Hilda had never replied to his letter. He felt guilty and unhappy\r\nabout her for a time, but after Winifred promised to marry him he really\r\nforgot Hilda altogether. When he wrote her that everything was changed\r\nfor him, he was telling the truth. After he met Winifred Pemberton he\r\nseemed to himself like a different man. One night when he and Winifred\r\nwere sitting together on the bridge, he told her that things had\r\nhappened while he was studying abroad that he was sorry for,--one thing\r\nin particular,--and he asked her whether she thought she ought to know\r\nabout them. She considered a moment and then said \"No, I think not,\r\nthough I am glad you ask me. You see, one can't be jealous about things\r\nin general; but about particular, definite, personal things,\"--here\r\nshe had thrown her hands up to his shoulders with a quick, impulsive\r\ngesture--\"oh, about those I should be very jealous. I should torture\r\nmyself--I couldn't help it.\" After that it was easy to forget, actually\r\nto forget. He wondered to-night, as he poured his wine, how many times\r\nhe had thought of Hilda in the last ten years. He had been in London\r\nmore or less, but he had never happened to hear of her. \"All the same,\"\r\nhe lifted his glass, \"here's to you, little Hilda. You've made things\r\ncome your way, and I never thought you'd do it.\r\n\r\n\"Of course,\" he reflected, \"she always had that combination of something\r\nhomely and sensible, and something utterly wild and daft. But I never\r\nthought she'd do anything. She hadn't much ambition then, and she was\r\ntoo fond of trifles. She must care about the theatre a great deal more\r\nthan she used to. Perhaps she has me to thank for something, after\r\nall. Sometimes a little jolt like that does one good. She was a daft,\r\ngenerous little thing. I'm glad she's held her own since. After all,\r\nwe were awfully young. It was youth and poverty and proximity, and\r\neverything was young and kindly. I shouldn't wonder if she could laugh\r\nabout it with me now. I shouldn't wonder-- But they've probably spoiled\r\nher, so that she'd be tiresome if one met her again.\"\r\n\r\nBartley smiled and yawned and went to bed.\r\n\r\n\r\n\r\nCHAPTER III\r\n\r\n\r\nThe next evening Alexander dined alone at a club, and at about nine\r\no'clock he dropped in at the Duke of York's. The house was sold out\r\nand he stood through the second act. When he returned to his hotel he\r\nexamined the new directory, and found Miss Burgoyne's address still\r\ngiven as off Bedford Square, though at a new number. He remembered that,\r\nin so far as she had been brought up at all, she had been brought up in\r\nBloomsbury. Her father and mother played in the provinces most of the\r\nyear, and she was left a great deal in the care of an old aunt who was\r\ncrippled by rheumatism and who had had to leave the stage altogether. In\r\nthe days when Alexander knew her, Hilda always managed to have a lodging\r\nof some sort about Bedford Square, because she clung tenaciously to such\r\nscraps and shreds of memories as were connected with it. The mummy\r\nroom of the British Museum had been one of the chief delights of her\r\nchildhood. That forbidding pile was the goal of her truant fancy, and\r\nshe was sometimes taken there for a treat, as other children are taken\r\nto the theatre. It was long since Alexander had thought of any of\r\nthese things, but now they came back to him quite fresh, and had a\r\nsignificance they did not have when they were first told him in his\r\nrestless twenties. So she was still in the old neighborhood, near\r\nBedford Square. The new number probably meant increased prosperity. He\r\nhoped so. He would like to know that she was snugly settled. He looked\r\nat his watch. It was a quarter past ten; she would not be home for a\r\ngood two hours yet, and he might as well walk over and have a look at\r\nthe place. He remembered the shortest way.\r\n\r\nIt was a warm, smoky evening, and there was a grimy moon. He went\r\nthrough Covent Garden to Oxford Street, and as he turned into Museum\r\nStreet he walked more slowly, smiling at his own nervousness as he\r\napproached the sullen gray mass at the end. He had not been inside the\r\nMuseum, actually, since he and Hilda used to meet there; sometimes\r\nto set out for gay adventures at Twickenham or Richmond, sometimes to\r\nlinger about the place for a while and to ponder by Lord Elgin's marbles\r\nupon the lastingness of some things, or, in the mummy room, upon the\r\nawful brevity of others. Since then Bartley had always thought of the\r\nBritish Museum as the ultimate repository of mortality, where all the\r\ndead things in the world were assembled to make one's hour of youth\r\nthe more precious. One trembled lest before he got out it might somehow\r\nescape him, lest he might drop the glass from over-eagerness and see it\r\nshivered on the stone floor at his feet. How one hid his youth under his\r\ncoat and hugged it! And how good it was to turn one's back upon all that\r\nvaulted cold, to take Hilda's arm and hurry out of the great door and\r\ndown the steps into the sunlight among the pigeons--to know that\r\nthe warm and vital thing within him was still there and had not been\r\nsnatched away to flush Caesar's lean cheek or to feed the veins of some\r\nbearded Assyrian king. They in their day had carried the flaming liquor,\r\nbut to-day was his! So the song used to run in his head those summer\r\nmornings a dozen years ago. Alexander walked by the place very quietly,\r\nas if he were afraid of waking some one.\r\n\r\nHe crossed Bedford Square and found the number he was looking for. The\r\nhouse, a comfortable, well-kept place enough, was dark except for the\r\nfour front windows on the second floor, where a low, even light was\r\nburning behind the white muslin sash curtains. Outside there were window\r\nboxes, painted white and full of flowers. Bartley was making a third\r\nround of the Square when he heard the far-flung hoof-beats of a\r\nhansom-cab horse, driven rapidly. He looked at his watch, and was\r\nastonished to find that it was a few minutes after twelve. He turned and\r\nwalked back along the iron railing as the cab came up to Hilda's number\r\nand stopped. The hansom must have been one that she employed regularly,\r\nfor she did not stop to pay the driver. She stepped out quickly and\r\nlightly. He heard her cheerful \"Good-night, cabby,\" as she ran up the\r\nsteps and opened the door with a latchkey. In a few moments the lights\r\nflared up brightly behind the white curtains, and as he walked away\r\nhe heard a window raised. But he had gone too far to look up without\r\nturning round. He went back to his hotel, feeling that he had had a good\r\nevening, and he slept well.\r\n\r\nFor the next few days Alexander was very busy. He took a desk in the\r\noffice of a Scotch engineering firm on Henrietta Street, and was at work\r\nalmost constantly. He avoided the clubs and usually dined alone at his\r\nhotel. One afternoon, after he had tea, he started for a walk down the\r\nEmbankment toward Westminster, intending to end his stroll at Bedford\r\nSquare and to ask whether Miss Burgoyne would let him take her to the\r\ntheatre. But he did not go so far. When he reached the Abbey, he turned\r\nback and crossed Westminster Bridge and sat down to watch the trails of\r\nsmoke behind the Houses of Parliament catch fire with the sunset. The\r\nslender towers were washed by a rain of golden light and licked by\r\nlittle flickering flames; Somerset House and the bleached gray pinnacles\r\nabout Whitehall were floated in a luminous haze. The yellow light poured\r\nthrough the trees and the leaves seemed to burn with soft fires. There\r\nwas a smell of acacias in the air everywhere, and the laburnums were\r\ndripping gold over the walls of the gardens. It was a sweet, lonely kind\r\nof summer evening. Remembering Hilda as she used to be, was doubtless\r\nmore satisfactory than seeing her as she must be now--and, after all,\r\nAlexander asked himself, what was it but his own young years that he was\r\nremembering?\r\n\r\nHe crossed back to Westminster, went up to the Temple, and sat down to\r\nsmoke in the Middle Temple gardens, listening to the thin voice of the\r\nfountain and smelling the spice of the sycamores that came out heavily\r\nin the damp evening air. He thought, as he sat there, about a great many\r\nthings: about his own youth and Hilda's; above all, he thought of how\r\nglorious it had been, and how quickly it had passed; and, when it had\r\npassed, how little worth while anything was. None of the things he had\r\ngained in the least compensated. In the last six years his reputation\r\nhad become, as the saying is, popular. Four years ago he had been called\r\nto Japan to deliver, at the Emperor's request, a course of lectures\r\nat the Imperial University, and had instituted reforms throughout the\r\nislands, not only in the practice of bridge-building but in drainage and\r\nroad-making. On his return he had undertaken the bridge at Moorlock,\r\nin Canada, the most important piece of bridge-building going on in\r\nthe world,--a test, indeed, of how far the latest practice in bridge\r\nstructure could be carried. It was a spectacular undertaking by reason\r\nof its very size, and Bartley realized that, whatever else he might do,\r\nhe would probably always be known as the engineer who designed the great\r\nMoorlock Bridge, the longest cantilever in existence. Yet it was to him\r\nthe least satisfactory thing he had ever done. He was cramped in every\r\nway by a niggardly commission, and was using lighter structural material\r\nthan he thought proper. He had vexations enough, too, with his work at\r\nhome. He had several bridges under way in the United States, and they\r\nwere always being held up by strikes and delays resulting from a general\r\nindustrial unrest.\r\n\r\nThough Alexander often told himself he had never put more into his work\r\nthan he had done in the last few years, he had to admit that he had\r\nnever got so little out of it. He was paying for success, too, in the\r\ndemands made on his time by boards of civic enterprise and committees\r\nof public welfare. The obligations imposed by his wife's fortune\r\nand position were sometimes distracting to a man who followed his\r\nprofession, and he was expected to be interested in a great many worthy\r\nendeavors on her account as well as on his own. His existence was\r\nbecoming a network of great and little details. He had expected that\r\nsuccess would bring him freedom and power; but it had brought only power\r\nthat was in itself another kind of restraint. He had always meant to\r\nkeep his personal liberty at all costs, as old MacKeller, his first\r\nchief, had done, and not, like so many American engineers, to become a\r\npart of a professional movement, a cautious board member, a Nestor de\r\npontibus. He happened to be engaged in work of public utility, but he\r\nwas not willing to become what is called a public man. He found himself\r\nliving exactly the kind of life he had determined to escape. What, he\r\nasked himself, did he want with these genial honors and substantial\r\ncomforts? Hardships and difficulties he had carried lightly; overwork\r\nhad not exhausted him; but this dead calm of middle life which\r\nconfronted him,--of that he was afraid. He was not ready for it. It was\r\nlike being buried alive. In his youth he would not have believed such a\r\nthing possible. The one thing he had really wanted all his life was to\r\nbe free; and there was still something unconquered in him, something\r\nbesides the strong work-horse that his profession had made of him. He\r\nfelt rich to-night in the possession of that unstultified survival;\r\nin the light of his experience, it was more precious than honors or\r\nachievement. In all those busy, successful years there had been nothing\r\nso good as this hour of wild light-heartedness. This feeling was the\r\nonly happiness that was real to him, and such hours were the only ones\r\nin which he could feel his own continuous identity--feel the boy he had\r\nbeen in the rough days of the old West, feel the youth who had worked\r\nhis way across the ocean on a cattle-ship and gone to study in Paris\r\nwithout a dollar in his pocket. The man who sat in his offices in Boston\r\nwas only a powerful machine. Under the activities of that machine the\r\nperson who, in such moments as this, he felt to be himself, was fading\r\nand dying. He remembered how, when he was a little boy and his father\r\ncalled him in the morning, he used to leap from his bed into the full\r\nconsciousness of himself. That consciousness was Life itself. Whatever\r\ntook its place, action, reflection, the power of concentrated thought,\r\nwere only functions of a mechanism useful to society; things that could\r\nbe bought in the market. There was only one thing that had an absolute\r\nvalue for each individual, and it was just that original impulse, that\r\ninternal heat, that feeling of one's self in one's own breast.\r\n\r\nWhen Alexander walked back to his hotel, the red and green lights were\r\nblinking along the docks on the farther shore, and the soft white stars\r\nwere shining in the wide sky above the river.\r\n\r\nThe next night, and the next, Alexander repeated this same foolish\r\nperformance. It was always Miss Burgoyne whom he started out to find,\r\nand he got no farther than the Temple gardens and the Embankment. It\r\nwas a pleasant kind of loneliness. To a man who was so little given\r\nto reflection, whose dreams always took the form of definite ideas,\r\nreaching into the future, there was a seductive excitement in renewing\r\nold experiences in imagination. He started out upon these walks half\r\nguiltily, with a curious longing and expectancy which were wholly\r\ngratified by solitude. Solitude, but not solitariness; for he walked\r\nshoulder to shoulder with a shadowy companion--not little Hilda\r\nBurgoyne, by any means, but some one vastly dearer to him than she had\r\never been--his own young self, the youth who had waited for him upon the\r\nsteps of the British Museum that night, and who, though he had tried to\r\npass so quietly, had known him and come down and linked an arm in his.\r\n\r\nIt was not until long afterward that Alexander learned that for him this\r\nyouth was the most dangerous of companions.\r\n\r\n\r\nOne Sunday evening, at Lady Walford's, Alexander did at last meet Hilda\r\nBurgoyne. Mainhall had told him that she would probably be there. He\r\nlooked about for her rather nervously, and finally found her at the\r\nfarther end of the large drawing-room, the centre of a circle of men,\r\nyoung and old. She was apparently telling them a story. They were\r\nall laughing and bending toward her. When she saw Alexander, she rose\r\nquickly and put out her hand. The other men drew back a little to let\r\nhim approach.\r\n\r\n\"Mr. Alexander! I am delighted. Have you been in London long?\"\r\n\r\nBartley bowed, somewhat laboriously, over her hand. \"Long enough to have\r\nseen you more than once. How fine it all is!\"\r\n\r\nShe laughed as if she were pleased. \"I'm glad you think so. I like it.\r\nWon't you join us here?\"\r\n\r\n\"Miss Burgoyne was just telling us about a donkey-boy she had in Galway\r\nlast summer,\" Sir Harry Towne explained as the circle closed up again.\r\nLord Westmere stroked his long white mustache with his bloodless hand\r\nand looked at Alexander blankly. Hilda was a good story-teller. She was\r\nsitting on the edge of her chair, as if she had alighted there for a\r\nmoment only. Her primrose satin gown seemed like a soft sheath for her\r\nslender, supple figure, and its delicate color suited her white Irish\r\nskin and brown hair. Whatever she wore, people felt the charm of her\r\nactive, girlish body with its slender hips and quick, eager shoulders.\r\nAlexander heard little of the story, but he watched Hilda intently. She\r\nmust certainly, he reflected, be thirty, and he was honestly delighted\r\nto see that the years had treated her so indulgently. If her face had\r\nchanged at all, it was in a slight hardening of the mouth--still eager\r\nenough to be very disconcerting at times, he felt--and in an added\r\nair of self-possession and self-reliance. She carried her head, too, a\r\nlittle more resolutely.\r\n\r\nWhen the story was finished, Miss Burgoyne turned pointedly to\r\nAlexander, and the other men drifted away.\r\n\r\n\"I thought I saw you in MacConnell's box with Mainhall one evening, but\r\nI supposed you had left town before this.\"\r\n\r\nShe looked at him frankly and cordially, as if he were indeed merely an\r\nold friend whom she was glad to meet again.\r\n\r\n\"No, I've been mooning about here.\"\r\n\r\nHilda laughed gayly. \"Mooning! I see you mooning! You must be the\r\nbusiest man in the world. Time and success have done well by you, you\r\nknow. You're handsomer than ever and you've gained a grand manner.\"\r\n\r\nAlexander blushed and bowed. \"Time and success have been good friends to\r\nboth of us. Aren't you tremendously pleased with yourself?\"\r\n\r\nShe laughed again and shrugged her shoulders. \"Oh, so-so. But I want to\r\nhear about you. Several years ago I read such a lot in the papers about\r\nthe wonderful things you did in Japan, and how the Emperor decorated\r\nyou. What was it, Commander of the Order of the Rising Sun? That sounds\r\nlike `The Mikado.' And what about your new bridge--in Canada, isn't it,\r\nand it's to be the longest one in the world and has some queer name I\r\ncan't remember.\"\r\n\r\nBartley shook his head and smiled drolly. \"Since when have you\r\nbeen interested in bridges? Or have you learned to be interested in\r\neverything? And is that a part of success?\"\r\n\r\n\"Why, how absurd! As if I were not always interested!\" Hilda exclaimed.\r\n\r\n\"Well, I think we won't talk about bridges here, at any rate.\" Bartley\r\nlooked down at the toe of her yellow slipper which was tapping the rug\r\nimpatiently under the hem of her gown. \"But I wonder whether you'd think\r\nme impertinent if I asked you to let me come to see you sometime and\r\ntell you about them?\"\r\n\r\n\"Why should I? Ever so many people come on Sunday afternoons.\"\r\n\r\n\"I know. Mainhall offered to take me. But you must know that I've been\r\nin London several times within the last few years, and you might very\r\nwell think that just now is a rather inopportune time--\"\r\n\r\nShe cut him short. \"Nonsense. One of the pleasantest things about\r\nsuccess is that it makes people want to look one up, if that's what you\r\nmean. I'm like every one else--more agreeable to meet when things are\r\ngoing well with me. Don't you suppose it gives me any pleasure to do\r\nsomething that people like?\"\r\n\r\n\"Does it? Oh, how fine it all is, your coming on like this! But I didn't\r\nwant you to think it was because of that I wanted to see you.\" He spoke\r\nvery seriously and looked down at the floor.\r\n\r\nHilda studied him in wide-eyed astonishment for a moment, and then\r\nbroke into a low, amused laugh. \"My dear Mr. Alexander, you have strange\r\ndelicacies. If you please, that is exactly why you wish to see me. We\r\nunderstand that, do we not?\"\r\n\r\nBartley looked ruffled and turned the seal ring on his little finger\r\nabout awkwardly.\r\n\r\nHilda leaned back in her chair, watching him indulgently out of her\r\nshrewd eyes. \"Come, don't be angry, but don't try to pose for me, or to\r\nbe anything but what you are. If you care to come, it's yourself I'll\r\nbe glad to see, and you thinking well of yourself. Don't try to wear a\r\ncloak of humility; it doesn't become you. Stalk in as you are and don't\r\nmake excuses. I'm not accustomed to inquiring into the motives of my\r\nguests. That would hardly be safe, even for Lady Walford, in a great\r\nhouse like this.\"\r\n\r\n\"Sunday afternoon, then,\" said Alexander, as she rose to join her\r\nhostess. \"How early may I come?\"\r\n\r\nShe gave him her hand and flushed and laughed. He bent over it a little\r\nstiffly. She went away on Lady Walford's arm, and as he stood watching\r\nher yellow train glide down the long floor he looked rather sullen. He\r\nfelt that he had not come out of it very brilliantly.\r\n\r\n\r\n\r\nCHAPTER IV\r\n\r\n\r\nOn Sunday afternoon Alexander remembered Miss Burgoyne's invitation and\r\ncalled at her apartment. He found it a delightful little place and he\r\nmet charming people there. Hilda lived alone, attended by a very pretty\r\nand competent French servant who answered the door and brought in the\r\ntea. Alexander arrived early, and some twenty-odd people dropped in\r\nduring the course of the afternoon. Hugh MacConnell came with his\r\nsister, and stood about, managing his tea-cup awkwardly and watching\r\nevery one out of his deep-set, faded eyes. He seemed to have made a\r\nresolute effort at tidiness of attire, and his sister, a robust, florid\r\nwoman with a splendid joviality about her, kept eyeing his freshly\r\ncreased clothes apprehensively. It was not very long, indeed, before his\r\ncoat hung with a discouraged sag from his gaunt shoulders and his hair\r\nand beard were rumpled as if he had been out in a gale. His dry\r\nhumor went under a cloud of absent-minded kindliness which, Mainhall\r\nexplained, always overtook him here. He was never so witty or so sharp\r\nhere as elsewhere, and Alexander thought he behaved as if he were an\r\nelderly relative come in to a young girl's party.\r\n\r\nThe editor of a monthly review came with his wife, and Lady Kildare,\r\nthe Irish philanthropist, brought her young nephew, Robert Owen, who had\r\ncome up from Oxford, and who was visibly excited and gratified by his\r\nfirst introduction to Miss Burgoyne. Hilda was very nice to him, and he\r\nsat on the edge of his chair, flushed with his conversational efforts\r\nand moving his chin about nervously over his high collar. Sarah Frost,\r\nthe novelist, came with her husband, a very genial and placid old\r\nscholar who had become slightly deranged upon the subject of the fourth\r\ndimension. On other matters he was perfectly rational and he was easy\r\nand pleasing in conversation. He looked very much like Agassiz, and\r\nhis wife, in her old-fashioned black silk dress, overskirted and\r\ntight-sleeved, reminded Alexander of the early pictures of Mrs.\r\nBrowning. Hilda seemed particularly fond of this quaint couple, and\r\nBartley himself was so pleased with their mild and thoughtful converse\r\nthat he took his leave when they did, and walked with them over to\r\nOxford Street, where they waited for their 'bus. They asked him to come\r\nto see them in Chelsea, and they spoke very tenderly of Hilda. \"She's a\r\ndear, unworldly little thing,\" said the philosopher absently; \"more like\r\nthe stage people of my young days--folk of simple manners. There aren't\r\nmany such left. American tours have spoiled them, I'm afraid. They have\r\nall grown very smart. Lamb wouldn't care a great deal about many of\r\nthem, I fancy.\"\r\n\r\nAlexander went back to Bedford Square a second Sunday afternoon. He had\r\na long talk with MacConnell, but he got no word with Hilda alone, and\r\nhe left in a discontented state of mind. For the rest of the week he was\r\nnervous and unsettled, and kept rushing his work as if he were preparing\r\nfor immediate departure. On Thursday afternoon he cut short a committee\r\nmeeting, jumped into a hansom, and drove to Bedford Square. He sent up\r\nhis card, but it came back to him with a message scribbled across the\r\nfront.\r\n\r\n     So sorry I can't see you.  Will you come and\r\n     dine with me Sunday evening at half-past seven?\r\n\r\n     H.B.\r\n\r\nWhen Bartley arrived at Bedford Square on Sunday evening, Marie,\r\nthe pretty little French girl, met him at the door and conducted him\r\nupstairs. Hilda was writing in her living-room, under the light of a\r\ntall desk lamp. Bartley recognized the primrose satin gown she had worn\r\nthat first evening at Lady Walford's.\r\n\r\n\"I'm so pleased that you think me worth that yellow dress, you know,\" he\r\nsaid, taking her hand and looking her over admiringly from the toes of\r\nher canary slippers to her smoothly parted brown hair. \"Yes, it's very,\r\nvery pretty. Every one at Lady Walford's was looking at it.\"\r\n\r\nHilda curtsied. \"Is that why you think it pretty? I've no need for\r\nfine clothes in Mac's play this time, so I can afford a few duddies for\r\nmyself. It's owing to that same chance, by the way, that I am able to\r\nask you to dinner. I don't need Marie to dress me this season, so she\r\nkeeps house for me, and my little Galway girl has gone home for a visit.\r\nI should never have asked you if Molly had been here, for I remember you\r\ndon't like English cookery.\"\r\n\r\nAlexander walked about the room, looking at everything.\r\n\r\n\"I haven't had a chance yet to tell you what a jolly little place I\r\nthink this is. Where did you get those etchings? They're quite unusual,\r\naren't they?\"\r\n\r\n\"Lady Westmere sent them to me from Rome last Christmas. She is very\r\nmuch interested in the American artist who did them. They are all\r\nsketches made about the Villa d'Este, you see. He painted that group of\r\ncypresses for the Salon, and it was bought for the Luxembourg.\"\r\n\r\nAlexander walked over to the bookcases. \"It's the air of the whole place\r\nhere that I like. You haven't got anything that doesn't belong. Seems to\r\nme it looks particularly well to-night. And you have so many flowers. I\r\nlike these little yellow irises.\"\r\n\r\n\"Rooms always look better by lamplight--in London, at least. Though\r\nMarie is clean--really clean, as the French are. Why do you look at the\r\nflowers so critically? Marie got them all fresh in Covent Garden market\r\nyesterday morning.\"\r\n\r\n\"I'm glad,\" said Alexander simply. \"I can't tell you how glad I am to\r\nhave you so pretty and comfortable here, and to hear every one saying\r\nsuch nice things about you. You've got awfully nice friends,\" he added\r\nhumbly, picking up a little jade elephant from her desk. \"Those fellows\r\nare all very loyal, even Mainhall. They don't talk of any one else as\r\nthey do of you.\"\r\n\r\nHilda sat down on the couch and said seriously: \"I've a neat little sum\r\nin the bank, too, now, and I own a mite of a hut in Galway. It's not\r\nworth much, but I love it. I've managed to save something every year,\r\nand that with helping my three sisters now and then, and tiding poor\r\nCousin Mike over bad seasons. He's that gifted, you know, but he will\r\ndrink and loses more good engagements than other fellows ever get. And\r\nI've traveled a bit, too.\"\r\n\r\nMarie opened the door and smilingly announced that dinner was served.\r\n\r\n\"My dining-room,\" Hilda explained, as she led the way, \"is the tiniest\r\nplace you have ever seen.\"\r\n\r\nIt was a tiny room, hung all round with French prints, above which ran a\r\nshelf full of china. Hilda saw Alexander look up at it.\r\n\r\n\"It's not particularly rare,\" she said, \"but some of it was my\r\nmother's. Heaven knows how she managed to keep it whole, through all our\r\nwanderings, or in what baskets and bundles and theatre trunks it hasn't\r\nbeen stowed away. We always had our tea out of those blue cups when I\r\nwas a little girl, sometimes in the queerest lodgings, and sometimes on\r\na trunk at the theatre--queer theatres, for that matter.\"\r\n\r\nIt was a wonderful little dinner. There was watercress soup, and sole,\r\nand a delightful omelette stuffed with mushrooms and truffles, and two\r\nsmall rare ducklings, and artichokes, and a dry yellow Rhone wine of\r\nwhich Bartley had always been very fond. He drank it appreciatively and\r\nremarked that there was still no other he liked so well.\r\n\r\n\"I have some champagne for you, too. I don't drink it myself, but I like\r\nto see it behave when it's poured. There is nothing else that looks so\r\njolly.\"\r\n\r\n\"Thank you. But I don't like it so well as this.\" Bartley held the\r\nyellow wine against the light and squinted into it as he turned the\r\nglass slowly about. \"You have traveled, you say. Have you been in Paris\r\nmuch these late years?\"\r\n\r\nHilda lowered one of the candle-shades carefully. \"Oh, yes, I go over to\r\nParis often. There are few changes in the old Quarter. Dear old Madame\r\nAnger is dead--but perhaps you don't remember her?\"\r\n\r\n\"Don't I, though! I'm so sorry to hear it. How did her son turn out? I\r\nremember how she saved and scraped for him, and how he always lay abed\r\ntill ten o'clock. He was the laziest fellow at the Beaux Arts; and\r\nthat's saying a good deal.\"\r\n\r\n\"Well, he is still clever and lazy. They say he is a good architect when\r\nhe will work. He's a big, handsome creature, and he hates Americans as\r\nmuch as ever. But Angel--do you remember Angel?\"\r\n\r\n\"Perfectly. Did she ever get back to Brittany and her bains de mer?\"\r\n\r\n\"Ah, no. Poor Angel! She got tired of cooking and scouring the coppers\r\nin Madame Anger's little kitchen, so she ran away with a soldier, and\r\nthen with another soldier. Too bad! She still lives about the Quarter,\r\nand, though there is always a soldat, she has become a blanchisseuse de\r\nfin. She did my blouses beautifully the last time I was there, and was\r\nso delighted to see me again. I gave her all my old clothes, even my old\r\nhats, though she always wears her Breton headdress. Her hair is still\r\nlike flax, and her blue eyes are just like a baby's, and she has the\r\nsame three freckles on her little nose, and talks about going back to\r\nher bains de mer.\"\r\n\r\nBartley looked at Hilda across the yellow light of the candles and broke\r\ninto a low, happy laugh. \"How jolly it was being young, Hilda! Do you\r\nremember that first walk we took together in Paris? We walked down to\r\nthe Place Saint-Michel to buy some lilacs. Do you remember how sweet\r\nthey smelled?\"\r\n\r\n\"Indeed I do. Come, we'll have our coffee in the other room, and you can\r\nsmoke.\"\r\n\r\nHilda rose quickly, as if she wished to change the drift of their talk,\r\nbut Bartley found it pleasant to continue it.\r\n\r\n\"What a warm, soft spring evening that was,\" he went on, as they sat\r\ndown in the study with the coffee on a little table between them; \"and\r\nthe sky, over the bridges, was just the color of the lilacs. We walked\r\non down by the river, didn't we?\"\r\n\r\nHilda laughed and looked at him questioningly. He saw a gleam in her\r\neyes that he remembered even better than the episode he was recalling.\r\n\r\n\"I think we did,\" she answered demurely. \"It was on the Quai we met\r\nthat woman who was crying so bitterly. I gave her a spray of lilac,\r\nI remember, and you gave her a franc. I was frightened at your\r\nprodigality.\"\r\n\r\n\"I expect it was the last franc I had. What a strong brown face she had,\r\nand very tragic. She looked at us with such despair and longing, out\r\nfrom under her black shawl. What she wanted from us was neither our\r\nflowers nor our francs, but just our youth. I remember it touched me\r\nso. I would have given her some of mine off my back, if I could. I had\r\nenough and to spare then,\" Bartley mused, and looked thoughtfully at his\r\ncigar.\r\n\r\nThey were both remembering what the woman had said when she took the\r\nmoney: \"God give you a happy love!\" It was not in the ingratiating\r\ntone of the habitual beggar: it had come out of the depths of the poor\r\ncreature's sorrow, vibrating with pity for their youth and despair\r\nat the terribleness of human life; it had the anguish of a voice of\r\nprophecy. Until she spoke, Bartley had not realized that he was in love.\r\nThe strange woman, and her passionate sentence that rang out so sharply,\r\nhad frightened them both. They went home sadly with the lilacs, back\r\nto the Rue Saint-Jacques, walking very slowly, arm in arm. When they\r\nreached the house where Hilda lodged, Bartley went across the court with\r\nher, and up the dark old stairs to the third landing; and there he had\r\nkissed her for the first time. He had shut his eyes to give him the\r\ncourage, he remembered, and she had trembled so--\r\n\r\nBartley started when Hilda rang the little bell beside her. \"Dear me,\r\nwhy did you do that? I had quite forgotten--I was back there. It was\r\nvery jolly,\" he murmured lazily, as Marie came in to take away the\r\ncoffee.\r\n\r\nHilda laughed and went over to the piano. \"Well, we are neither of us\r\ntwenty now, you know. Have I told you about my new play? Mac is writing\r\none; really for me this time. You see, I'm coming on.\"\r\n\r\n\"I've seen nothing else. What kind of a part is it? Shall you wear\r\nyellow gowns? I hope so.\"\r\n\r\nHe was looking at her round slender figure, as she stood by the piano,\r\nturning over a pile of music, and he felt the energy in every line of\r\nit.\r\n\r\n\"No, it isn't a dress-up part. He doesn't seem to fancy me in fine\r\nfeathers. He says I ought to be minding the pigs at home, and I suppose\r\nI ought. But he's given me some good Irish songs. Listen.\"\r\n\r\nShe sat down at the piano and sang. When she finished, Alexander shook\r\nhimself out of a reverie.\r\n\r\n\"Sing `The Harp That Once,' Hilda. You used to sing it so well.\"\r\n\r\n\"Nonsense. Of course I can't really sing, except the way my mother\r\nand grandmother did before me. Most actresses nowadays learn to sing\r\nproperly, so I tried a master; but he confused me, just!\"\r\n\r\nAlexander laughed. \"All the same, sing it, Hilda.\"\r\n\r\nHilda started up from the stool and moved restlessly toward the window.\r\n\"It's really too warm in this room to sing. Don't you feel it?\"\r\n\r\nAlexander went over and opened the window for her. \"Aren't you afraid\r\nto let the wind low like that on your neck? Can't I get a scarf or\r\nsomething?\"\r\n\r\n\"Ask a theatre lady if she's afraid of drafts!\" Hilda laughed. \"But\r\nperhaps, as I'm so warm--give me your handkerchief. There, just in\r\nfront.\" He slipped the corners carefully under her shoulder-straps.\r\n\"There, that will do. It looks like a bib.\" She pushed his hand away\r\nquickly and stood looking out into the deserted square. \"Isn't London a\r\ntomb on Sunday night?\"\r\n\r\nAlexander caught the agitation in her voice. He stood a little behind\r\nher, and tried to steady himself as he said: \"It's soft and misty. See\r\nhow white the stars are.\"\r\n\r\nFor a long time neither Hilda nor Bartley spoke. They stood close\r\ntogether, looking out into the wan, watery sky, breathing always more\r\nquickly and lightly, and it seemed as if all the clocks in the world\r\nhad stopped. Suddenly he moved the clenched hand he held behind him\r\nand dropped it violently at his side. He felt a tremor run through the\r\nslender yellow figure in front of him.\r\n\r\nShe caught his handkerchief from her throat and thrust it at him without\r\nturning round. \"Here, take it. You must go now, Bartley. Good-night.\"\r\n\r\nBartley leaned over her shoulder, without touching her, and whispered in\r\nher ear: \"You are giving me a chance?\"\r\n\r\n\"Yes. Take it and go. This isn't fair, you know. Good-night.\"\r\n\r\nAlexander unclenched the two hands at his sides. With one he threw down\r\nthe window and with the other--still standing behind her--he drew her\r\nback against him.\r\n\r\nShe uttered a little cry, threw her arms over her head, and drew his\r\nface down to hers. \"Are you going to let me love you a little, Bartley?\"\r\nshe whispered.\r\n\r\n\r\n\r\nCHAPTER V\r\n\r\n\r\nIt was the afternoon of the day before Christmas. Mrs. Alexander had\r\nbeen driving about all the morning, leaving presents at the houses of\r\nher friends. She lunched alone, and as she rose from the table she spoke\r\nto the butler: \"Thomas, I am going down to the kitchen now to see Norah.\r\nIn half an hour you are to bring the greens up from the cellar and put\r\nthem in the library. Mr. Alexander will be home at three to hang them\r\nhimself. Don't forget the stepladder, and plenty of tacks and\r\nstring. You may bring the azaleas upstairs. Take the white one to Mr.\r\nAlexander's study. Put the two pink ones in this room, and the red one\r\nin the drawing-room.\"\r\n\r\nA little before three o'clock Mrs. Alexander went into the library to\r\nsee that everything was ready. She pulled the window shades high, for\r\nthe weather was dark and stormy, and there was little light, even in\r\nthe streets. A foot of snow had fallen during the morning, and the wide\r\nspace over the river was thick with flying flakes that fell and wreathed\r\nthe masses of floating ice. Winifred was standing by the window when\r\nshe heard the front door open. She hurried to the hall as Alexander came\r\nstamping in, covered with snow. He kissed her joyfully and brushed away\r\nthe snow that fell on her hair.\r\n\r\n\"I wish I had asked you to meet me at the office and walk home with me,\r\nWinifred. The Common is beautiful. The boys have swept the snow off the\r\npond and are skating furiously. Did the cyclamens come?\"\r\n\r\n\"An hour ago. What splendid ones! But aren't you frightfully\r\nextravagant?\"\r\n\r\n\"Not for Christmas-time. I'll go upstairs and change my coat. I shall be\r\ndown in a moment. Tell Thomas to get everything ready.\"\r\n\r\nWhen Alexander reappeared, he took his wife's arm and went with her into\r\nthe library. \"When did the azaleas get here? Thomas has got the white\r\none in my room.\"\r\n\r\n\"I told him to put it there.\"\r\n\r\n\"But, I say, it's much the finest of the lot!\"\r\n\r\n\"That's why I had it put there. There is too much color in that room for\r\na red one, you know.\"\r\n\r\nBartley began to sort the greens. \"It looks very splendid there, but I\r\nfeel piggish to have it. However, we really spend more time there than\r\nanywhere else in the house. Will you hand me the holly?\"\r\n\r\nHe climbed up the stepladder, which creaked under his weight, and\r\nbegan to twist the tough stems of the holly into the frame-work of the\r\nchandelier.\r\n\r\n\"I forgot to tell you that I had a letter from Wilson, this morning,\r\nexplaining his telegram. He is coming on because an old uncle up in\r\nVermont has conveniently died and left Wilson a little money--something\r\nlike ten thousand. He's coming on to settle up the estate. Won't it be\r\njolly to have him?\"\r\n\r\n\"And how fine that he's come into a little money. I can see him posting\r\ndown State Street to the steamship offices. He will get a good many\r\ntrips out of that ten thousand. What can have detained him? I expected\r\nhim here for luncheon.\"\r\n\r\n\"Those trains from Albany are always late. He'll be along sometime this\r\nafternoon. And now, don't you want to go upstairs and lie down for\r\nan hour? You've had a busy morning and I don't want you to be tired\r\nto-night.\"\r\n\r\nAfter his wife went upstairs Alexander worked energetically at the\r\ngreens for a few moments. Then, as he was cutting off a length of\r\nstring, he sighed suddenly and sat down, staring out of the window at\r\nthe snow. The animation died out of his face, but in his eyes there was\r\na restless light, a look of apprehension and suspense. He kept clasping\r\nand unclasping his big hands as if he were trying to realize something.\r\nThe clock ticked through the minutes of a half-hour and the afternoon\r\noutside began to thicken and darken turbidly. Alexander, since he first\r\nsat down, had not changed his position. He leaned forward, his hands\r\nbetween his knees, scarcely breathing, as if he were holding himself\r\naway from his surroundings, from the room, and from the very chair in\r\nwhich he sat, from everything except the wild eddies of snow above the\r\nriver on which his eyes were fixed with feverish intentness, as if he\r\nwere trying to project himself thither. When at last Lucius Wilson was\r\nannounced, Alexander sprang eagerly to his feet and hurried to meet his\r\nold instructor.\r\n\r\n\"Hello, Wilson. What luck! Come into the library. We are to have a lot\r\nof people to dinner to-night, and Winifred's lying down. You will\r\nexcuse her, won't you? And now what about yourself? Sit down and tell me\r\neverything.\"\r\n\r\n\"I think I'd rather move about, if you don't mind. I've been sitting in\r\nthe train for a week, it seems to me.\" Wilson stood before the fire with\r\nhis hands behind him and looked about the room. \"You HAVE been busy.\r\nBartley, if I'd had my choice of all possible places in which to spend\r\nChristmas, your house would certainly be the place I'd have chosen.\r\nHappy people do a great deal for their friends. A house like this\r\nthrows its warmth out. I felt it distinctly as I was coming through\r\nthe Berkshires. I could scarcely believe that I was to see Mrs. Bartley\r\nagain so soon.\"\r\n\r\n\"Thank you, Wilson. She'll be as glad to see you. Shall we have tea now?\r\nI'll ring for Thomas to clear away this litter. Winifred says I always\r\nwreck the house when I try to do anything. Do you know, I am quite\r\ntired. Looks as if I were not used to work, doesn't it?\" Alexander\r\nlaughed and dropped into a chair. \"You know, I'm sailing the day after\r\nNew Year's.\"\r\n\r\n\"Again? Why, you've been over twice since I was here in the spring,\r\nhaven't you?\"\r\n\r\n\"Oh, I was in London about ten days in the summer. Went to escape the\r\nhot weather more than anything else. I shan't be gone more than a month\r\nthis time. Winifred and I have been up in Canada for most of the autumn.\r\nThat Moorlock Bridge is on my back all the time. I never had so much\r\ntrouble with a job before.\" Alexander moved about restlessly and fell to\r\npoking the fire.\r\n\r\n\"Haven't I seen in the papers that there is some trouble about a\r\ntidewater bridge of yours in New Jersey?\"\r\n\r\n\"Oh, that doesn't amount to anything. It's held up by a steel strike. A\r\nbother, of course, but the sort of thing one is always having to put up\r\nwith. But the Moorlock Bridge is a continual anxiety. You see, the truth\r\nis, we are having to build pretty well to the strain limit up there.\r\nThey've crowded me too much on the cost. It's all very well if\r\neverything goes well, but these estimates have never been used for\r\nanything of such length before. However, there's nothing to be done.\r\nThey hold me to the scale I've used in shorter bridges. The last thing a\r\nbridge commission cares about is the kind of bridge you build.\"\r\n\r\n\r\nWhen Bartley had finished dressing for dinner he went into his study,\r\nwhere he found his wife arranging flowers on his writing-table.\r\n\r\n\"These pink roses just came from Mrs. Hastings,\" she said, smiling, \"and\r\nI am sure she meant them for you.\"\r\n\r\nBartley looked about with an air of satisfaction at the greens and the\r\nwreaths in the windows. \"Have you a moment, Winifred? I have just now\r\nbeen thinking that this is our twelfth Christmas. Can you realize it?\"\r\nHe went up to the table and took her hands away from the flowers, drying\r\nthem with his pocket handkerchief. \"They've been awfully happy ones, all\r\nof them, haven't they?\" He took her in his arms and bent back, lifting\r\nher a little and giving her a long kiss. \"You are happy, aren't you\r\nWinifred? More than anything else in the world, I want you to be happy.\r\nSometimes, of late, I've thought you looked as if you were troubled.\"\r\n\r\n\"No; it's only when you are troubled and harassed that I feel worried,\r\nBartley. I wish you always seemed as you do to-night. But you don't,\r\nalways.\" She looked earnestly and inquiringly into his eyes.\r\n\r\nAlexander took her two hands from his shoulders and swung them back and\r\nforth in his own, laughing his big blond laugh.\r\n\r\n\"I'm growing older, my dear; that's what you feel. Now, may I show you\r\nsomething? I meant to save them until to-morrow, but I want you to\r\nwear them to-night.\" He took a little leather box out of his pocket and\r\nopened it. On the white velvet lay two long pendants of curiously worked\r\ngold, set with pearls. Winifred looked from the box to Bartley and\r\nexclaimed:--\r\n\r\n\"Where did you ever find such gold work, Bartley?\"\r\n\r\n\"It's old Flemish. Isn't it fine?\"\r\n\r\n\"They are the most beautiful things, dear. But, you know, I never wear\r\nearrings.\"\r\n\r\n\"Yes, yes, I know. But I want you to wear them. I have always wanted\r\nyou to. So few women can. There must be a good ear, to begin with, and\r\na nose\"--he waved his hand--\"above reproach. Most women look silly in\r\nthem. They go only with faces like yours--very, very proud, and just a\r\nlittle hard.\"\r\n\r\nWinifred laughed as she went over to the mirror and fitted the delicate\r\nsprings to the lobes of her ears. \"Oh, Bartley, that old foolishness\r\nabout my being hard. It really hurts my feelings. But I must go down\r\nnow. People are beginning to come.\"\r\n\r\nBartley drew her arm about his neck and went to the door with her. \"Not\r\nhard to me, Winifred,\" he whispered. \"Never, never hard to me.\"\r\n\r\nLeft alone, he paced up and down his study. He was at home again, among\r\nall the dear familiar things that spoke to him of so many happy years.\r\nHis house to-night would be full of charming people, who liked and\r\nadmired him. Yet all the time, underneath his pleasure and hopefulness\r\nand satisfaction, he was conscious of the vibration of an unnatural\r\nexcitement. Amid this light and warmth and friendliness, he sometimes\r\nstarted and shuddered, as if some one had stepped on his grave.\r\nSomething had broken loose in him of which he knew nothing except\r\nthat it was sullen and powerful, and that it wrung and tortured him.\r\nSometimes it came upon him softly, in enervating reveries. Sometimes it\r\nbattered him like the cannon rolling in the hold of the vessel. Always,\r\nnow, it brought with it a sense of quickened life, of stimulating\r\ndanger. To-night it came upon him suddenly, as he was walking the floor,\r\nafter his wife left him. It seemed impossible; he could not believe it.\r\nHe glanced entreatingly at the door, as if to call her back. He heard\r\nvoices in the hall below, and knew that he must go down. Going over to\r\nthe window, he looked out at the lights across the river. How could this\r\nhappen here, in his own house, among the things he loved? What was it\r\nthat reached in out of the darkness and thrilled him? As he stood\r\nthere he had a feeling that he would never escape. He shut his eyes and\r\npressed his forehead against the cold window glass, breathing in the\r\nchill that came through it. \"That this,\" he groaned, \"that this should\r\nhave happened to ME!\"\r\n\r\n\r\nOn New Year's day a thaw set in, and during the night torrents of rain\r\nfell. In the morning, the morning of Alexander's departure for England,\r\nthe river was streaked with fog and the rain drove hard against the\r\nwindows of the breakfast-room. Alexander had finished his coffee and\r\nwas pacing up and down. His wife sat at the table, watching him. She was\r\npale and unnaturally calm. When Thomas brought the letters, Bartley sank\r\ninto his chair and ran them over rapidly.\r\n\r\n\"Here's a note from old Wilson. He's safe back at his grind, and says he\r\nhad a bully time. `The memory of Mrs. Bartley will make my whole winter\r\nfragrant.' Just like him. He will go on getting measureless satisfaction\r\nout of you by his study fire. What a man he is for looking on at life!\"\r\nBartley sighed, pushed the letters back impatiently, and went over to\r\nthe window. \"This is a nasty sort of day to sail. I've a notion to call\r\nit off. Next week would be time enough.\"\r\n\r\n\"That would only mean starting twice. It wouldn't really help you out at\r\nall,\" Mrs. Alexander spoke soothingly. \"And you'd come back late for all\r\nyour engagements.\"\r\n\r\nBartley began jingling some loose coins in his pocket. \"I wish things\r\nwould let me rest. I'm tired of work, tired of people, tired of trailing\r\nabout.\" He looked out at the storm-beaten river.\r\n\r\nWinifred came up behind him and put a hand on his shoulder. \"That's\r\nwhat you always say, poor Bartley! At bottom you really like all these\r\nthings. Can't you remember that?\"\r\n\r\nHe put his arm about her. \"All the same, life runs smoothly enough with\r\nsome people, and with me it's always a messy sort of patchwork. It's\r\nlike the song; peace is where I am not. How can you face it all with so\r\nmuch fortitude?\"\r\n\r\nShe looked at him with that clear gaze which Wilson had so much admired,\r\nwhich he had felt implied such high confidence and fearless pride. \"Oh,\r\nI faced that long ago, when you were on your first bridge, up at old\r\nAllway. I knew then that your paths were not to be paths of peace, but I\r\ndecided that I wanted to follow them.\"\r\n\r\nBartley and his wife stood silent for a long time; the fire crackled in\r\nthe grate, the rain beat insistently upon the windows, and the sleepy\r\nAngora looked up at them curiously.\r\n\r\nPresently Thomas made a discreet sound at the door. \"Shall Edward bring\r\ndown your trunks, sir?\"\r\n\r\n\"Yes; they are ready. Tell him not to forget the big portfolio on the\r\nstudy table.\"\r\n\r\nThomas withdrew, closing the door softly. Bartley turned away from his\r\nwife, still holding her hand. \"It never gets any easier, Winifred.\"\r\n\r\nThey both started at the sound of the carriage on the pavement outside.\r\nAlexander sat down and leaned his head on his hand. His wife bent over\r\nhim. \"Courage,\" she said gayly. Bartley rose and rang the bell. Thomas\r\nbrought him his hat and stick and ulster. At the sight of these, the\r\nsupercilious Angora moved restlessly, quitted her red cushion by\r\nthe fire, and came up, waving her tail in vexation at these ominous\r\nindications of change. Alexander stooped to stroke her, and then plunged\r\ninto his coat and drew on his gloves. His wife held his stick, smiling.\r\nBartley smiled too, and his eyes cleared. \"I'll work like the devil,\r\nWinifred, and be home again before you realize I've gone.\" He kissed her\r\nquickly several times, hurried out of the front door into the rain, and\r\nwaved to her from the carriage window as the driver was starting his\r\nmelancholy, dripping black horses. Alexander sat with his hands clenched\r\non his knees. As the carriage turned up the hill, he lifted one hand and\r\nbrought it down violently. \"This time\"--he spoke aloud and through his\r\nset teeth--\"this time I'm going to end it!\"\r\n\r\n\r\nOn the afternoon of the third day out, Alexander was sitting well to the\r\nstern, on the windward side where the chairs were few, his rugs over\r\nhim and the collar of his fur-lined coat turned up about his ears. The\r\nweather had so far been dark and raw. For two hours he had been\r\nwatching the low, dirty sky and the beating of the heavy rain upon\r\nthe iron-colored sea. There was a long, oily swell that made exercise\r\nlaborious. The decks smelled of damp woolens, and the air was so humid\r\nthat drops of moisture kept gathering upon his hair and mustache. He\r\nseldom moved except to brush them away. The great open spaces made\r\nhim passive and the restlessness of the water quieted him. He intended\r\nduring the voyage to decide upon a course of action, but he held all\r\nthis away from him for the present and lay in a blessed gray\r\noblivion. Deep down in him somewhere his resolution was weakening and\r\nstrengthening, ebbing and flowing. The thing that perturbed him went on\r\nas steadily as his pulse, but he was almost unconscious of it. He was\r\nsubmerged in the vast impersonal grayness about him, and at intervals\r\nthe sidelong roll of the boat measured off time like the ticking of a\r\nclock. He felt released from everything that troubled and perplexed\r\nhim. It was as if he had tricked and outwitted torturing memories, had\r\nactually managed to get on board without them. He thought of nothing at\r\nall. If his mind now and again picked a face out of the grayness, it was\r\nLucius Wilson's, or the face of an old schoolmate, forgotten for years;\r\nor it was the slim outline of a favorite greyhound he used to hunt\r\njack-rabbits with when he was a boy.\r\n\r\nToward six o'clock the wind rose and tugged at the tarpaulin and brought\r\nthe swell higher. After dinner Alexander came back to the wet deck,\r\npiled his damp rugs over him again, and sat smoking, losing himself in\r\nthe obliterating blackness and drowsing in the rush of the gale. Before\r\nhe went below a few bright stars were pricked off between heavily moving\r\nmasses of cloud.\r\n\r\nThe next morning was bright and mild, with a fresh breeze. Alexander\r\nfelt the need of exercise even before he came out of his cabin. When he\r\nwent on deck the sky was blue and blinding, with heavy whiffs of white\r\ncloud, smoke-colored at the edges, moving rapidly across it. The water\r\nwas roughish, a cold, clear indigo breaking into whitecaps. Bartley\r\nwalked for two hours, and then stretched himself in the sun until\r\nlunch-time.\r\n\r\nIn the afternoon he wrote a long letter to Winifred. Later, as he walked\r\nthe deck through a splendid golden sunset, his spirits rose continually.\r\nIt was agreeable to come to himself again after several days of numbness\r\nand torpor. He stayed out until the last tinge of violet had faded from\r\nthe water. There was literally a taste of life on his lips as he\r\nsat down to dinner and ordered a bottle of champagne. He was late in\r\nfinishing his dinner, and drank rather more wine than he had meant to.\r\nWhen he went above, the wind had risen and the deck was almost deserted.\r\nAs he stepped out of the door a gale lifted his heavy fur coat about\r\nhis shoulders. He fought his way up the deck with keen exhilaration.\r\nThe moment he stepped, almost out of breath, behind the shelter of the\r\nstern, the wind was cut off, and he felt, like a rush of warm air, a\r\nsense of close and intimate companionship. He started back and tore his\r\ncoat open as if something warm were actually clinging to him beneath it.\r\nHe hurried up the deck and went into the saloon parlor, full of women\r\nwho had retreated thither from the sharp wind. He threw himself upon\r\nthem. He talked delightfully to the older ones and played accompaniments\r\nfor the younger ones until the last sleepy girl had followed her mother\r\nbelow. Then he went into the smoking-room. He played bridge until two\r\no'clock in the morning, and managed to lose a considerable sum of money\r\nwithout really noticing that he was doing so.\r\n\r\nAfter the break of one fine day the weather was pretty consistently\r\ndull. When the low sky thinned a trifle, the pale white spot of a sun\r\ndid no more than throw a bluish lustre on the water, giving it the dark\r\nbrightness of newly cut lead. Through one after another of those gray\r\ndays Alexander drowsed and mused, drinking in the grateful moisture. But\r\nthe complete peace of the first part of the voyage was over. Sometimes\r\nhe rose suddenly from his chair as if driven out, and paced the deck for\r\nhours. People noticed his propensity for walking in rough weather, and\r\nwatched him curiously as he did his rounds. From his abstraction and the\r\ndetermined set of his jaw, they fancied he must be thinking about his\r\nbridge. Every one had heard of the new cantilever bridge in Canada.\r\n\r\nBut Alexander was not thinking about his work. After the fourth night\r\nout, when his will suddenly softened under his hands, he had been\r\ncontinually hammering away at himself. More and more often, when he\r\nfirst wakened in the morning or when he stepped into a warm place after\r\nbeing chilled on the deck, he felt a sudden painful delight at being\r\nnearer another shore. Sometimes when he was most despondent, when he\r\nthought himself worn out with this struggle, in a flash he was free\r\nof it and leaped into an overwhelming consciousness of himself. On the\r\ninstant he felt that marvelous return of the impetuousness, the intense\r\nexcitement, the increasing expectancy of youth.\r\n\r\n\r\n\r\nCHAPTER VI\r\n\r\n\r\nThe last two days of the voyage Bartley found almost intolerable. The\r\nstop at Queenstown, the tedious passage up the Mersey, were things that\r\nhe noted dimly through his growing impatience. He had planned to stop in\r\nLiverpool; but, instead, he took the boat train for London.\r\n\r\nEmerging at Euston at half-past three o'clock in the afternoon,\r\nAlexander had his luggage sent to the Savoy and drove at once to Bedford\r\nSquare. When Marie met him at the door, even her strong sense of the\r\nproprieties could not restrain her surprise and delight. She blushed and\r\nsmiled and fumbled his card in her confusion before she ran upstairs.\r\nAlexander paced up and down the hallway, buttoning and unbuttoning his\r\novercoat, until she returned and took him up to Hilda's living-room. The\r\nroom was empty when he entered. A coal fire was crackling in the grate\r\nand the lamps were lit, for it was already beginning to grow dark\r\noutside. Alexander did not sit down. He stood his ground over by the\r\nwindows until Hilda came in. She called his name on the threshold, but\r\nin her swift flight across the room she felt a change in him and caught\r\nherself up so deftly that he could not tell just when she did it.\r\nShe merely brushed his cheek with her lips and put a hand lightly and\r\njoyously on either shoulder. \"Oh, what a grand thing to happen on a\r\nraw day! I felt it in my bones when I woke this morning that something\r\nsplendid was going to turn up. I thought it might be Sister Kate or\r\nCousin Mike would be happening along. I never dreamed it would be you,\r\nBartley. But why do you let me chatter on like this? Come over to the\r\nfire; you're chilled through.\"\r\n\r\nShe pushed him toward the big chair by the fire, and sat down on a stool\r\nat the opposite side of the hearth, her knees drawn up to her chin,\r\nlaughing like a happy little girl.\r\n\r\n\"When did you come, Bartley, and how did it happen? You haven't spoken a\r\nword.\"\r\n\r\n\"I got in about ten minutes ago. I landed at Liverpool this morning and\r\ncame down on the boat train.\"\r\n\r\nAlexander leaned forward and warmed his hands before the blaze. Hilda\r\nwatched him with perplexity.\r\n\r\n\"There's something troubling you, Bartley. What is it?\"\r\n\r\nBartley bent lower over the fire. \"It's the whole thing that troubles\r\nme, Hilda. You and I.\"\r\n\r\nHilda took a quick, soft breath. She looked at his heavy shoulders and\r\nbig, determined head, thrust forward like a catapult in leash.\r\n\r\n\"What about us, Bartley?\" she asked in a thin voice.\r\n\r\nHe locked and unlocked his hands over the grate and spread his fingers\r\nclose to the bluish flame, while the coals crackled and the clock ticked\r\nand a street vendor began to call under the window. At last Alexander\r\nbrought out one word:--\r\n\r\n\"Everything!\"\r\n\r\nHilda was pale by this time, and her eyes were wide with fright. She\r\nlooked about desperately from Bartley to the door, then to the windows,\r\nand back again to Bartley. She rose uncertainly, touched his hair with\r\nher hand, then sank back upon her stool.\r\n\r\n\"I'll do anything you wish me to, Bartley,\" she said tremulously. \"I\r\ncan't stand seeing you miserable.\"\r\n\r\n\"I can't live with myself any longer,\" he answered roughly.\r\n\r\nHe rose and pushed the chair behind him and began to walk miserably\r\nabout the room, seeming to find it too small for him. He pulled up a\r\nwindow as if the air were heavy.\r\n\r\nHilda watched him from her corner, trembling and scarcely breathing,\r\ndark shadows growing about her eyes.\r\n\r\n\"It . . . it hasn't always made you miserable, has it?\" Her eyelids fell\r\nand her lips quivered.\r\n\r\n\"Always. But it's worse now. It's unbearable. It tortures me every\r\nminute.\"\r\n\r\n\"But why NOW?\" she asked piteously, wringing her hands.\r\n\r\nHe ignored her question. \"I am not a man who can live two lives,\" he\r\nwent on feverishly. \"Each life spoils the other. I get nothing but\r\nmisery out of either. The world is all there, just as it used to be,\r\nbut I can't get at it any more. There is this deception between me and\r\neverything.\"\r\n\r\nAt that word \"deception,\" spoken with such self-contempt, the color\r\nflashed back into Hilda's face as suddenly as if she had been struck\r\nby a whiplash. She bit her lip and looked down at her hands, which were\r\nclasped tightly in front of her.\r\n\r\n\"Could you--could you sit down and talk about it quietly, Bartley, as if\r\nI were a friend, and not some one who had to be defied?\"\r\n\r\nHe dropped back heavily into his chair by the fire. \"It was myself I was\r\ndefying, Hilda. I have thought about it until I am worn out.\"\r\n\r\nHe looked at her and his haggard face softened. He put out his hand\r\ntoward her as he looked away again into the fire.\r\n\r\nShe crept across to him, drawing her stool after her. \"When did you\r\nfirst begin to feel like this, Bartley?\"\r\n\r\n\"After the very first. The first was--sort of in play, wasn't it?\"\r\n\r\nHilda's face quivered, but she whispered: \"Yes, I think it must have\r\nbeen. But why didn't you tell me when you were here in the summer?\"\r\n\r\nAlexander groaned. \"I meant to, but somehow I couldn't. We had only a\r\nfew days, and your new play was just on, and you were so happy.\"\r\n\r\n\"Yes, I was happy, wasn't I?\" She pressed his hand gently in gratitude.\r\n\"Weren't you happy then, at all?\"\r\n\r\nShe closed her eyes and took a deep breath, as if to draw in again the\r\nfragrance of those days. Something of their troubling sweetness came\r\nback to Alexander, too. He moved uneasily and his chair creaked.\r\n\r\n\"Yes, I was then. You know. But afterward. . .\"\r\n\r\n\"Yes, yes,\" she hurried, pulling her hand gently away from him.\r\nPresently it stole back to his coat sleeve. \"Please tell me one thing,\r\nBartley. At least, tell me that you believe I thought I was making you\r\nhappy.\"\r\n\r\nHis hand shut down quickly over the questioning fingers on his sleeves.\r\n\"Yes, Hilda; I know that,\" he said simply.\r\n\r\nShe leaned her head against his arm and spoke softly:--\r\n\r\n\"You see, my mistake was in wanting you to have everything. I wanted you\r\nto eat all the cakes and have them, too. I somehow believed that I could\r\ntake all the bad consequences for you. I wanted you always to be happy\r\nand handsome and successful--to have all the things that a great man\r\nought to have, and, once in a way, the careless holidays that great men\r\nare not permitted.\"\r\n\r\nBartley gave a bitter little laugh, and Hilda looked up and read in the\r\ndeepening lines of his face that youth and Bartley would not much longer\r\nstruggle together.\r\n\r\n\"I understand, Bartley. I was wrong. But I didn't know. You've only to\r\ntell me now. What must I do that I've not done, or what must I not do?\"\r\nShe listened intently, but she heard nothing but the creaking of his\r\nchair. \"You want me to say it?\" she whispered. \"You want to tell me that\r\nyou can only see me like this, as old friends do, or out in the world\r\namong people? I can do that.\"\r\n\r\n\"I can't,\" he said heavily.\r\n\r\nHilda shivered and sat still. Bartley leaned his head in his hands and\r\nspoke through his teeth. \"It's got to be a clean break, Hilda. I can't\r\nsee you at all, anywhere. What I mean is that I want you to promise\r\nnever to see me again, no matter how often I come, no matter how hard I\r\nbeg.\"\r\n\r\nHilda sprang up like a flame. She stood over him with her hands clenched\r\nat her side, her body rigid.\r\n\r\n\"No!\" she gasped. \"It's too late to ask that. Do you hear me, Bartley?\r\nIt's too late. I won't promise. It's abominable of you to ask me. Keep\r\naway if you wish; when have I ever followed you? But, if you come to me,\r\nI'll do as I see fit. The shamefulness of your asking me to do that! If\r\nyou come to me, I'll do as I see fit. Do you understand? Bartley, you're\r\ncowardly!\"\r\n\r\nAlexander rose and shook himself angrily. \"Yes, I know I'm cowardly.\r\nI'm afraid of myself. I don't trust myself any more. I carried it all\r\nlightly enough at first, but now I don't dare trifle with it. It's\r\ngetting the better of me. It's different now. I'm growing older, and\r\nyou've got my young self here with you. It's through him that I've come\r\nto wish for you all and all the time.\" He took her roughly in his arms.\r\n\"Do you know what I mean?\"\r\n\r\nHilda held her face back from him and began to cry bitterly. \"Oh,\r\nBartley, what am I to do? Why didn't you let me be angry with you? You\r\nask me to stay away from you because you want me! And I've got nobody\r\nbut you. I will do anything you say--but that! I will ask the least\r\nimaginable, but I must have SOMETHING!\"\r\n\r\nBartley turned away and sank down in his chair again. Hilda sat on the\r\narm of it and put her hands lightly on his shoulders.\r\n\r\n\"Just something Bartley. I must have you to think of through the months\r\nand months of loneliness. I must see you. I must know about you. The\r\nsight of you, Bartley, to see you living and happy and successful--can\r\nI never make you understand what that means to me?\" She pressed his\r\nshoulders gently. \"You see, loving some one as I love you makes the\r\nwhole world different. If I'd met you later, if I hadn't loved you so\r\nwell--but that's all over, long ago. Then came all those years without\r\nyou, lonely and hurt and discouraged; those decent young fellows and\r\npoor Mac, and me never heeding--hard as a steel spring. And then you\r\ncame back, not caring very much, but it made no difference.\"\r\n\r\nShe slid to the floor beside him, as if she were too tired to sit up any\r\nlonger. Bartley bent over and took her in his arms, kissing her mouth\r\nand her wet, tired eyes.\r\n\r\n\"Don't cry, don't cry,\" he whispered. \"We've tortured each other enough\r\nfor tonight. Forget everything except that I am here.\"\r\n\r\n\"I think I have forgotten everything but that already,\" she murmured.\r\n\"Ah, your dear arms!\"\r\n\r\n\r\n\r\nCHAPTER VII\r\n\r\n\r\nDuring the fortnight that Alexander was in London he drove himself hard.\r\nHe got through a great deal of personal business and saw a great many\r\nmen who were doing interesting things in his own profession. He disliked\r\nto think of his visits to London as holidays, and when he was there he\r\nworked even harder than he did at home.\r\n\r\nThe day before his departure for Liverpool was a singularly fine one.\r\nThe thick air had cleared overnight in a strong wind which brought in a\r\ngolden dawn and then fell off to a fresh breeze. When Bartley looked\r\nout of his windows from the Savoy, the river was flashing silver and the\r\ngray stone along the Embankment was bathed in bright, clear sunshine.\r\nLondon had wakened to life after three weeks of cold and sodden rain.\r\nBartley breakfasted hurriedly and went over his mail while the hotel\r\nvalet packed his trunks. Then he paid his account and walked rapidly\r\ndown the Strand past Charing Cross Station. His spirits rose with every\r\nstep, and when he reached Trafalgar Square, blazing in the sun, with\r\nits fountains playing and its column reaching up into the bright air,\r\nhe signaled to a hansom, and, before he knew what he was about, told the\r\ndriver to go to Bedford Square by way of the British Museum.\r\n\r\nWhen he reached Hilda's apartment she met him, fresh as the morning\r\nitself. Her rooms were flooded with sunshine and full of the flowers he\r\nhad been sending her. She would never let him give her anything else.\r\n\r\n\"Are you busy this morning, Hilda?\" he asked as he sat down, his hat and\r\ngloves in his hand.\r\n\r\n\"Very. I've been up and about three hours, working at my part. We open\r\nin February, you know.\"\r\n\r\n\"Well, then you've worked enough. And so have I. I've seen all my men,\r\nmy packing is done, and I go up to Liverpool this evening. But this\r\nmorning we are going to have a holiday. What do you say to a drive out\r\nto Kew and Richmond? You may not get another day like this all winter.\r\nIt's like a fine April day at home. May I use your telephone? I want to\r\norder the carriage.\"\r\n\r\n\"Oh, how jolly! There, sit down at the desk. And while you are\r\ntelephoning I'll change my dress. I shan't be long. All the morning\r\npapers are on the table.\"\r\n\r\nHilda was back in a few moments wearing a long gray squirrel coat and a\r\nbroad fur hat.\r\n\r\nBartley rose and inspected her. \"Why don't you wear some of those pink\r\nroses?\" he asked.\r\n\r\n\"But they came only this morning, and they have not even begun to open.\r\nI was saving them. I am so unconsciously thrifty!\" She laughed as she\r\nlooked about the room. \"You've been sending me far too many flowers,\r\nBartley. New ones every day. That's too often; though I do love to open\r\nthe boxes, and I take good care of them.\"\r\n\r\n\"Why won't you let me send you any of those jade or ivory things you are\r\nso fond of? Or pictures? I know a good deal about pictures.\"\r\n\r\nHilda shook her large hat as she drew the roses out of the tall glass.\r\n\"No, there are some things you can't do. There's the carriage. Will you\r\nbutton my gloves for me?\"\r\n\r\nBartley took her wrist and began to button the long gray suede glove.\r\n\"How gay your eyes are this morning, Hilda.\"\r\n\r\n\"That's because I've been studying. It always stirs me up a little.\"\r\n\r\nHe pushed the top of the glove up slowly. \"When did you learn to take\r\nhold of your parts like that?\"\r\n\r\n\"When I had nothing else to think of. Come, the carriage is waiting.\r\nWhat a shocking while you take.\"\r\n\r\n\"I'm in no hurry. We've plenty of time.\"\r\n\r\nThey found all London abroad. Piccadilly was a stream of rapidly\r\nmoving carriages, from which flashed furs and flowers and bright winter\r\ncostumes. The metal trappings of the harnesses shone dazzlingly, and the\r\nwheels were revolving disks that threw off rays of light. The parks were\r\nfull of children and nursemaids and joyful dogs that leaped and yelped\r\nand scratched up the brown earth with their paws.\r\n\r\n\"I'm not going until to-morrow, you know,\" Bartley announced suddenly.\r\n\"I'll cut off a day in Liverpool. I haven't felt so jolly this long\r\nwhile.\"\r\n\r\nHilda looked up with a smile which she tried not to make too glad. \"I\r\nthink people were meant to be happy, a little,\" she said.\r\n\r\nThey had lunch at Richmond and then walked to Twickenham, where they had\r\nsent the carriage. They drove back, with a glorious sunset behind them,\r\ntoward the distant gold-washed city. It was one of those rare afternoons\r\nwhen all the thickness and shadow of London are changed to a kind of\r\nshining, pulsing, special atmosphere; when the smoky vapors become\r\nfluttering golden clouds, nacreous veils of pink and amber; when all\r\nthat bleakness of gray stone and dullness of dirty brick trembles in\r\naureate light, and all the roofs and spires, and one great dome, are\r\nfloated in golden haze. On such rare afternoons the ugliest of cities\r\nbecomes the most poetic, and months of sodden days are offset by a\r\nmoment of miracle.\r\n\r\n\"It's like that with us Londoners, too,\" Hilda was saying. \"Everything\r\nis awfully grim and cheerless, our weather and our houses and our ways\r\nof amusing ourselves. But we can be happier than anybody. We can go mad\r\nwith joy, as the people do out in the fields on a fine Whitsunday. We\r\nmake the most of our moment.\"\r\n\r\nShe thrust her little chin out defiantly over her gray fur collar, and\r\nBartley looked down at her and laughed.\r\n\r\n\"You are a plucky one, you.\" He patted her glove with his hand. \"Yes,\r\nyou are a plucky one.\"\r\n\r\nHilda sighed. \"No, I'm not. Not about some things, at any rate. It\r\ndoesn't take pluck to fight for one's moment, but it takes pluck to go\r\nwithout--a lot. More than I have. I can't help it,\" she added fiercely.\r\n\r\nAfter miles of outlying streets and little gloomy houses, they reached\r\nLondon itself, red and roaring and murky, with a thick dampness coming\r\nup from the river, that betokened fog again to-morrow. The streets were\r\nfull of people who had worked indoors all through the priceless day and\r\nhad now come hungrily out to drink the muddy lees of it. They stood\r\nin long black lines, waiting before the pit entrances of the\r\ntheatres--short-coated boys, and girls in sailor hats, all shivering\r\nand chatting gayly. There was a blurred rhythm in all the dull city\r\nnoises--in the clatter of the cab horses and the rumbling of the busses,\r\nin the street calls, and in the undulating tramp, tramp of the crowd. It\r\nwas like the deep vibration of some vast underground machinery, and like\r\nthe muffled pulsations of millions of human hearts.\r\n\r\n[See \"The Barrel Organ by Alfred Noyes. Ed.] [I have placed it at the\r\nend for your convenience]\r\n\r\n\"Seems good to get back, doesn't it?\" Bartley whispered, as they drove\r\nfrom Bayswater Road into Oxford Street. \"London always makes me want to\r\nlive more than any other city in the world. You remember our priestess\r\nmummy over in the mummy-room, and how we used to long to go and bring\r\nher out on nights like this? Three thousand years! Ugh!\"\r\n\r\n\"All the same, I believe she used to feel it when we stood there and\r\nwatched her and wished her well. I believe she used to remember,\" Hilda\r\nsaid thoughtfully.\r\n\r\n\"I hope so. Now let's go to some awfully jolly place for dinner before\r\nwe go home. I could eat all the dinners there are in London to-night.\r\nWhere shall I tell the driver? The Piccadilly Restaurant? The music's\r\ngood there.\"\r\n\r\n\"There are too many people there whom one knows. Why not that little\r\nFrench place in Soho, where we went so often when you were here in\r\nthe summer? I love it, and I've never been there with any one but you.\r\nSometimes I go by myself, when I am particularly lonely.\"\r\n\r\n\"Very well, the sole's good there. How many street pianos there are\r\nabout to-night! The fine weather must have thawed them out. We've had\r\nfive miles of `Il Trovatore' now. They always make me feel jaunty. Are\r\nyou comfy, and not too tired?\"\r\n\r\n\"I'm not tired at all. I was just wondering how people can ever die.\r\nWhy did you remind me of the mummy? Life seems the strongest and most\r\nindestructible thing in the world. Do you really believe that all those\r\npeople rushing about down there, going to good dinners and clubs and\r\ntheatres, will be dead some day, and not care about anything? I don't\r\nbelieve it, and I know I shan't die, ever! You see, I feel too--too\r\npowerful!\"\r\n\r\nThe carriage stopped. Bartley sprang out and swung her quickly to\r\nthe pavement. As he lifted her in his two hands he whispered: \"You\r\nare--powerful!\"\r\n\r\n\r\n\r\nCHAPTER VIII\r\n\r\n\r\nThe last rehearsal was over, a tedious dress rehearsal which had lasted\r\nall day and exhausted the patience of every one who had to do with it.\r\nWhen Hilda had dressed for the street and came out of her dressing-room,\r\nshe found Hugh MacConnell waiting for her in the corridor.\r\n\r\n\"The fog's thicker than ever, Hilda. There have been a great many\r\naccidents to-day. It's positively unsafe for you to be out alone. Will\r\nyou let me take you home?\"\r\n\r\n\"How good of you, Mac. If you are going with me, I think I'd rather\r\nwalk. I've had no exercise to-day, and all this has made me nervous.\"\r\n\r\n\"I shouldn't wonder,\" said MacConnell dryly. Hilda pulled down her\r\nveil and they stepped out into the thick brown wash that submerged St.\r\nMartin's Lane. MacConnell took her hand and tucked it snugly under his\r\narm. \"I'm sorry I was such a savage. I hope you didn't think I made an\r\nass of myself.\"\r\n\r\n\"Not a bit of it. I don't wonder you were peppery. Those things are\r\nawfully trying. How do you think it's going?\"\r\n\r\n\"Magnificently. That's why I got so stirred up. We are going to hear\r\nfrom this, both of us. And that reminds me; I've got news for you. They\r\nare going to begin repairs on the theatre about the middle of March, and\r\nwe are to run over to New York for six weeks. Bennett told me yesterday\r\nthat it was decided.\"\r\n\r\nHilda looked up delightedly at the tall gray figure beside her. He\r\nwas the only thing she could see, for they were moving through a dense\r\nopaqueness, as if they were walking at the bottom of the ocean.\r\n\r\n\"Oh, Mac, how glad I am! And they love your things over there, don't\r\nthey?\"\r\n\r\n\"Shall you be glad for--any other reason, Hilda?\"\r\n\r\nMacConnell put his hand in front of her to ward off some dark object. It\r\nproved to be only a lamp-post, and they beat in farther from the edge of\r\nthe pavement.\r\n\r\n\"What do you mean, Mac?\" Hilda asked nervously.\r\n\r\n\"I was just thinking there might be people over there you'd be glad to\r\nsee,\" he brought out awkwardly. Hilda said nothing, and as they walked\r\non MacConnell spoke again, apologetically: \"I hope you don't mind my\r\nknowing about it, Hilda. Don't stiffen up like that. No one else knows,\r\nand I didn't try to find out anything. I felt it, even before I knew who\r\nhe was. I knew there was somebody, and that it wasn't I.\"\r\n\r\nThey crossed Oxford Street in silence, feeling their way. The busses had\r\nstopped running and the cab-drivers were leading their horses. When\r\nthey reached the other side, MacConnell said suddenly, \"I hope you are\r\nhappy.\"\r\n\r\n\"Terribly, dangerously happy, Mac,\"--Hilda spoke quietly, pressing the\r\nrough sleeve of his greatcoat with her gloved hand.\r\n\r\n\"You've always thought me too old for you, Hilda,--oh, of course you've\r\nnever said just that,--and here this fellow is not more than eight years\r\nyounger than I. I've always felt that if I could get out of my old case\r\nI might win you yet. It's a fine, brave youth I carry inside me, only\r\nhe'll never be seen.\"\r\n\r\n\"Nonsense, Mac. That has nothing to do with it. It's because you seem\r\ntoo close to me, too much my own kind. It would be like marrying Cousin\r\nMike, almost. I really tried to care as you wanted me to, away back in\r\nthe beginning.\"\r\n\r\n\"Well, here we are, turning out of the Square. You are not angry with\r\nme, Hilda? Thank you for this walk, my dear. Go in and get dry things on\r\nat once. You'll be having a great night to-morrow.\"\r\n\r\nShe put out her hand. \"Thank you, Mac, for everything. Good-night.\"\r\n\r\nMacConnell trudged off through the fog, and she went slowly upstairs.\r\nHer slippers and dressing gown were waiting for her before the fire. \"I\r\nshall certainly see him in New York. He will see by the papers that we\r\nare coming. Perhaps he knows it already,\" Hilda kept thinking as she\r\nundressed. \"Perhaps he will be at the dock. No, scarcely that; but I may\r\nmeet him in the street even before he comes to see me.\" Marie placed\r\nthe tea-table by the fire and brought Hilda her letters. She looked them\r\nover, and started as she came to one in a handwriting that she did not\r\noften see; Alexander had written to her only twice before, and he did\r\nnot allow her to write to him at all. \"Thank you, Marie. You may go\r\nnow.\"\r\n\r\n\r\nHilda sat down by the table with the letter in her hand, still unopened.\r\nShe looked at it intently, turned it over, and felt its thickness with\r\nher fingers. She believed that she sometimes had a kind of second-sight\r\nabout letters, and could tell before she read them whether they brought\r\ngood or evil tidings. She put this one down on the table in front of her\r\nwhile she poured her tea. At last, with a little shiver of expectancy,\r\nshe tore open the envelope and read:--\r\n\r\n\r\nBoston, February --\r\n\r\nMY DEAR HILDA:--\r\n\r\nIt is after twelve o'clock. Every one else is in bed and I am sitting\r\nalone in my study. I have been happier in this room than anywhere else\r\nin the world. Happiness like that makes one insolent. I used to think\r\nthese four walls could stand against anything. And now I scarcely know\r\nmyself here. Now I know that no one can build his security upon the\r\nnobleness of another person. Two people, when they love each other,\r\ngrow alike in their tastes and habits and pride, but their moral natures\r\n(whatever we may mean by that canting expression) are never welded. The\r\nbase one goes on being base, and the noble one noble, to the end.\r\n\r\nThe last week has been a bad one; I have been realizing how things used\r\nto be with me. Sometimes I get used to being dead inside, but lately it\r\nhas been as if a window beside me had suddenly opened, and as if all the\r\nsmells of spring blew in to me. There is a garden out there, with stars\r\noverhead, where I used to walk at night when I had a single purpose and\r\na single heart. I can remember how I used to feel there, how beautiful\r\neverything about me was, and what life and power and freedom I felt in\r\nmyself. When the window opens I know exactly how it would feel to be out\r\nthere. But that garden is closed to me. How is it, I ask myself, that\r\neverything can be so different with me when nothing here has changed?\r\nI am in my own house, in my own study, in the midst of all these quiet\r\nstreets where my friends live. They are all safe and at peace with\r\nthemselves. But I am never at peace. I feel always on the edge of danger\r\nand change.\r\n\r\nI keep remembering locoed horses I used to see on the range when I was\r\na boy. They changed like that. We used to catch them and put them up in\r\nthe corral, and they developed great cunning. They would pretend to eat\r\ntheir oats like the other horses, but we knew they were always scheming\r\nto get back at the loco.\r\n\r\nIt seems that a man is meant to live only one life in this world. When\r\nhe tries to live a second, he develops another nature. I feel as if\r\na second man had been grafted into me. At first he seemed only a\r\npleasure-loving simpleton, of whose company I was rather ashamed, and\r\nwhom I used to hide under my coat when I walked the Embankment, in\r\nLondon. But now he is strong and sullen, and he is fighting for his\r\nlife at the cost of mine. That is his one activity: to grow strong. No\r\ncreature ever wanted so much to live. Eventually, I suppose, he will\r\nabsorb me altogether. Believe me, you will hate me then.\r\n\r\nAnd what have you to do, Hilda, with this ugly story? Nothing at all.\r\nThe little boy drank of the prettiest brook in the forest and he became\r\na stag. I write all this because I can never tell it to you, and because\r\nit seems as if I could not keep silent any longer. And because I suffer,\r\nHilda. If any one I loved suffered like this, I'd want to know it. Help\r\nme, Hilda!\r\n\r\nB.A.\r\n\r\n\r\n\r\nCHAPTER IX\r\n\r\n\r\nOn the last Saturday in April, the New York \"Times\" published an account\r\nof the strike complications which were delaying Alexander's New Jersey\r\nbridge, and stated that the engineer himself was in town and at his\r\noffice on West Tenth Street.\r\n\r\nOn Sunday, the day after this notice appeared, Alexander worked all day\r\nat his Tenth Street rooms. His business often called him to New York,\r\nand he had kept an apartment there for years, subletting it when he went\r\nabroad for any length of time. Besides his sleeping-room and bath, there\r\nwas a large room, formerly a painter's studio, which he used as a\r\nstudy and office. It was furnished with the cast-off possessions of his\r\nbachelor days and with odd things which he sheltered for friends of\r\nhis who followed itinerant and more or less artistic callings. Over the\r\nfireplace there was a large old-fashioned gilt mirror. Alexander's big\r\nwork-table stood in front of one of the three windows, and above the\r\ncouch hung the one picture in the room, a big canvas of charming color\r\nand spirit, a study of the Luxembourg Gardens in early spring, painted\r\nin his youth by a man who had since become a portrait-painter of\r\ninternational renown. He had done it for Alexander when they were\r\nstudents together in Paris.\r\n\r\n\r\nSunday was a cold, raw day and a fine rain fell continuously. When\r\nAlexander came back from dinner he put more wood on his fire, made\r\nhimself comfortable, and settled down at his desk, where he began\r\nchecking over estimate sheets. It was after nine o'clock and he was\r\nlighting a second pipe, when he thought he heard a sound at his door.\r\nHe started and listened, holding the burning match in his hand; again\r\nhe heard the same sound, like a firm, light tap. He rose and crossed the\r\nroom quickly. When he threw open the door he recognized the figure that\r\nshrank back into the bare, dimly lit hallway. He stood for a moment in\r\nawkward constraint, his pipe in his hand.\r\n\r\n\"Come in,\" he said to Hilda at last, and closed the door behind her. He\r\npointed to a chair by the fire and went back to his worktable. \"Won't\r\nyou sit down?\"\r\n\r\nHe was standing behind the table, turning over a pile of blueprints\r\nnervously. The yellow light from the student's lamp fell on his hands\r\nand the purple sleeves of his velvet smoking-jacket, but his flushed\r\nface and big, hard head were in the shadow. There was something about\r\nhim that made Hilda wish herself at her hotel again, in the street\r\nbelow, anywhere but where she was.\r\n\r\n\"Of course I know, Bartley,\" she said at last, \"that after this you\r\nwon't owe me the least consideration. But we sail on Tuesday. I saw that\r\ninterview in the paper yesterday, telling where you were, and I thought\r\nI had to see you. That's all. Good-night; I'm going now.\" She turned and\r\nher hand closed on the door-knob.\r\n\r\nAlexander hurried toward her and took her gently by the arm. \"Sit down,\r\nHilda; you're wet through. Let me take off your coat--and your boots;\r\nthey're oozing water.\" He knelt down and began to unlace her shoes,\r\nwhile Hilda shrank into the chair. \"Here, put your feet on this stool.\r\nYou don't mean to say you walked down--and without overshoes!\"\r\n\r\nHilda hid her face in her hands. \"I was afraid to take a cab. Can't you\r\nsee, Bartley, that I'm terribly frightened? I've been through this a\r\nhundred times to-day. Don't be any more angry than you can help. I was\r\nall right until I knew you were in town. If you'd sent me a note, or\r\ntelephoned me, or anything! But you won't let me write to you, and I had\r\nto see you after that letter, that terrible letter you wrote me when you\r\ngot home.\"\r\n\r\nAlexander faced her, resting his arm on the mantel behind him, and began\r\nto brush the sleeve of his jacket. \"Is this the way you mean to answer\r\nit, Hilda?\" he asked unsteadily.\r\n\r\nShe was afraid to look up at him. \"Didn't--didn't you mean even to say\r\ngoodby to me, Bartley? Did you mean just to--quit me?\" she asked. \"I\r\ncame to tell you that I'm willing to do as you asked me. But it's no use\r\ntalking about that now. Give me my things, please.\" She put her hand out\r\ntoward the fender.\r\n\r\nAlexander sat down on the arm of her chair. \"Did you think I had\r\nforgotten you were in town, Hilda? Do you think I kept away by accident?\r\nDid you suppose I didn't know you were sailing on Tuesday? There is a\r\nletter for you there, in my desk drawer. It was to have reached you on\r\nthe steamer. I was all the morning writing it. I told myself that if I\r\nwere really thinking of you, and not of myself, a letter would be better\r\nthan nothing. Marks on paper mean something to you.\" He paused. \"They\r\nnever did to me.\"\r\n\r\nHilda smiled up at him beautifully and put her hand on his sleeve. \"Oh,\r\nBartley! Did you write to me? Why didn't you telephone me to let me know\r\nthat you had? Then I wouldn't have come.\"\r\n\r\nAlexander slipped his arm about her. \"I didn't know it before, Hilda,\r\non my honor I didn't, but I believe it was because, deep down in me\r\nsomewhere, I was hoping I might drive you to do just this. I've watched\r\nthat door all day. I've jumped up if the fire crackled. I think I have\r\nfelt that you were coming.\" He bent his face over her hair.\r\n\r\n\"And I,\" she whispered,--\"I felt that you were feeling that. But when I\r\ncame, I thought I had been mistaken.\"\r\n\r\nAlexander started up and began to walk up and down the room.\r\n\r\n\"No, you weren't mistaken. I've been up in Canada with my bridge, and\r\nI arranged not to come to New York until after you had gone. Then, when\r\nyour manager added two more weeks, I was already committed.\" He dropped\r\nupon the stool in front of her and sat with his hands hanging between\r\nhis knees. \"What am I to do, Hilda?\"\r\n\r\n\"That's what I wanted to see you about, Bartley. I'm going to do\r\nwhat you asked me to do when you were in London. Only I'll do it more\r\ncompletely. I'm going to marry.\"\r\n\r\n\"Who?\"\r\n\r\n\"Oh, it doesn't matter much! One of them. Only not Mac. I'm too fond of\r\nhim.\"\r\n\r\nAlexander moved restlessly. \"Are you joking, Hilda?\"\r\n\r\n\"Indeed I'm not.\"\r\n\r\n\"Then you don't know what you're talking about.\"\r\n\r\n\"Yes, I know very well. I've thought about it a great deal, and I've\r\nquite decided. I never used to understand how women did things like\r\nthat, but I know now. It's because they can't be at the mercy of the man\r\nthey love any longer.\"\r\n\r\nAlexander flushed angrily. \"So it's better to be at the mercy of a man\r\nyou don't love?\"\r\n\r\n\"Under such circumstances, infinitely!\"\r\n\r\nThere was a flash in her eyes that made Alexander's fall. He got up and\r\nwent over to the window, threw it open, and leaned out. He heard Hilda\r\nmoving about behind him. When he looked over his shoulder she was lacing\r\nher boots. He went back and stood over her.\r\n\r\n\"Hilda you'd better think a while longer before you do that. I don't\r\nknow what I ought to say, but I don't believe you'd be happy; truly I\r\ndon't. Aren't you trying to frighten me?\"\r\n\r\nShe tied the knot of the last lacing and put her boot-heel down firmly.\r\n\"No; I'm telling you what I've made up my mind to do. I suppose I\r\nwould better do it without telling you. But afterward I shan't have an\r\nopportunity to explain, for I shan't be seeing you again.\"\r\n\r\nAlexander started to speak, but caught himself. When Hilda rose he sat\r\ndown on the arm of her chair and drew her back into it.\r\n\r\n\"I wouldn't be so much alarmed if I didn't know how utterly reckless\r\nyou CAN be. Don't do anything like that rashly.\" His face grew troubled.\r\n\"You wouldn't be happy. You are not that kind of woman. I'd never have\r\nanother hour's peace if I helped to make you do a thing like that.\" He\r\ntook her face between his hands and looked down into it. \"You see, you\r\nare different, Hilda. Don't you know you are?\" His voice grew softer,\r\nhis touch more and more tender. \"Some women can do that sort of thing,\r\nbut you--you can love as queens did, in the old time.\"\r\n\r\nHilda had heard that soft, deep tone in his voice only once before. She\r\nclosed her eyes; her lips and eyelids trembled. \"Only one, Bartley. Only\r\none. And he threw it back at me a second time.\"\r\n\r\nShe felt the strength leap in the arms that held her so lightly.\r\n\r\n\"Try him again, Hilda. Try him once again.\"\r\n\r\nShe looked up into his eyes, and hid her face in her hands.\r\n\r\n\r\n\r\nCHAPTER X\r\n\r\n\r\nOn Tuesday afternoon a Boston lawyer, who had been trying a case in\r\nVermont, was standing on the siding at White River Junction when the\r\nCanadian Express pulled by on its northward journey. As the day-coaches\r\nat the rear end of the long train swept by him, the lawyer noticed at\r\none of the windows a man's head, with thick rumpled hair. \"Curious,\" he\r\nthought; \"that looked like Alexander, but what would he be doing back\r\nthere in the daycoaches?\"\r\n\r\nIt was, indeed, Alexander.\r\n\r\nThat morning a telegram from Moorlock had reached him, telling him that\r\nthere was serious trouble with the bridge and that he was needed there\r\nat once, so he had caught the first train out of New York. He had taken\r\na seat in a day-coach to avoid the risk of meeting any one he knew, and\r\nbecause he did not wish to be comfortable. When the telegram arrived,\r\nAlexander was at his rooms on Tenth Street, packing his bag to go to\r\nBoston. On Monday night he had written a long letter to his wife, but\r\nwhen morning came he was afraid to send it, and the letter was still in\r\nhis pocket. Winifred was not a woman who could bear disappointment. She\r\ndemanded a great deal of herself and of the people she loved; and\r\nshe never failed herself. If he told her now, he knew, it would be\r\nirretrievable. There would be no going back. He would lose the thing\r\nhe valued most in the world; he would be destroying himself and his own\r\nhappiness. There would be nothing for him afterward. He seemed to see\r\nhimself dragging out a restless existence on the Continent--Cannes,\r\nHyeres, Algiers, Cairo--among smartly dressed, disabled men of every\r\nnationality; forever going on journeys that led nowhere; hurrying to\r\ncatch trains that he might just as well miss; getting up in the morning\r\nwith a great bustle and splashing of water, to begin a day that had no\r\npurpose and no meaning; dining late to shorten the night, sleeping late\r\nto shorten the day.\r\n\r\nAnd for what? For a mere folly, a masquerade, a little thing that he\r\ncould not let go. AND HE COULD EVEN LET IT GO, he told himself. But he\r\nhad promised to be in London at mid-summer, and he knew that he would\r\ngo. . . . It was impossible to live like this any longer.\r\n\r\nAnd this, then, was to be the disaster that his old professor had\r\nforeseen for him: the crack in the wall, the crash, the cloud of dust.\r\nAnd he could not understand how it had come about. He felt that he\r\nhimself was unchanged, that he was still there, the same man he had been\r\nfive years ago, and that he was sitting stupidly by and letting some\r\nresolute offshoot of himself spoil his life for him. This new force was\r\nnot he, it was but a part of him. He would not even admit that it was\r\nstronger than he; but it was more active. It was by its energy that this\r\nnew feeling got the better of him. His wife was the woman who had made\r\nhis life, gratified his pride, given direction to his tastes and habits.\r\nThe life they led together seemed to him beautiful. Winifred still was,\r\nas she had always been, Romance for him, and whenever he was deeply\r\nstirred he turned to her. When the grandeur and beauty of the world\r\nchallenged him--as it challenges even the most self-absorbed people--he\r\nalways answered with her name. That was his reply to the question put\r\nby the mountains and the stars; to all the spiritual aspects of life.\r\nIn his feeling for his wife there was all the tenderness, all the pride,\r\nall the devotion of which he was capable. There was everything but\r\nenergy; the energy of youth which must register itself and cut its name\r\nbefore it passes. This new feeling was so fresh, so unsatisfied and\r\nlight of foot. It ran and was not wearied, anticipated him everywhere.\r\nIt put a girdle round the earth while he was going from New York to\r\nMoorlock. At this moment, it was tingling through him, exultant, and\r\nlive as quicksilver, whispering, \"In July you will be in England.\"\r\n\r\nAlready he dreaded the long, empty days at sea, the monotonous Irish\r\ncoast, the sluggish passage up the Mersey, the flash of the boat train\r\nthrough the summer country. He closed his eyes and gave himself up to\r\nthe feeling of rapid motion and to swift, terrifying thoughts. He was\r\nsitting so, his face shaded by his hand, when the Boston lawyer saw him\r\nfrom the siding at White River Junction.\r\n\r\nWhen at last Alexander roused himself, the afternoon had waned to\r\nsunset. The train was passing through a gray country and the sky\r\noverhead was flushed with a wide flood of clear color. There was a\r\nrose-colored light over the gray rocks and hills and meadows. Off to the\r\nleft, under the approach of a weather-stained wooden bridge, a group of\r\nboys were sitting around a little fire. The smell of the wood smoke blew\r\nin at the window. Except for an old farmer, jogging along the highroad\r\nin his box-wagon, there was not another living creature to be seen.\r\nAlexander looked back wistfully at the boys, camped on the edge of a\r\nlittle marsh, crouching under their shelter and looking gravely at their\r\nfire. They took his mind back a long way, to a campfire on a sandbar in\r\na Western river, and he wished he could go back and sit down with them.\r\nHe could remember exactly how the world had looked then.\r\n\r\nIt was quite dark and Alexander was still thinking of the boys, when it\r\noccurred to him that the train must be nearing Allway. In going to his\r\nnew bridge at Moorlock he had always to pass through Allway. The train\r\nstopped at Allway Mills, then wound two miles up the river, and then the\r\nhollow sound under his feet told Bartley that he was on his first bridge\r\nagain. The bridge seemed longer than it had ever seemed before, and he\r\nwas glad when he felt the beat of the wheels on the solid roadbed again.\r\nHe did not like coming and going across that bridge, or remembering the\r\nman who built it. And was he, indeed, the same man who used to walk that\r\nbridge at night, promising such things to himself and to the stars? And\r\nyet, he could remember it all so well: the quiet hills sleeping in the\r\nmoonlight, the slender skeleton of the bridge reaching out into the\r\nriver, and up yonder, alone on the hill, the big white house; upstairs,\r\nin Winifred's window, the light that told him she was still awake and\r\nstill thinking of him. And after the light went out he walked alone,\r\ntaking the heavens into his confidence, unable to tear himself away from\r\nthe white magic of the night, unwilling to sleep because longing was so\r\nsweet to him, and because, for the first time since first the hills were\r\nhung with moonlight, there was a lover in the world. And always there\r\nwas the sound of the rushing water underneath, the sound which, more\r\nthan anything else, meant death; the wearing away of things under the\r\nimpact of physical forces which men could direct but never circumvent or\r\ndiminish. Then, in the exaltation of love, more than ever it seemed to\r\nhim to mean death, the only other thing as strong as love. Under the\r\nmoon, under the cold, splendid stars, there were only those two things\r\nawake and sleepless; death and love, the rushing river and his burning\r\nheart.\r\n\r\nAlexander sat up and looked about him. The train was tearing on through\r\nthe darkness. All his companions in the day-coach were either dozing or\r\nsleeping heavily, and the murky lamps were turned low. How came he here\r\namong all these dirty people? Why was he going to London? What did it\r\nmean--what was the answer? How could this happen to a man who had lived\r\nthrough that magical spring and summer, and who had felt that the stars\r\nthemselves were but flaming particles in the far-away infinitudes of his\r\nlove?\r\n\r\nWhat had he done to lose it? How could he endure the baseness of life\r\nwithout it? And with every revolution of the wheels beneath him, the\r\nunquiet quicksilver in his breast told him that at midsummer he would be\r\nin London. He remembered his last night there: the red foggy darkness,\r\nthe hungry crowds before the theatres, the hand-organs, the feverish\r\nrhythm of the blurred, crowded streets, and the feeling of letting\r\nhimself go with the crowd. He shuddered and looked about him at the poor\r\nunconscious companions of his journey, unkempt and travel-stained, now\r\ndoubled in unlovely attitudes, who had come to stand to him for the\r\nugliness he had brought into the world.\r\n\r\nAnd those boys back there, beginning it all just as he had begun it; he\r\nwished he could promise them better luck. Ah, if one could promise any\r\none better luck, if one could assure a single human being of happiness!\r\nHe had thought he could do so, once; and it was thinking of that that he\r\nat last fell asleep. In his sleep, as if it had nothing fresher to work\r\nupon, his mind went back and tortured itself with something years and\r\nyears away, an old, long-forgotten sorrow of his childhood.\r\n\r\nWhen Alexander awoke in the morning, the sun was just rising through\r\npale golden ripples of cloud, and the fresh yellow light was vibrating\r\nthrough the pine woods. The white birches, with their little unfolding\r\nleaves, gleamed in the lowlands, and the marsh meadows were already\r\ncoming to life with their first green, a thin, bright color which\r\nhad run over them like fire. As the train rushed along the trestles,\r\nthousands of wild birds rose screaming into the light. The sky was\r\nalready a pale blue and of the clearness of crystal. Bartley caught\r\nup his bag and hurried through the Pullman coaches until he found the\r\nconductor. There was a stateroom unoccupied, and he took it and set\r\nabout changing his clothes. Last night he would not have believed that\r\nanything could be so pleasant as the cold water he dashed over his head\r\nand shoulders and the freshness of clean linen on his body.\r\n\r\nAfter he had dressed, Alexander sat down at the window and drew into his\r\nlungs deep breaths of the pine-scented air. He had awakened with all his\r\nold sense of power. He could not believe that things were as bad with\r\nhim as they had seemed last night, that there was no way to set them\r\nentirely right. Even if he went to London at midsummer, what would that\r\nmean except that he was a fool? And he had been a fool before. That was\r\nnot the reality of his life. Yet he knew that he would go to London.\r\n\r\nHalf an hour later the train stopped at Moorlock. Alexander sprang to\r\nthe platform and hurried up the siding, waving to Philip Horton, one\r\nof his assistants, who was anxiously looking up at the windows of the\r\ncoaches. Bartley took his arm and they went together into the station\r\nbuffet.\r\n\r\n\"I'll have my coffee first, Philip. Have you had yours? And now, what\r\nseems to be the matter up here?\"\r\n\r\nThe young man, in a hurried, nervous way, began his explanation.\r\n\r\nBut Alexander cut him short. \"When did you stop work?\" he asked sharply.\r\n\r\nThe young engineer looked confused. \"I haven't stopped work yet,\r\nMr. Alexander. I didn't feel that I could go so far without definite\r\nauthorization from you.\"\r\n\r\n\"Then why didn't you say in your telegram exactly what you thought, and\r\nask for your authorization? You'd have got it quick enough.\"\r\n\r\n\"Well, really, Mr. Alexander, I couldn't be absolutely sure, you know,\r\nand I didn't like to take the responsibility of making it public.\"\r\n\r\nAlexander pushed back his chair and rose. \"Anything I do can be made\r\npublic, Phil. You say that you believe the lower chords are showing\r\nstrain, and that even the workmen have been talking about it, and yet\r\nyou've gone on adding weight.\"\r\n\r\n\"I'm sorry, Mr. Alexander, but I had counted on your getting here\r\nyesterday. My first telegram missed you somehow. I sent one Sunday\r\nevening, to the same address, but it was returned to me.\"\r\n\r\n\"Have you a carriage out there? I must stop to send a wire.\"\r\n\r\nAlexander went up to the telegraph-desk and penciled the following\r\nmessage to his wife:--\r\n\r\nI may have to be here for some time. Can you come up at once? Urgent.\r\n\r\nBARTLEY.\r\n\r\n\r\nThe Moorlock Bridge lay three miles above the town. When they were\r\nseated in the carriage, Alexander began to question his assistant\r\nfurther. If it were true that the compression members showed strain,\r\nwith the bridge only two thirds done, then there was nothing to do\r\nbut pull the whole structure down and begin over again. Horton kept\r\nrepeating that he was sure there could be nothing wrong with the\r\nestimates.\r\n\r\nAlexander grew impatient. \"That's all true, Phil, but we never were\r\njustified in assuming that a scale that was perfectly safe for an\r\nordinary bridge would work with anything of such length. It's all very\r\nwell on paper, but it remains to be seen whether it can be done in\r\npractice. I should have thrown up the job when they crowded me. It's\r\nall nonsense to try to do what other engineers are doing when you know\r\nthey're not sound.\"\r\n\r\n\"But just now, when there is such competition,\" the younger man\r\ndemurred. \"And certainly that's the new line of development.\"\r\n\r\nAlexander shrugged his shoulders and made no reply.\r\n\r\nWhen they reached the bridge works, Alexander began his examination\r\nimmediately. An hour later he sent for the superintendent. \"I think you\r\nhad better stop work out there at once, Dan. I should say that the lower\r\nchord here might buckle at any moment. I told the Commission that we\r\nwere using higher unit stresses than any practice has established, and\r\nwe've put the dead load at a low estimate. Theoretically it worked out\r\nwell enough, but it had never actually been tried.\" Alexander put on\r\nhis overcoat and took the superintendent by the arm. \"Don't look so\r\nchopfallen, Dan. It's a jolt, but we've got to face it. It isn't the end\r\nof the world, you know. Now we'll go out and call the men off quietly.\r\nThey're already nervous, Horton tells me, and there's no use alarming\r\nthem. I'll go with you, and we'll send the end riveters in first.\"\r\n\r\nAlexander and the superintendent picked their way out slowly over the\r\nlong span. They went deliberately, stopping to see what each gang was\r\ndoing, as if they were on an ordinary round of inspection. When\r\nthey reached the end of the river span, Alexander nodded to the\r\nsuperintendent, who quietly gave an order to the foreman. The men in the\r\nend gang picked up their tools and, glancing curiously at each other,\r\nstarted back across the bridge toward the river-bank. Alexander himself\r\nremained standing where they had been working, looking about him. It was\r\nhard to believe, as he looked back over it, that the whole great span\r\nwas incurably disabled, was already as good as condemned, because\r\nsomething was out of line in the lower chord of the cantilever arm.\r\n\r\nThe end riveters had reached the bank and were dispersing among the\r\ntool-houses, and the second gang had picked up their tools and were\r\nstarting toward the shore. Alexander, still standing at the end of the\r\nriver span, saw the lower chord of the cantilever arm give a little,\r\nlike an elbow bending. He shouted and ran after the second gang, but by\r\nthis time every one knew that the big river span was slowly settling.\r\nThere was a burst of shouting that was immediately drowned by the scream\r\nand cracking of tearing iron, as all the tension work began to pull\r\nasunder. Once the chords began to buckle, there were thousands of tons\r\nof ironwork, all riveted together and lying in midair without support.\r\nIt tore itself to pieces with roaring and grinding and noises that were\r\nlike the shrieks of a steam whistle. There was no shock of any kind; the\r\nbridge had no impetus except from its own weight. It lurched neither\r\nto right nor left, but sank almost in a vertical line, snapping and\r\nbreaking and tearing as it went, because no integral part could bear for\r\nan instant the enormous strain loosed upon it. Some of the men jumped\r\nand some ran, trying to make the shore.\r\n\r\nAt the first shriek of the tearing iron, Alexander jumped from the\r\ndownstream side of the bridge. He struck the water without injury and\r\ndisappeared. He was under the river a long time and had great difficulty\r\nin holding his breath. When it seemed impossible, and his chest was\r\nabout to heave, he thought he heard his wife telling him that he could\r\nhold out a little longer. An instant later his face cleared the water.\r\nFor a moment, in the depths of the river, he had realized what it would\r\nmean to die a hypocrite, and to lie dead under the last abandonment of\r\nher tenderness. But once in the light and air, he knew he should live to\r\ntell her and to recover all he had lost. Now, at last, he felt sure of\r\nhimself. He was not startled. It seemed to him that he had been through\r\nsomething of this sort before. There was nothing horrible about it.\r\nThis, too, was life, and life was activity, just as it was in Boston\r\nor in London. He was himself, and there was something to be done;\r\neverything seemed perfectly natural. Alexander was a strong swimmer, but\r\nhe had gone scarcely a dozen strokes when the bridge itself, which had\r\nbeen settling faster and faster, crashed into the water behind him.\r\nImmediately the river was full of drowning men. A gang of French\r\nCanadians fell almost on top of him. He thought he had cleared them,\r\nwhen they began coming up all around him, clutching at him and at each\r\nother. Some of them could swim, but they were either hurt or crazed with\r\nfright. Alexander tried to beat them off, but there were too many of\r\nthem. One caught him about the neck, another gripped him about the\r\nmiddle, and they went down together. When he sank, his wife seemed to be\r\nthere in the water beside him, telling him to keep his head, that if he\r\ncould hold out the men would drown and release him. There was something\r\nhe wanted to tell his wife, but he could not think clearly for the\r\nroaring in his ears. Suddenly he remembered what it was. He caught his\r\nbreath, and then she let him go.\r\n\r\n\r\nThe work of recovering the dead went on all day and all the following\r\nnight. By the next morning forty-eight bodies had been taken out of the\r\nriver, but there were still twenty missing. Many of the men had fallen\r\nwith the bridge and were held down under the debris. Early on the\r\nmorning of the second day a closed carriage was driven slowly along the\r\nriver-bank and stopped a little below the works, where the river boiled\r\nand churned about the great iron carcass which lay in a straight line\r\ntwo thirds across it. The carriage stood there hour after hour, and word\r\nsoon spread among the crowds on the shore that its occupant was the wife\r\nof the Chief Engineer; his body had not yet been found. The widows of\r\nthe lost workmen, moving up and down the bank with shawls over their\r\nheads, some of them carrying babies, looked at the rusty hired hack many\r\ntimes that morning. They drew near it and walked about it, but none of\r\nthem ventured to peer within. Even half-indifferent sightseers dropped\r\ntheir voices as they told a newcomer: \"You see that carriage over there?\r\nThat's Mrs. Alexander. They haven't found him yet. She got off the train\r\nthis morning. Horton met her. She heard it in Boston yesterday--heard\r\nthe newsboys crying it in the street.\"\r\n\r\nAt noon Philip Horton made his way through the crowd with a tray and a\r\ntin coffee-pot from the camp kitchen. When he reached the carriage\r\nhe found Mrs. Alexander just as he had left her in the early morning,\r\nleaning forward a little, with her hand on the lowered window, looking\r\nat the river. Hour after hour she had been watching the water, the\r\nlonely, useless stone towers, and the convulsed mass of iron wreckage\r\nover which the angry river continually spat up its yellow foam.\r\n\r\n\"Those poor women out there, do they blame him very much?\" she asked, as\r\nshe handed the coffee-cup back to Horton.\r\n\r\n\"Nobody blames him, Mrs. Alexander. If any one is to blame, I'm afraid\r\nit's I. I should have stopped work before he came. He said so as soon as\r\nI met him. I tried to get him here a day earlier, but my telegram missed\r\nhim, somehow. He didn't have time really to explain to me. If he'd got\r\nhere Monday, he'd have had all the men off at once. But, you see, Mrs.\r\nAlexander, such a thing never happened before. According to all human\r\ncalculations, it simply couldn't happen.\"\r\n\r\nHorton leaned wearily against the front wheel of the cab. He had not had\r\nhis clothes off for thirty hours, and the stimulus of violent excitement\r\nwas beginning to wear off.\r\n\r\n\"Don't be afraid to tell me the worst, Mr. Horton. Don't leave me to the\r\ndread of finding out things that people may be saying. If he is blamed,\r\nif he needs any one to speak for him,\"--for the first time her voice\r\nbroke and a flush of life, tearful, painful, and confused, swept over\r\nher rigid pallor,--\"if he needs any one, tell me, show me what to do.\"\r\nShe began to sob, and Horton hurried away.\r\n\r\nWhen he came back at four o'clock in the afternoon he was carrying his\r\nhat in his hand, and Winifred knew as soon as she saw him that they had\r\nfound Bartley. She opened the carriage door before he reached her and\r\nstepped to the ground.\r\n\r\nHorton put out his hand as if to hold her back and spoke pleadingly:\r\n\"Won't you drive up to my house, Mrs. Alexander? They will take him up\r\nthere.\"\r\n\r\n\"Take me to him now, please. I shall not make any trouble.\"\r\n\r\nThe group of men down under the riverbank fell back when they saw a\r\nwoman coming, and one of them threw a tarpaulin over the stretcher. They\r\ntook off their hats and caps as Winifred approached, and although she\r\nhad pulled her veil down over her face they did not look up at her. She\r\nwas taller than Horton, and some of the men thought she was the tallest\r\nwoman they had ever seen. \"As tall as himself,\" some one whispered.\r\nHorton motioned to the men, and six of them lifted the stretcher\r\nand began to carry it up the embankment. Winifred followed them the\r\nhalf-mile to Horton's house. She walked quietly, without once breaking\r\nor stumbling. When the bearers put the stretcher down in Horton's spare\r\nbedroom, she thanked them and gave her hand to each in turn. The men\r\nwent out of the house and through the yard with their caps in their\r\nhands. They were too much confused to say anything as they went down the\r\nhill.\r\n\r\nHorton himself was almost as deeply perplexed. \"Mamie,\" he said to his\r\nwife, when he came out of the spare room half an hour later, \"will you\r\ntake Mrs. Alexander the things she needs? She is going to do everything\r\nherself. Just stay about where you can hear her and go in if she wants\r\nyou.\"\r\n\r\nEverything happened as Alexander had foreseen in that moment of\r\nprescience under the river. With her own hands she washed him clean of\r\nevery mark of disaster. All night he was alone with her in the still\r\nhouse, his great head lying deep in the pillow. In the pocket of his\r\ncoat Winifred found the letter that he had written her the night before\r\nhe left New York, water-soaked and illegible, but because of its length,\r\nshe knew it had been meant for her.\r\n\r\nFor Alexander death was an easy creditor. Fortune, which had smiled\r\nupon him consistently all his life, did not desert him in the end.\r\nHis harshest critics did not doubt that, had he lived, he would have\r\nretrieved himself. Even Lucius Wilson did not see in this accident the\r\ndisaster he had once foretold.\r\n\r\nWhen a great man dies in his prime there is no surgeon who can say\r\nwhether he did well; whether or not the future was his, as it seemed to\r\nbe. The mind that society had come to regard as a powerful and reliable\r\nmachine, dedicated to its service, may for a long time have been sick\r\nwithin itself and bent upon its own destruction.\r\n\r\n\r\n\r\nEPILOGUE\r\n\r\n\r\nProfessor Wilson had been living in London for six years and he was just\r\nback from a visit to America. One afternoon, soon after his return, he\r\nput on his frock-coat and drove in a hansom to pay a call upon Hilda\r\nBurgoyne, who still lived at her old number, off Bedford Square. He\r\nand Miss Burgoyne had been fast friends for a long time. He had first\r\nnoticed her about the corridors of the British Museum, where he read\r\nconstantly. Her being there so often had made him feel that he would\r\nlike to know her, and as she was not an inaccessible person, an\r\nintroduction was not difficult. The preliminaries once over, they came\r\nto depend a great deal upon each other, and Wilson, after his day's\r\nreading, often went round to Bedford Square for his tea. They had much\r\nmore in common than their memories of a common friend. Indeed, they\r\nseldom spoke of him. They saved that for the deep moments which do not\r\ncome often, and then their talk of him was mostly silence. Wilson knew\r\nthat Hilda had loved him; more than this he had not tried to know.\r\n\r\nIt was late when Wilson reached Hilda's apartment on this particular\r\nDecember afternoon, and he found her alone. She sent for fresh tea\r\nand made him comfortable, as she had such a knack of making people\r\ncomfortable.\r\n\r\n\"How good you were to come back before Christmas! I quite dreaded the\r\nHolidays without you. You've helped me over a good many Christmases.\"\r\nShe smiled at him gayly.\r\n\r\n\"As if you needed me for that! But, at any rate, I needed YOU. How well\r\nyou are looking, my dear, and how rested.\"\r\n\r\nHe peered up at her from his low chair, balancing the tips of his long\r\nfingers together in a judicial manner which had grown on him with years.\r\n\r\nHilda laughed as she carefully poured his cream. \"That means that I was\r\nlooking very seedy at the end of the season, doesn't it? Well, we must\r\nshow wear at last, you know.\"\r\n\r\nWilson took the cup gratefully. \"Ah, no need to remind a man of\r\nseventy, who has just been home to find that he has survived all his\r\ncontemporaries. I was most gently treated--as a sort of precious relic.\r\nBut, do you know, it made me feel awkward to be hanging about still.\"\r\n\r\n\"Seventy? Never mention it to me.\" Hilda looked appreciatively at the\r\nProfessor's alert face, with so many kindly lines about the mouth and\r\nso many quizzical ones about the eyes. \"You've got to hang about for\r\nme, you know. I can't even let you go home again. You must stay put, now\r\nthat I have you back. You're the realest thing I have.\"\r\n\r\nWilson chuckled. \"Dear me, am I? Out of so many conquests and the spoils\r\nof conquered cities! You've really missed me? Well, then, I shall hang.\r\nEven if you have at last to put ME in the mummy-room with the others.\r\nYou'll visit me often, won't you?\"\r\n\r\n\"Every day in the calendar. Here, your cigarettes are in this drawer,\r\nwhere you left them.\" She struck a match and lit one for him. \"But you\r\ndid, after all, enjoy being at home again?\"\r\n\r\n\"Oh, yes. I found the long railway journeys trying. People live a\r\nthousand miles apart. But I did it thoroughly; I was all over the place.\r\nIt was in Boston I lingered longest.\"\r\n\r\n\"Ah, you saw Mrs. Alexander?\"\r\n\r\n\"Often. I dined with her, and had tea there a dozen different times,\r\nI should think. Indeed, it was to see her that I lingered on and on.\r\nI found that I still loved to go to the house. It always seemed as if\r\nBartley were there, somehow, and that at any moment one might hear his\r\nheavy tramp on the stairs. Do you know, I kept feeling that he must be\r\nup in his study.\" The Professor looked reflectively into the grate. \"I\r\nshould really have liked to go up there. That was where I had my last\r\nlong talk with him. But Mrs. Alexander never suggested it.\"\r\n\r\n\"Why?\"\r\n\r\nWilson was a little startled by her tone, and he turned his head so\r\nquickly that his cuff-link caught the string of his nose-glasses and\r\npulled them awry. \"Why? Why, dear me, I don't know. She probably never\r\nthought of it.\"\r\n\r\nHilda bit her lip. \"I don't know what made me say that. I didn't mean to\r\ninterrupt. Go on please, and tell me how it was.\"\r\n\r\n\"Well, it was like that. Almost as if he were there. In a way, he really\r\nis there. She never lets him go. It's the most beautiful and dignified\r\nsorrow I've ever known. It's so beautiful that it has its compensations,\r\nI should think. Its very completeness is a compensation. It gives her\r\na fixed star to steer by. She doesn't drift. We sat there evening after\r\nevening in the quiet of that magically haunted room, and watched the\r\nsunset burn on the river, and felt him. Felt him with a difference, of\r\ncourse.\"\r\n\r\nHilda leaned forward, her elbow on her knee, her chin on her hand. \"With\r\na difference? Because of her, you mean?\"\r\n\r\nWilson's brow wrinkled. \"Something like that, yes. Of course, as\r\ntime goes on, to her he becomes more and more their simple personal\r\nrelation.\"\r\n\r\nHilda studied the droop of the Professor's head intently. \"You didn't\r\naltogether like that? You felt it wasn't wholly fair to him?\"\r\n\r\nWilson shook himself and readjusted his glasses. \"Oh, fair enough. More\r\nthan fair. Of course, I always felt that my image of him was just a\r\nlittle different from hers. No relation is so complete that it can\r\nhold absolutely all of a person. And I liked him just as he was; his\r\ndeviations, too; the places where he didn't square.\"\r\n\r\nHilda considered vaguely. \"Has she grown much older?\" she asked at last.\r\n\r\n\"Yes, and no. In a tragic way she is even handsomer. But colder. Cold\r\nfor everything but him. `Forget thyself to marble'; I kept thinking of\r\nthat. Her happiness was a happiness a deux, not apart from the world,\r\nbut actually against it. And now her grief is like that. She saves\r\nherself for it and doesn't even go through the form of seeing people\r\nmuch. I'm sorry. It would be better for her, and might be so good for\r\nthem, if she could let other people in.\"\r\n\r\n\"Perhaps she's afraid of letting him out a little, of sharing him with\r\nsomebody.\"\r\n\r\nWilson put down his cup and looked up with vague alarm. \"Dear me, it\r\ntakes a woman to think of that, now! I don't, you know, think we ought\r\nto be hard on her. More, even, than the rest of us she didn't choose her\r\ndestiny. She underwent it. And it has left her chilled. As to her not\r\nwishing to take the world into her confidence--well, it is a pretty\r\nbrutal and stupid world, after all, you know.\"\r\n\r\nHilda leaned forward. \"Yes, I know, I know. Only I can't help being glad\r\nthat there was something for him even in stupid and vulgar people. My\r\nlittle Marie worshiped him. When she is dusting I always know when she\r\nhas come to his picture.\"\r\n\r\nWilson nodded. \"Oh, yes! He left an echo. The ripples go on in all of\r\nus. He belonged to the people who make the play, and most of us are only\r\nonlookers at the best. We shouldn't wonder too much at Mrs. Alexander.\r\nShe must feel how useless it would be to stir about, that she may as\r\nwell sit still; that nothing can happen to her after Bartley.\"\r\n\r\n\"Yes,\" said Hilda softly, \"nothing can happen to one after Bartley.\"\r\n\r\nThey both sat looking into the fire.\r\n\r\n\r\n\r\n                       *****\r\n\r\n\r\n\r\n\r\n\r\nTHE BARREL ORGAN  by  Alfred Noyes\r\n\r\n\r\n\r\n  There's a barrel-organ caroling across a golden street,\r\n    In the City as the sun sinks low;\r\n  And the music's not immortal; but the world has made it sweet\r\n    And fulfilled it with the sunset glow;\r\n  And it pulses through the pleasures of the City and the pain\r\n    That surround the singing organ like a large eternal light;\r\n  And they've given it a glory and a part to play again\r\n    In the Symphony that rules the day and the night.\r\n\r\n  And now it's marching onward through the realms of old romance,\r\n    And trolling out a fond familiar tune,\r\n  And now it's roaring cannon down to fight the King of France,\r\n    And now it's prattling softly to the moon,\r\n  And all around the organ there's a sea without a shore\r\n    Of human joys and wonders and regrets;\r\n  To remember and to recompense the music evermore\r\n    For what the cold machinery forgets. . . .\r\n\r\n  Yes; as the music changes,\r\n    Like a prismatic glass,\r\n  It takes the light and ranges\r\n    Through all the moods that pass;\r\n  Dissects the common carnival\r\n    Of passions and regrets,\r\n  And gives the world a glimpse of all\r\n    The colors it forgets.\r\n\r\n  And there LA TRAVIATA sights\r\n    Another sadder song;\r\n  And there IL TROVATORE cries\r\n    A tale of deeper wrong;\r\n  And bolder knights to battle go\r\n    With sword and shield and lance,\r\n  Than ever here on earth below\r\n    Have whirled into--A DANCE!--\r\n\r\n  Go down to Kew in lilac time; in lilac time; in lilac time;\r\n  Go down to Kew in lilac time; (it isn't far from London!)\r\n  And you shall wander hand in hand with love in summer's wonderland;\r\n  Go down to Kew in lilac time; (it isn't far from London!)\r\n\r\n  The cherry-trees are seas of bloom and soft perfume and sweet perfume,\r\n  The cherry-trees are seas of bloom (and oh, so near to London!)\r\n  And there they say, when dawn is high and all the world's a blaze of sky\r\n  The cuckoo, though he's very shy, will sing a song for London.\r\n\r\n  The nightingale is rather rare and yet they say you'll hear him there\r\n  At Kew, at Kew in lilac time (and oh, so near to London!)\r\n  The linnet and the throstle, too, and after dark the long halloo\r\n  And golden-eyed TU-WHIT, TU WHOO of owls that ogle London.\r\n\r\n  For Noah hardly knew a bird of any kind that isn't heard\r\n  At Kew, at Kew in lilac time (and oh, so near to London!)\r\n  And when the rose begins to pout and all the chestnut spires are out\r\n  You'll hear the rest without a doubt, all chorusing for London:--\r\n\r\n  COME DOWN TO KEW IN LILAC TIME; IN LILAC TIME; IN LILAC TIME;\r\n  COME DOWN TO KEW IN LILAC TIME; (IT ISN'T FAR FROM LONDON!)\r\n  AND YOU SHALL WANDER HAND IN HAND WITH LOVE IN SUMMER'S WONDERLAND;\r\n  COME DOWN TO KEW IN LILAC TIME; (IT ISN'T FAR FROM LONDON!)\r\n\r\n  And then the troubadour begins to thrill the golden street,\r\n    In the City as the sun sinks low;\r\n  And in all the gaudy busses there are scores of weary feet\r\n  Marking time, sweet time, with a dull mechanic beat,\r\n  And a thousand hearts are plunging to a love they'll never meet,\r\n  Through the meadows of the sunset, through the poppies and the wheat,\r\n    In the land where the dead dreams go.\r\n\r\n  Verdi, Verdi, when you wrote IL TROVATORE did you dream\r\n    Of the City when the sun sinks low\r\n  Of the organ and the monkey and the many-colored stream\r\n  On the Piccadilly pavement, of the myriad eyes that seem\r\n  To be litten for a moment with a wild Italian gleam\r\n  As A CHE LA MORTE parodies the world's eternal theme\r\n    And pulses with the sunset glow?\r\n\r\n  There's a thief, perhaps, that listens with a face of frozen stone\r\n    In the City as the sun sinks low;\r\n  There's a portly man of business with a balance of his own,\r\n  There's a clerk and there's a butcher of a soft reposeful tone,\r\n  And they're all them returning to the heavens they have known:\r\n  They are crammed and jammed in busses and--they're each of them alone\r\n    In the land where the dead dreams go.\r\n\r\n  There's a very modish woman and her smile is very bland\r\n    In the City as the sun sinks low;\r\n  And her hansom jingles onward, but her little jeweled hand\r\n  Is clenched a little tighter and she cannot understand\r\n  What she wants or why she wanders to that undiscovered land,\r\n  For the parties there are not at all the sort of thing she planned,\r\n    In the land where the dead dreams go.\r\n\r\n  There's an Oxford man that listens and his heart is crying out\r\n    In the City as the sun sinks low;\r\n  For the barge the eight, the Isis, and the coach's whoop and shout,\r\n  For the minute gun, the counting and the long disheveled rout,\r\n  For the howl along the tow-path and a fate that's still in doubt,\r\n  For a roughened oar to handle and a race to think about\r\n    In the land where the dead dreams go.\r\n\r\n  There's a laborer that listen to the voices of the dead\r\n    In the City as the sun sinks low;\r\n  And his hand begins to tremble and his face is rather red\r\n  As he sees a loafer watching him and--there he turns his head\r\n  And stares into the sunset where his April love is fled,\r\n  For he hears her softly singing and his lonely soul is led\r\n    Through the land where the dead dreams go.\r\n\r\n  There's and old and hardened demi-rep, it's ringing in her ears,\r\n    In the City as the sun sinks low;\r\n  With the wild and empty sorrow of the love that blights and sears,\r\n  Oh, and if she hurries onward, then be sure, be sure she hears,\r\n  Hears and bears the bitter burden of the unforgotten years,\r\n  And her laugh's a little harsher and her eyes are brimmed with tears\r\n    For the land where the dead dreams go.\r\n\r\n  There's a barrel-organ caroling across a golden street,\r\n    In the City as the sun sinks low;\r\n  Though the music's only Verdi there's a world to make it sweet\r\n  Just as yonder yellow sunset where the earth and heaven meet\r\n  Mellows all the sooty City!  Hark, a hundred thousand feet\r\n  Are marching on to glory through the poppies and the wheat\r\n    In the land where the dead dreams go.\r\n\r\n            So it's Jeremiah, Jeremiah,\r\n              What have you to say\r\n            When you meet the garland girls\r\n              Tripping on their way?\r\n\r\n            All around my gala hat\r\n              I wear a wreath of roses\r\n            (A long and lonely year it is\r\n              I've waited for the May!)\r\n\r\n            If any one should ask you,\r\n              The reason why I wear it is,\r\n            My own love, my true love, is coming home to-day.\r\n\r\n  It's buy a bunch of violets for the lady\r\n    (IT'S LILAC TIME IN LONDON; IT'S LILAC TIME IN LONDON!)\r\n  Buy a bunch of violets for the lady;\r\n    While the sky burns blue above:\r\n\r\n  On the other side of the street you'll find it shady\r\n    (IT'S LILAC TIME IN LONDON; IT'S LILAC TIME IN LONDON!)\r\n  But buy a bunch of violets for the lady;\r\n    And tell her she's your own true love.\r\n\r\n  There's a barrel-organ caroling across a golden street,\r\n    In the City as the sun sinks glittering and slow;\r\n  And the music's not immortal, but the world has made it sweet\r\n  And enriched it with the harmonies that make a song complete\r\n  In the deeper heavens of music where the night and morning meet,\r\n    As it dies into the sunset glow;\r\n\r\n  And it pulses through the pleasures of the City and the pain\r\n    That surround the singing organ like a large eternal light,\r\n  And they've given it a glory and a part of play again\r\n    In the Symphony that rules the day and night.\r\n\r\n            And there, as the music changes,\r\n              The song runs round again;\r\n            Once more it turns and ranges\r\n              Through all its joy and pain:\r\n            Dissects the common carnival\r\n              Of passions and regrets;\r\n            And the wheeling world remembers all\r\n              The wheeling song forgets.\r\n\r\n            Once more La TRAVIATA sighs\r\n              Another sadder song:\r\n            Once more IL TROVATORE cries\r\n              A tale of deeper wrong;\r\n            Once more the knights to battle go\r\n              With sword and shield and lance,\r\n            Till once, once more, the shattered foe\r\n              Has whirled into--A DANCE--\r\n\r\n  Come down to Kew in lilac time; in lilac time; in lilac time;\r\n  Come down to Kew in lilac time; (it isn't far from London!)\r\n  And you shall wander hand in hand with Love in summer's wonderland;\r\n  Come down to Kew in lilac time; (it isn't far from London!)\r\n\r\n  COME DOWN TO KEW IN LILAC TIME; IN LILAC TIME; IN LILAC TIME;\r\n  COME DOWN TO KEW IN LILAC TIME; (IT ISN'T FAR FROM LONDON!)\r\n  AND YOU SHALL WANDER HAND IN HAND WITH LOVE IN SUMMER'S WONDERLAND;\r\n  COME DOWN TO KEW IN LILAC TIME; (IT ISN'T FAR FROM LONDON!)\r\n\r\n\r\n\r\n\r\n\r\nEnd of the Project Gutenberg EBook of Alexander's Bridge and The Barrel Organ, by \r\nWilla Cather and Alfred Noyes\r\n",
    "textIndexes": {
        "header": 18,
        "footer": 3067
    },
    "buildPath": "./json//pg94.json",
    "wordcount": 29518
}