{
    "id": "99",
    "formats": [
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "99.kindle.images",
            "filePath": "http://www.gutenberg.org/ebooks/99.kindle.images",
            "extension": "images"
        },
        {
            "format": "application/x-mobipocket-ebook",
            "fileName": "99.kindle.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/99.kindle.noimages",
            "extension": "noimages"
        },
        {
            "format": "text/plain",
            "fileName": "99.txt.utf-8",
            "filePath": "http://www.gutenberg.org/ebooks/99.txt.utf-8",
            "extension": "utf-8"
        },
        {
            "format": "text/html; charset=iso-8859-1",
            "fileName": "99/99-h.zip",
            "filePath": "http://www.gutenberg.org/files/99/99-h.zip",
            "extension": "zip"
        },
        {
            "format": "text/plain; charset=us-ascii",
            "fileName": "99/99.txt",
            "filePath": "http://www.gutenberg.org/files/99/99.txt",
            "extension": "txt"
        },
        {
            "format": "application/zip",
            "fileName": "99/99.zip",
            "filePath": "http://www.gutenberg.org/files/99/99.zip",
            "extension": "zip"
        },
        {
            "format": "application/epub+zip",
            "fileName": "99.epub.noimages",
            "filePath": "http://www.gutenberg.org/ebooks/99.epub.noimages",
            "extension": "noimages"
        },
        {
            "format": "application/epub+zip",
            "fileName": "99.epub.images",
            "filePath": "http://www.gutenberg.org/ebooks/99.epub.images",
            "extension": "images"
        },
        {
            "format": "application/rdf+xml",
            "fileName": "99.rdf",
            "filePath": "http://www.gutenberg.org/ebooks/99.rdf",
            "extension": "rdf"
        },
        {
            "format": "text/html; charset=iso-8859-1",
            "fileName": "99/99-h/99-h.htm",
            "filePath": "http://www.gutenberg.org/files/99/99-h/99-h.htm",
            "extension": "htm"
        }
    ],
    "languages": [
        "en"
    ],
    "title": [
        "Collected Articles of Frederick Douglass"
    ],
    "author": "Douglass, Frederick",
    "issued": "1994-01-01",
    "text": "*** START OF THIS PROJECT GUTENBERG EBOOK ARTICLES OF FREDERICK DOUGLASS ***\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nHere are several articles by Frederick Douglass, whose larger work was\r\npresented in book form as a January, 1993 Project Gutenberg Etext to\r\ncommemorate Martin Luther King Jr. Day last year.  We hope people will\r\ncontinue to contribute works such as this to commemorate this and other\r\nholidays.\r\n\r\n\r\n\r\n\r\n  MY ESCAPE FROM SLAVERY\r\n  RECONSTRUCTION\r\n\r\n\r\n\r\n\r\nDouglass, Frederick.  \"My Escape from Slavery.\"\r\n\r\nThe Century Illustrated Magazine 23, n.s. 1 (Nov. 1881): 125-131.\r\n\r\n\r\n\r\nMY ESCAPE FROM SLAVERY\r\n\r\n\r\nIn the first narrative of my experience in slavery, written nearly forty\r\nyears ago, and in various writings since, I have given the public what I\r\nconsidered very good reasons for withholding the manner of my escape.  In\r\nsubstance these reasons were, first, that such publication at any time\r\nduring the existence of slavery might be used by the master against the\r\nslave, and prevent the future escape of any who might adopt the same\r\nmeans that I did.  The second reason was, if possible, still more binding\r\nto silence: the publication of details would certainly have put in peril\r\nthe persons and property of those who assisted.  Murder itself was not\r\nmore sternly and certainly punished in the State of Maryland than that of\r\naiding and abetting the escape of a slave.  Many colored men, for no\r\nother crime than that of giving aid to a fugitive slave, have, like\r\nCharles T. Torrey, perished in prison.  The abolition of slavery in my\r\nnative State and throughout the country, and the lapse of time, render\r\nthe caution hitherto observed no longer necessary.  But even since the\r\nabolition of slavery, I have sometimes thought it well enough to baffle\r\ncuriosity by saying that while slavery existed there were good reasons\r\nfor not telling the manner of my escape, and since slavery had ceased to\r\nexist, there was no reason for telling it.  I shall now, however, cease\r\nto avail myself of this formula, and, as far as I can, endeavor to\r\nsatisfy this very natural curiosity.  I should, perhaps, have yielded to\r\nthat feeling sooner, had there been anything very heroic or thrilling in\r\nthe incidents connected with my escape, for I am sorry to say I have\r\nnothing of that sort to tell; and yet the courage that could risk\r\nbetrayal and the bravery which was ready to encounter death, if need be,\r\nin pursuit of freedom, were essential features in the undertaking.  My\r\nsuccess was due to address rather than courage, to good luck rather than\r\nbravery.  My means of escape were provided for me by the very men who\r\nwere making laws to hold and bind me more securely in slavery.\r\n\r\nIt was the custom in the State of Maryland to require the free colored\r\npeople to have what were called free papers.  These instruments they were\r\nrequired to renew very often, and by charging a fee for this writing,\r\nconsiderable sums from time to time were collected by the State.  In\r\nthese papers the name, age, color, height, and form of the freeman were\r\ndescribed, together with any scars or other marks upon his person which\r\ncould assist in his identification.  This device in some measure defeated\r\nitself--since more than one man could be found to answer the same general\r\ndescription.  Hence many slaves could escape by personating the owner of\r\none set of papers; and this was often done as follows:  A slave, nearly\r\nor sufficiently answering the description set forth in the papers, would\r\nborrow or hire them till by means of them he could escape to a free\r\nState, and then, by mail or otherwise, would return them to the owner.\r\nThe operation was a hazardous one for the lender as well as for the\r\nborrower.  A failure on the part of the fugitive to send back the papers\r\nwould imperil his benefactor, and the discovery of the papers in\r\npossession of the wrong man would imperil both the fugitive and his\r\nfriend.  It was, therefore, an act of supreme trust on the part of a\r\nfreeman of color thus to put in jeopardy his own liberty that another\r\nmight be free.  It was, however, not unfrequently bravely done, and was\r\nseldom discovered.  I was not so fortunate as to resemble any of my free\r\nacquaintances sufficiently to answer the description of their papers.\r\nBut I had a friend--a sailor--who owned a sailor's protection, which\r\nanswered somewhat the purpose of free papers--describing his person, and\r\ncertifying to the fact that he was a free American sailor.  The\r\ninstrument had at its head the American eagle, which gave it the\r\nappearance at once of an authorized document.  This protection, when in\r\nmy hands, did not describe its bearer very accurately.  Indeed, it called\r\nfor a man much darker than myself, and close examination of it would have\r\ncaused my arrest at the start.\r\n\r\nIn order to avoid this fatal scrutiny on the part of railroad officials,\r\nI arranged with Isaac Rolls, a Baltimore hackman, to bring my baggage to\r\nthe Philadelphia train just on the moment of starting, and jumped upon\r\nthe car myself when the train was in motion.  Had I gone into the station\r\nand offered to purchase a ticket, I should have been instantly and\r\ncarefully examined, and undoubtedly arrested.  In choosing this plan I\r\nconsidered the jostle of the train, and the natural haste of the\r\nconductor, in a train crowded with passengers, and relied upon my skill\r\nand address in playing the sailor, as described in my protection, to do\r\nthe rest.  One element in my favor was the kind feeling which prevailed\r\nin Baltimore and other sea-ports at the time, toward \"those who go down\r\nto the sea in ships.\"  \"Free trade and sailors' rights\" just then\r\nexpressed the sentiment of the country.  In my clothing I was rigged out\r\nin sailor style.  I had on a red shirt and a tarpaulin hat, and a black\r\ncravat tied in sailor fashion carelessly and loosely about my neck.  My\r\nknowledge of ships and sailor's talk came much to my assistance, for I\r\nknew a ship from stem to stern, and from keelson to cross-trees, and\r\ncould talk sailor like an \"old salt.\" I was well on the way to Havre de\r\nGrace before the conductor came into the negro car to collect tickets and\r\nexamine the papers of his black passengers.  This was a critical moment\r\nin the drama.  My whole future depended upon the decision of this\r\nconductor.  Agitated though I was while this ceremony was proceeding,\r\nstill, externally, at least, I was apparently calm and self-possessed.\r\nHe went on with his duty--examining several colored passengers before\r\nreaching me. He was somewhat harsh in tome and peremptory in manner until\r\nhe reached me, when, strange enough, and to my surprise and relief, his\r\nwhole manner changed.  Seeing that I did not readily produce my free\r\npapers, as the other colored persons in the car had done, he said to me,\r\nin friendly contrast with his bearing toward the others:\r\n\r\n\"I suppose you have your free papers?\"\r\n\r\nTo which I answered:\r\n\r\n\"No sir; I never carry my free papers to sea with me.\"\r\n\r\n\"But you have something to show that you are a freeman, haven't you?\"\r\n\r\n\"Yes, sir,\" I answered; \"I have a paper with the American Eagle on it,\r\nand that will carry me around the world.\"\r\n\r\nWith this I drew from my deep sailor's pocket my seaman's protection, as\r\nbefore described.  The merest glance at the paper satisfied him, and he\r\ntook my fare and went on about his business.  This moment of time was one\r\nof the most anxious I ever experienced.  Had the conductor looked closely\r\nat the paper, he could not have failed to discover that it called for a\r\nvery different-looking person from myself, and in that case it would have\r\nbeen his duty to arrest me on the instant, and send me back to Baltimore\r\nfrom the first station.  When he left me with the assurance that I was\r\nall right, though much relieved, I realized that I was still in great\r\ndanger: I was still in Maryland, and subject to arrest at any moment.  I\r\nsaw on the train several persons who would have known me in any other\r\nclothes, and I feared they might recognize me, even in my sailor \"rig,\"\r\nand report me to the conductor, who would then subject me to a closer\r\nexamination, which I knew well would be fatal to me.\r\n\r\nThough I was not a murderer fleeing from justice, I felt perhaps quite as\r\nmiserable as such a criminal.  The train was moving at a very high rate\r\nof speed for that epoch of railroad travel, but to my anxious mind it was\r\nmoving far too slowly.  Minutes were hours, and hours were days during\r\nthis part of my flight.  After Maryland, I was to pass through\r\nDelaware--another slave State, where slave-catchers generally awaited\r\ntheir prey, for it was not in the interior of the State, but on its\r\nborders, that these human hounds were most vigilant and active.  The\r\nborder lines between slavery and freedom were the dangerous ones for the\r\nfugitives.  The heart of no fox or deer, with hungry hounds on his trail\r\nin full chase, could have beaten more anxiously or noisily than did mine\r\nfrom the time I left Baltimore till I reached Philadelphia.  The passage\r\nof the Susquehanna River at Havre de Grace was at that time made by\r\nferry-boat, on board of which I met a young colored man by the name of\r\nNichols, who came very near betraying me.  He was a \"hand\" on the boat,\r\nbut, instead of minding his business, he insisted upon knowing me, and\r\nasking me dangerous questions as to where I was going, when I was coming\r\nback, etc.  I got away from my old and inconvenient acquaintance as soon\r\nas I could decently do so, and went to another part of the boat.  Once\r\nacross the river, I encountered a new danger.  Only a few days before, I\r\nhad been at work on a revenue cutter, in Mr. Price's ship-yard in\r\nBaltimore, under the care of Captain McGowan.  On the meeting at this\r\npoint of the two trains, the one going south stopped on the track just\r\nopposite to the one going north, and it so happened that this Captain\r\nMcGowan sat at a window where he could see me very distinctly, and would\r\ncertainly have recognized me had he looked at me but for a second.\r\nFortunately, in the hurry of the moment, he did not see me; and the\r\ntrains soon passed each other on their respective ways.  But this was not\r\nmy only hair-breadth escape.  A German blacksmith whom I knew well was on\r\nthe train with me, and looked at me very intently, as if he thought he\r\nhad seen me somewhere before in his travels.  I really believe he knew\r\nme, but had no heart to betray me.  At any rate, he saw me escaping and\r\nheld his peace.\r\n\r\nThe last point of imminent danger, and the one I dreaded most, was\r\nWilmington.  Here we left the train and took the steam-boat for\r\nPhiladelphia.  In making the change here I again apprehended arrest, but\r\nno one disturbed me, and I was soon on the broad and beautiful Delaware,\r\nspeeding away to the Quaker City.  On reaching Philadelphia in the\r\nafternoon, I inquired of a colored man how I could get on to New York.\r\nHe directed me to the William-street depot, and thither I went, taking\r\nthe train that night.  I reached New York Tuesday morning, having\r\ncompleted the journey in less than twenty-four hours.\r\n\r\nMy free life began on the third of September, 1838.  On the morning of\r\nthe fourth of that month, after an anxious and most perilous but safe\r\njourney, I found myself in the big city of New York, a FREE MAN--one more\r\nadded to the mighty throng which, like the confused waves of the troubled\r\nsea, surged to and fro between the lofty walls of Broadway.  Though\r\ndazzled with the wonders which met me on every hand, my thoughts could\r\nnot be much withdrawn from my strange situation.  For the moment, the\r\ndreams of my youth and the hopes of my manhood were completely fulfilled.\r\nThe bonds that had held me to \"old master\" were broken.  No man now had a\r\nright to call me his slave or assert mastery over me.  I was in the rough\r\nand tumble of an outdoor world, to take my chance with the rest of its\r\nbusy number.  I have often been asked how I felt when first I found\r\nmyself on free soil.  There is scarcely anything in my experience about\r\nwhich I could not give a more satisfactory answer.  A new world had\r\nopened upon me.  If life is more than breath and the \"quick round of\r\nblood,\" I lived more in that one day than in a year of my slave life.  It\r\nwas a time of joyous excitement which words can but tamely describe.  In\r\na letter written to a friend soon after reaching New York, I said: \"I\r\nfelt as one might feel upon escape from a den of hungry lions.\"  Anguish\r\nand grief, like darkness and rain, may be depicted; but gladness and joy,\r\nlike the rainbow, defy the skill of pen or pencil.  During ten or fifteen\r\nyears I had been, as it were, dragging a heavy chain which no strength of\r\nmine could break; I was not only a slave, but a slave for life.  I might\r\nbecome a husband, a father, an aged man, but through all, from birth to\r\ndeath, from the cradle to the grave, I had felt myself doomed.  All\r\nefforts I had previously made to secure my freedom had not only failed,\r\nbut had seemed only to rivet my fetters the more firmly, and to render my\r\nescape more difficult.  Baffled, entangled, and discouraged, I had at\r\ntimes asked myself the question, May not my condition after all be God's\r\nwork, and ordered for a wise purpose, and if so, Is not submission my\r\nduty?  A contest had in fact been going on in my mind for a long time,\r\nbetween the clear consciousness of right and the plausible make-shifts of\r\ntheology and superstition.  The one held me an abject slave--a prisoner\r\nfor life, punished for some transgression in which I had no lot nor part;\r\nand the other counseled me to manly endeavor to secure my freedom.  This\r\ncontest was now ended; my chains were broken, and the victory brought me\r\nunspeakable joy.\r\n\r\nBut my gladness was short-lived, for I was not yet out of the reach and\r\npower of the slave-holders.  I soon found that New York was not quite so\r\nfree or so safe a refuge as I had supposed, and a sense of loneliness and\r\ninsecurity again oppressed me most sadly. I chanced to meet on the\r\nstreet, a few hours after my landing, a fugitive slave whom I had once\r\nknown well in slavery.  The information received from him alarmed me.\r\nThe fugitive in question was known in Baltimore as \"Allender's Jake,\" but\r\nin New York he wore the more respectable name of \"William Dixon.\"  Jake,\r\nin law, was the property of Doctor Allender, and Tolly Allender, the son\r\nof the doctor, had once made an effort to recapture MR. DIXON, but had\r\nfailed for want of evidence to support his claim.  Jake told me the\r\ncircumstances of this attempt, and how narrowly he escaped being sent\r\nback to slavery and torture.  He told me that New York was then full of\r\nSoutherners returning from the Northern watering-places; that the colored\r\npeople of New York were not to be trusted; that there were hired men of\r\nmy own color who would betray me for a few dollars; that there were hired\r\nmen ever on the lookout for fugitives; that I must trust no man with my\r\nsecret; that I must not think of going either upon the wharves or into\r\nany colored boarding-house, for all such places were closely watched;\r\nthat he was himself unable to help me; and, in fact, he seemed while\r\nspeaking to me to fear lest I myself might be a spy and a betrayer.\r\nUnder this apprehension, as I suppose, he showed signs of wishing to be\r\nrid of me, and with whitewash brush in hand, in search of work, he soon\r\ndisappeared.\r\n\r\nThis picture, given by poor \"Jake,\" of New York, was a damper to my\r\nenthusiasm.  My little store of money would soon be exhausted, and since\r\nit would be unsafe for me to go on the wharves for work, and I had no\r\nintroductions elsewhere, the prospect for me was far from cheerful.  I\r\nsaw the wisdom of keeping away from the ship-yards, for, if pursued, as I\r\nfelt certain I should be, Mr. Auld, my \"master,\" would naturally seek me\r\nthere among the calkers.  Every door seemed closed against me.  I was in\r\nthe midst of an ocean of my fellow-men, and yet a perfect stranger to\r\nevery one.  I was without home, without acquaintance, without money,\r\nwithout credit, without work, and without any definite knowledge as to\r\nwhat course to take, or where to look for succor.  In such an extremity,\r\na man had something besides his new-born freedom to think of.  While\r\nwandering about the streets of New York, and lodging at least one night\r\namong the barrels on one of the wharves, I was indeed free--from slavery,\r\nbut free from food and shelter as well.  I kept my secret to myself as\r\nlong as I could, but I was compelled at last to seek some one who would\r\nbefriend me without taking advantage of my destitution to betray me.\r\nSuch a person I found in a sailor named Stuart, a warm-hearted and\r\ngenerous fellow, who, from his humble home on Centre street, saw me\r\nstanding on the opposite sidewalk, near the Tombs prison.  As he\r\napproached me, I ventured a remark to him which at once enlisted his\r\ninterest in me.  He took me to his home to spend the night, and in the\r\nmorning went with me to Mr. David Ruggles, the secretary of the New York\r\nVigilance Committee, a co-worker with Isaac T. Hopper, Lewis and Arthur\r\nTappan, Theodore S. Wright, Samuel Cornish, Thomas Downing, Philip A.\r\nBell, and other true men of their time.  All these (save Mr. Bell, who\r\nstill lives, and is editor and publisher of a paper called the\r\n\"Elevator,\" in San Francisco) have finished their work on earth.  Once in\r\nthe hands of these brave and wise men, I felt comparatively safe.  With\r\nMr. Ruggles, on the corner of Lispenard and Church streets, I was hidden\r\nseveral days, during which time my intended wife came on from Baltimore\r\nat my call, to share the burdens of life with me.  She was a free woman,\r\nand came at once on getting the good news of my safety.  We were married\r\nby Rev. J. W. C.  Pennington, then a well-known and respected\r\nPresbyterian minister.  I had no money with which to pay the marriage\r\nfee, but he seemed well pleased with our thanks.\r\n\r\nMr. Ruggles was the first officer on the \"Underground Railroad\" whom I\r\nmet after coming North, and was, indeed, the only one with whom I had\r\nanything to do till I became such an officer myself.  Learning that my\r\ntrade was that of a calker, he promptly decided that the best place for\r\nme was in New Bedford, Mass.  He told me that many ships for whaling\r\nvoyages were fitted out there, and that I might there find work at my\r\ntrade and make a good living.  So, on the day of the marriage ceremony,\r\nwe took our little luggage to the steamer John W. Richmond, which, at\r\nthat time, was one of the line running between New York and Newport, R.\r\nI.  Forty-three years ago colored travelers were not permitted in the\r\ncabin, nor allowed abaft the paddle-wheels of a steam vessel.  They were\r\ncompelled, whatever the weather might be,--whether cold or hot, wet or\r\ndry,--to spend the night on deck.  Unjust as this regulation was, it did\r\nnot trouble us much; we had fared much harder before.  We arrived at\r\nNewport the next morning, and soon after an old fashioned stage-coach,\r\nwith \"New Bedford\" in large yellow letters on its sides, came down to the\r\nwharf.  I had not money enough to pay our fare, and stood hesitating what\r\nto do.  Fortunately for us, there were two Quaker gentlemen who were\r\nabout to take passage on the stage,--Friends William C. Taber and Joseph\r\nRicketson,--who at once discerned our true situation, and, in a\r\npeculiarly quiet way, addressing me, Mr. Taber said: \"Thee get in.\" I\r\nnever obeyed an order with more alacrity, and we were soon on our way to\r\nour new home.  When we reached \"Stone Bridge\" the passengers alighted for\r\nbreakfast, and paid their fares to the driver.  We took no breakfast,\r\nand, when asked for our fares, I told the driver I would make it right\r\nwith him when we reached New Bedford.  I expected some objection to this\r\non his part, but he made none.  When, however, we reached New Bedford, he\r\ntook our baggage, including three music-books,--two of them collections\r\nby Dyer, and one by Shaw,--and held them until I was able to redeem them\r\nby paying to him the amount due for our rides.  This was soon done, for\r\nMr. Nathan Johnson not only received me kindly and hospitably, but, on\r\nbeing informed about our baggage, at once loaned me the two dollars with\r\nwhich to square accounts with the stage-driver.  Mr. and Mrs. Nathan\r\nJohnson reached a good old age, and now rest from their labors.  I am\r\nunder many grateful obligations to them.  They not only \"took me in when\r\na stranger\" and \"fed me when hungry,\" but taught me how to make an honest\r\nliving.  Thus, in a fortnight after my flight from Maryland, I was safe\r\nin New Bedford, a citizen of the grand old commonwealth of Massachusetts.\r\n\r\nOnce initiated into my new life of freedom and assured by Mr. Johnson\r\nthat I need not fear recapture in that city, a comparatively unimportant\r\nquestion arose as to the name by which I should be known thereafter in my\r\nnew relation as a free man.  The name given me by my dear mother was no\r\nless pretentious and long than Frederick Augustus Washington Bailey.  I\r\nhad, however, while living in Maryland, dispensed with the Augustus\r\nWashington, and retained only Frederick Bailey.  Between Baltimore and\r\nNew Bedford, the better to conceal myself from the slave-hunters, I had\r\nparted with Bailey and called myself Johnson; but in New Bedford I found\r\nthat the Johnson family was already so numerous as to cause some\r\nconfusion in distinguishing them, hence a change in this name seemed\r\ndesirable.  Nathan Johnson, mine host, placed great emphasis upon this\r\nnecessity, and wished me to allow him to select a name for me.  I\r\nconsented, and he called me by my present name--the one by which I have\r\nbeen known for three and forty years--Frederick Douglass.  Mr. Johnson\r\nhad just been reading the \"Lady of the Lake,\" and so pleased was he with\r\nits great character that he wished me to bear his name.  Since reading\r\nthat charming poem myself, I have often thought that, considering the\r\nnoble hospitality and manly character of Nathan Johnson--black man though\r\nhe was--he, far more than I, illustrated the virtues of the Douglas of\r\nScotland.  Sure am I that, if any slave-catcher had entered his domicile\r\nwith a view to my recapture, Johnson would have shown himself like him of\r\nthe \"stalwart hand.\"\r\n\r\nThe reader may be surprised at the impressions I had in some way\r\nconceived of the social and material condition of the people at the\r\nNorth.  I had no proper idea of the wealth, refinement, enterprise, and\r\nhigh civilization of this section of the country.  My \"Columbian Orator,\"\r\nalmost my only book, had done nothing to enlighten me concerning Northern\r\nsociety.  I had been taught that slavery was the bottom fact of all\r\nwealth.  With this foundation idea, I came naturally to the conclusion\r\nthat poverty must be the general condition of the people of the free\r\nStates.  In the country from which I came, a white man holding no slaves\r\nwas usually an ignorant and poverty-stricken man, and men of this class\r\nwere contemptuously called \"poor white trash.\" Hence I supposed that,\r\nsince the non-slave-holders at the South were ignorant, poor, and\r\ndegraded as a class, the non-slave-holders at the North must be in a\r\nsimilar condition.  I could have landed in no part of the United States\r\nwhere I should have found a more striking and gratifying contrast, not\r\nonly to life generally in the South, but in the condition of the colored\r\npeople there, than in New Bedford. I was amazed when Mr. Johnson told me\r\nthat there was nothing in the laws or constitution of Massachusetts that\r\nwould prevent a colored man from being governor of the State, if the\r\npeople should see fit to elect him.  There, too, the black man's children\r\nattended the public schools with the white man's children, and apparently\r\nwithout objection from any quarter.  To impress me with my security from\r\nrecapture and return to slavery, Mr. Johnson assured me that no\r\nslave-holder could take a slave out of New Bedford; that there were men\r\nthere who would lay down their lives to save me from such a fate.\r\n\r\nThe fifth day after my arrival, I put on the clothes of a common laborer,\r\nand went upon the wharves in search of work.  On my way down Union street\r\nI saw a large pile of coal in front of the house of Rev.  Ephraim\r\nPeabody, the Unitarian minister.  I went to the kitchen door and asked\r\nthe privilege of bringing in and putting away this coal.  \"What will you\r\ncharge?\" said the lady.  \"I will leave that to you, madam.\"  \"You may put\r\nit away,\" she said.  I was not long in accomplishing the job, when the\r\ndear lady put into my hand TWO SILVER HALF-DOLLARS.  To understand the\r\nemotion which swelled my heart as I clasped this money, realizing that I\r\nhad no master who could take it from me,--THAT IT WAS MINE--THAT MY HANDS\r\nWERE MY OWN, and could earn more of the precious coin,--one must have\r\nbeen in some sense himself a slave.  My next job was stowing a sloop at\r\nUncle Gid. Howland's wharf with a cargo of oil for New York.  I was not\r\nonly a freeman, but a free working-man, and no \"master\" stood ready at\r\nthe end of the week to seize my hard earnings.\r\n\r\nThe season was growing late and work was plenty.  Ships were being fitted\r\nout for whaling, and much wood was used in storing them.  The sawing this\r\nwood was considered a good job.  With the help of old Friend Johnson\r\n(blessings on his memory) I got a saw and \"buck,\" and went at it.  When I\r\nwent into a store to buy a cord with which to brace up my saw in the\r\nframe, I asked for a \"fip's\" worth of cord.  The man behind the counter\r\nlooked rather sharply at me, and said with equal sharpness, \"You don't\r\nbelong about here.\" I was alarmed, and thought I had betrayed myself.  A\r\nfip in Maryland was six and a quarter cents, called fourpence in\r\nMassachusetts.  But no harm came from the \"fi'penny-bit\" blunder, and I\r\nconfidently and cheerfully went to work with my saw and buck.  It was new\r\nbusiness to me, but I never did better work, or more of it, in the same\r\nspace of time on the plantation for Covey, the negro-breaker, than I did\r\nfor myself in these earliest years of my freedom.\r\n\r\nNotwithstanding the just and humane sentiment of New Bedford three and\r\nforty years ago, the place was not entirely free from race and color\r\nprejudice.  The good influence of the Roaches, Rodmans, Arnolds,\r\nGrinnells, and Robesons did not pervade all classes of its people.  The\r\ntest of the real civilization of the community came when I applied for\r\nwork at my trade, and then my repulse was emphatic and decisive.  It so\r\nhappened that Mr. Rodney French, a wealthy and enterprising citizen,\r\ndistinguished as an anti-slavery man, was fitting out a vessel for a\r\nwhaling voyage, upon which there was a heavy job of calking and coppering\r\nto be done.  I had some skill in both branches, and applied to Mr. French\r\nfor work.  He, generous man that he was, told me he would employ me, and\r\nI might go at once to the vessel.  I obeyed him, but upon reaching the\r\nfloat-stage, where others [sic] calkers were at work, I was told that\r\nevery white man would leave the ship, in her unfinished condition, if I\r\nstruck a blow at my trade upon her.  This uncivil, inhuman, and selfish\r\ntreatment was not so shocking and scandalous in my eyes at the time as it\r\nnow appears to me.  Slavery had inured me to hardships that made ordinary\r\ntrouble sit lightly upon me.  Could I have worked at my trade I could\r\nhave earned two dollars a day, but as a common laborer I received but one\r\ndollar.  The difference was of great importance to me, but if I could not\r\nget two dollars, I was glad to get one; and so I went to work for Mr.\r\nFrench as a common laborer.  The consciousness that I was free--no longer\r\na slave--kept me cheerful under this, and many similar proscriptions,\r\nwhich I was destined to meet in New Bedford and elsewhere on the free\r\nsoil of Massachusetts.  For instance, though colored children attended\r\nthe schools, and were treated kindly by their teachers, the New Bedford\r\nLyceum refused, till several years after my residence in that city, to\r\nallow any colored person to attend the lectures delivered in its hall.\r\nNot until such men as Charles Sumner, Theodore Parker, Ralph Waldo\r\nEmerson, and Horace Mann refused to lecture in their course while there\r\nwas such a restriction, was it abandoned.\r\n\r\nBecoming satisfied that I could not rely on my trade in New Bedford to\r\ngive me a living, I prepared myself to do any kind of work that came to\r\nhand.  I sawed wood, shoveled coal, dug cellars, moved rubbish from back\r\nyards, worked on the wharves, loaded and unloaded vessels, and scoured\r\ntheir cabins.\r\n\r\nI afterward got steady work at the brass-foundry owned by Mr. Richmond.\r\nMy duty here was to blow the bellows, swing the crane, and empty the\r\nflasks in which castings were made; and at times this was hot and heavy\r\nwork.  The articles produced here were mostly for ship work, and in the\r\nbusy season the foundry was in operation night and day.  I have often\r\nworked two nights and every working day of the week.  My foreman, Mr.\r\nCobb, was a good man, and more than once protected me from abuse that one\r\nor more of the hands was disposed to throw upon me.  While in this\r\nsituation I had little time for mental improvement.  Hard work, night and\r\nday, over a furnace hot enough to keep the metal running like water, was\r\nmore favorable to action than thought; yet here I often nailed a\r\nnewspaper to the post near my bellows, and read while I was performing\r\nthe up and down motion of the heavy beam by which the bellows was\r\ninflated and discharged.  It was the pursuit of knowledge under\r\ndifficulties, and I look back to it now, after so many years, with some\r\ncomplacency and a little wonder that I could have been so earnest and\r\npersevering in any pursuit other than for my daily bread.  I certainly\r\nsaw nothing in the conduct of those around to inspire me with such\r\ninterest: they were all devoted exclusively to what their hands found to\r\ndo.  I am glad to be able to say that, during my engagement in this\r\nfoundry, no complaint was ever made against me that I did not do my work,\r\nand do it well.  The bellows which I worked by main strength was, after I\r\nleft, moved by a steam-engine.\r\n\r\n\r\n\r\n\r\nDouglass, Frederick.  \"Reconstruction.\"\r\n\r\nAtlantic Monthly 18 (1866): 761-765.\r\n\r\n\r\n\r\nRECONSTRUCTION\r\n\r\n\r\nThe assembling of the Second Session of the Thirty-ninth Congress may\r\nvery properly be made the occasion of a few earnest words on the already\r\nmuch-worn topic of reconstruction.\r\n\r\nSeldom has any legislative body been the subject of a solicitude more\r\nintense, or of aspirations more sincere and ardent.  There are the best\r\nof reasons for this profound interest.  Questions of vast moment, left\r\nundecided by the last session of Congress, must be manfully grappled with\r\nby this.  No political skirmishing will avail.  The occasion demands\r\nstatesmanship.\r\n\r\nWhether the tremendous war so heroically fought and so victoriously ended\r\nshall pass into history a miserable failure, barren of permanent\r\nresults,--a scandalous and shocking waste of blood and treasure,--a\r\nstrife for empire, as Earl Russell characterized it, of no value to\r\nliberty or civilization,--an attempt to re-establish a Union by force,\r\nwhich must be the merest mockery of a Union,--an effort to bring under\r\nFederal authority States into which no loyal man from the North may\r\nsafely enter, and to bring men into the national councils who deliberate\r\nwith daggers and vote with revolvers, and who do not even conceal their\r\ndeadly hate of the country that conquered them; or whether, on the other\r\nhand, we shall, as the rightful reward of victory over treason, have a\r\nsolid nation, entirely delivered from all contradictions and social\r\nantagonisms, based upon loyalty, liberty, and equality, must be\r\ndetermined one way or the other by the present session of Congress.  The\r\nlast session really did nothing which can be considered final as to these\r\nquestions.  The Civil Rights Bill and the Freedmen's Bureau Bill and the\r\nproposed constitutional amendments, with the amendment already adopted\r\nand recognized as the law of the land, do not reach the difficulty, and\r\ncannot, unless the whole structure of the government is changed from a\r\ngovernment by States to something like a despotic central government,\r\nwith power to control even the municipal regulations of States, and to\r\nmake them conform to its own despotic will.  While there remains such an\r\nidea as the right of each State to control its own local affairs,--an\r\nidea, by the way, more deeply rooted in the minds of men of all sections\r\nof the country than perhaps any one other political idea,--no general\r\nassertion of human rights can be of any practical value.  To change the\r\ncharacter of the government at this point is neither possible nor\r\ndesirable.  All that is necessary to be done is to make the government\r\nconsistent with itself, and render the rights of the States compatible\r\nwith the sacred rights of human nature.\r\n\r\nThe arm of the Federal government is long, but it is far too short to\r\nprotect the rights of individuals in the interior of distant States.\r\nThey must have the power to protect themselves, or they will go\r\nunprotected, spite of all the laws the Federal government can put upon\r\nthe national statute-book.\r\n\r\nSlavery, like all other great systems of wrong, founded in the depths of\r\nhuman selfishness, and existing for ages, has not neglected its own\r\nconservation.  It has steadily exerted an influence upon all around it\r\nfavorable to its own continuance.  And to-day it is so strong that it\r\ncould exist, not only without law, but even against law.  Custom,\r\nmanners, morals, religion, are all on its side everywhere in the South;\r\nand when you add the ignorance and servility of the ex-slave to the\r\nintelligence and accustomed authority of the master, you have the\r\nconditions, not out of which slavery will again grow, but under which it\r\nis impossible for the Federal government to wholly destroy it, unless the\r\nFederal government be armed with despotic power, to blot out State\r\nauthority, and to station a Federal officer at every cross-road.  This,\r\nof course, cannot be done, and ought not even if it could.  The true way\r\nand the easiest way is to make our government entirely consistent with\r\nitself, and give to every loyal citizen the elective franchise,--a right\r\nand power which will be ever present, and will form a wall of fire for\r\nhis protection.\r\n\r\nOne of the invaluable compensations of the late Rebellion is the highly\r\ninstructive disclosure it made of the true source of danger to republican\r\ngovernment.  Whatever may be tolerated in monarchical and despotic\r\ngovernments, no republic is safe that tolerates a privileged class, or\r\ndenies to any of its citizens equal rights and equal means to maintain\r\nthem.  What was theory before the war has been made fact by the war.\r\n\r\nThere is cause to be thankful even for rebellion.  It is an impressive\r\nteacher, though a stern and terrible one.  In both characters it has come\r\nto us, and it was perhaps needed in both.  It is an instructor never a\r\nday before its time, for it comes only when all other means of progress\r\nand enlightenment have failed.  Whether the oppressed and despairing\r\nbondman, no longer able to repress his deep yearnings for manhood, or the\r\ntyrant, in his pride and impatience, takes the initiative, and strikes\r\nthe blow for a firmer hold and a longer lease of oppression, the result\r\nis the same,--society is instructed, or may be.\r\n\r\nSuch are the limitations of the common mind, and so thoroughly engrossing\r\nare the cares of common life, that only the few among men can discern\r\nthrough the glitter and dazzle of present prosperity the dark outlines of\r\napproaching disasters, even though they may have come up to our very\r\ngates, and are already within striking distance.  The yawning seam and\r\ncorroded bolt conceal their defects from the mariner until the storm\r\ncalls all hands to the pumps.  Prophets, indeed, were abundant before the\r\nwar; but who cares for prophets while their predictions remain\r\nunfulfilled, and the calamities of which they tell are masked behind a\r\nblinding blaze of national prosperity?\r\n\r\nIt is asked, said Henry Clay, on a memorable occasion, Will slavery never\r\ncome to an end?  That question, said he, was asked fifty years ago, and\r\nit has been answered by fifty years of unprecedented prosperity.  Spite\r\nof the eloquence of the earnest Abolitionists,--poured out against\r\nslavery during thirty years,--even they must confess, that, in all the\r\nprobabilities of the case, that system of barbarism would have continued\r\nits horrors far beyond the limits of the nineteenth century but for the\r\nRebellion, and perhaps only have disappeared at last in a fiery conflict,\r\neven more fierce and bloody than that which has now been suppressed.\r\n\r\nIt is no disparagement to truth, that it can only prevail where reason\r\nprevails.  War begins where reason ends.  The thing worse than rebellion\r\nis the thing that causes rebellion.  What that thing is, we have been\r\ntaught to our cost.  It remains now to be seen whether we have the needed\r\ncourage to have that cause entirely removed from the Republic.  At any\r\nrate, to this grand work of national regeneration and entire purification\r\nCongress must now address Itself, with full purpose that the work shall\r\nthis time be thoroughly done.  The deadly upas, root and branch, leaf and\r\nfibre, body and sap, must be utterly destroyed.  The country is evidently\r\nnot in a condition to listen patiently to pleas for postponement, however\r\nplausible, nor will it permit the responsibility to be shifted to other\r\nshoulders.  Authority and power are here commensurate with the duty\r\nimposed.  There are no cloud-flung shadows to obscure the way.  Truth\r\nshines with brighter light and intenser heat at every moment, and a\r\ncountry torn and rent and bleeding implores relief from its distress and\r\nagony.\r\n\r\nIf time was at first needed, Congress has now had time.  All the\r\nrequisite materials from which to form an intelligent judgment are now\r\nbefore it.  Whether its members look at the origin, the progress, the\r\ntermination of the war, or at the mockery of a peace now existing, they\r\nwill find only one unbroken chain of argument in favor of a radical\r\npolicy of reconstruction.  For the omissions of the last session, some\r\nexcuses may be allowed.  A treacherous President stood in the way; and it\r\ncan be easily seen how reluctant good men might be to admit an apostasy\r\nwhich involved so much of baseness and ingratitude.  It was natural that\r\nthey should seek to save him by bending to him even when he leaned to the\r\nside of error.  But all is changed now.  Congress knows now that it must\r\ngo on without his aid, and even against his machinations.  The advantage\r\nof the present session over the last is immense.  Where that\r\ninvestigated, this has the facts.  Where that walked by faith, this may\r\nwalk by sight.  Where that halted, this must go forward, and where that\r\nfailed, this must succeed, giving the country whole measures where that\r\ngave us half-measures, merely as a means of saving the elections in a few\r\ndoubtful districts.  That Congress saw what was right, but distrusted the\r\nenlightenment of the loyal masses; but what was forborne in distrust of\r\nthe people must now be done with a full knowledge that the people expect\r\nand require it.  The members go to Washington fresh from the inspiring\r\npresence of the people.  In every considerable public meeting, and in\r\nalmost every conceivable way, whether at court-house, school-house, or\r\ncross-roads, in doors and out, the subject has been discussed, and the\r\npeople have emphatically pronounced in favor of a radical policy.\r\nListening to the doctrines of expediency and compromise with pity,\r\nimpatience, and disgust, they have everywhere broken into demonstrations\r\nof the wildest enthusiasm when a brave word has been spoken in favor of\r\nequal rights and impartial suffrage.  Radicalism, so far from being\r\nodious, is not the popular passport to power.  The men most bitterly\r\ncharged with it go to Congress with the largest majorities, while the\r\ntimid and doubtful are sent by lean majorities, or else left at home.\r\nThe strange controversy between the President and the Congress, at one\r\ntime so threatening, is disposed of by the people.  The high\r\nreconstructive powers which he so confidently, ostentatiously, and\r\nhaughtily claimed, have been disallowed, denounced, and utterly\r\nrepudiated; while those claimed by Congress have been confirmed.\r\n\r\nOf the spirit and magnitude of the canvass nothing need be said.  The\r\nappeal was to the people, and the verdict was worthy of the tribunal.\r\nUpon an occasion of his own selection, with the advice and approval of\r\nhis astute Secretary, soon after the members of the Congress had returned\r\nto their constituents, the President quitted the executive mansion,\r\nsandwiched himself between two recognized heroes,--men whom the whole\r\ncountry delighted to honor,--and, with all the advantage which such\r\ncompany could give him, stumped the country from the Atlantic to the\r\nMississippi, advocating everywhere his policy as against that of\r\nCongress.  It was a strange sight, and perhaps the most disgraceful\r\nexhibition ever made by any President; but, as no evil is entirely\r\nunmixed, good has come of this, as from many others.  Ambitious,\r\nunscrupulous, energetic, indefatigable, voluble, and plausible,--a\r\npolitical gladiator, ready for a \"set-to\" in any crowd,--he is beaten in\r\nhis own chosen field, and stands to-day before the country as a convicted\r\nusurper, a political criminal, guilty of a bold and persistent attempt to\r\npossess himself of the legislative powers solemnly secured to Congress by\r\nthe Constitution.  No vindication could be more complete, no condemnation\r\ncould be more absolute and humiliating.  Unless reopened by the sword, as\r\nrecklessly threatened in some circles, this question is now closed for\r\nall time.\r\n\r\nWithout attempting to settle here the metaphysical and somewhat\r\ntheological question (about which so much has already been said and\r\nwritten), whether once in the Union means always in the Union,--agreeably\r\nto the formula, Once in grace always in grace,--it is obvious to common\r\nsense that the rebellious States stand to-day, in point of law, precisely\r\nwhere they stood when, exhausted, beaten, conquered, they fell powerless\r\nat the feet of Federal authority.  Their State governments were\r\noverthrown, and the lives and property of the leaders of the Rebellion\r\nwere forfeited.  In reconstructing the institutions of these shattered\r\nand overthrown States, Congress should begin with a clean slate, and make\r\nclean work of it.  Let there be no hesitation.  It would be a cowardly\r\ndeference to a defeated and treacherous President, if any account were\r\nmade of the illegitimate, one-sided, sham governments hurried into\r\nexistence for a malign purpose in the absence of Congress.  These\r\npretended governments, which were never submitted to the people, and from\r\nparticipation in which four millions of the loyal people were excluded by\r\nPresidential order, should now be treated according to their true\r\ncharacter, as shams and impositions, and supplanted by true and\r\nlegitimate governments, in the formation of which loyal men, black and\r\nwhite, shall participate.\r\n\r\nIt is not, however, within the scope of this paper to point out the\r\nprecise steps to be taken, and the means to be employed.  The people are\r\nless concerned about these than the grand end to be attained.  They\r\ndemand such a reconstruction as shall put an end to the present\r\nanarchical state of things in the late rebellious States,--where\r\nfrightful murders and wholesale massacres are perpetrated in the very\r\npresence of Federal soldiers.  This horrible business they require shall\r\ncease.  They want a reconstruction such as will protect loyal men, black\r\nand white, in their persons and property; such a one as will cause\r\nNorthern industry, Northern capital, and Northern civilization to flow\r\ninto the South, and make a man from New England as much at home in\r\nCarolina as elsewhere in the Republic.  No Chinese wall can now be\r\ntolerated.  The South must be opened to the light of law and liberty, and\r\nthis session of Congress is relied upon to accomplish this important work.\r\n\r\nThe plain, common-sense way of doing this work, as intimated at the\r\nbeginning, is simply to establish in the South one law, one government,\r\none administration of justice, one condition to the exercise of the\r\nelective franchise, for men of all races and colors alike.  This great\r\nmeasure is sought as earnestly by loyal white men as by loyal blacks, and\r\nis needed alike by both.  Let sound political prescience but take the\r\nplace of an unreasoning prejudice, and this will be done.\r\n\r\nMen denounce the negro for his prominence in this discussion; but it is\r\nno fault of his that in peace as in war, that in conquering Rebel armies\r\nas in reconstructing the rebellious States, the right of the negro is the\r\ntrue solution of our national troubles.  The stern logic of events, which\r\ngoes directly to the point, disdaining all concern for the color or\r\nfeatures of men, has determined the interests of the country as identical\r\nwith and inseparable from those of the negro.\r\n\r\nThe policy that emancipated and armed the negro--now seen to have been\r\nwise and proper by the dullest--was not certainly more sternly demanded\r\nthan is now the policy of enfranchisement.  If with the negro was success\r\nin war, and without him failure, so in peace it will be found that the\r\nnation must fall or flourish with the negro.\r\n\r\nFortunately, the Constitution of the United States knows no distinction\r\nbetween citizens on account of color.  Neither does it know any\r\ndifference between a citizen of a State and a citizen of the United\r\nStates.  Citizenship evidently includes all the rights of citizens,\r\nwhether State or national.  If the Constitution knows none, it is clearly\r\nno part of the duty of a Republican Congress now to institute one.  The\r\nmistake of the last session was the attempt to do this very thing, by a\r\nrenunciation of its power to secure political rights to any class of\r\ncitizens, with the obvious purpose to allow the rebellious States to\r\ndisfranchise, if they should see fit, their colored citizens.  This\r\nunfortunate blunder must now be retrieved, and the emasculated\r\ncitizenship given to the negro supplanted by that contemplated in the\r\nConstitution of the United States, which declares that the citizens of\r\neach State shall enjoy all the rights and immunities of citizens of the\r\nseveral States,--so that a legal voter in any State shall be a legal\r\nvoter in all the States.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nEnd of the Project Gutenberg EBook of Collected Articles of Frederick\r\nDouglass, by Frederick Douglass\r\n",
    "textIndexes": {
        "header": 18,
        "footer": 779
    },
    "buildPath": "./json//pg99.json",
    "wordcount": 8267
}